[{"title": "2024 MLB City Connect uniforms: Rays unveil alternate look", "url": "https://www.foxsports.com/stories/mlb/2024-mlb-city-connect-uniforms", "content": "The Tampa Bay Rays are adding a City Connect uniform to their closet.\nTampa Bay unveiled its City Connect uniforms on Monday, becoming the 23rd MLB team to embrace the alternate look since the Nike-backed brand launched in 2021.\nThe Rays' City Connect uniforms have \"Tampa Bay\" written across the chest in neon coloring, a similar look they had on their road jerseys in their first three seasons as a franchise (1998-2000), to go with the dark base. It marks the first time the Rays will have their city name written across their chest since 2007.\nTampa Bay's skater culture inspired some of the look. The flames coming off each letter on the nameplate on the front of the jersey include flames, which are meant to honor street art and skate media, such as \"Thrasher\" magazine. Gradient accents cover the sleeves and pants of the uniforms, purposely making them asymmetrically as a symbol of doing things differently. \nThe Rays wanted to capture the feel of what it's like to be in Tampa Bay, displaying a look of what people see when they're in the city and calling it \"Grit and Glow.\"\n[Related: Report: MLB plans to address players' uniform complaints per union memo]\n\"When we started thinking about that feeling that you have when you're in some of these really special places around this community, it's fueled by this energy,\" Rays chief business officer Bill Walsh said in a statement. \"A lot of these types of countercultures, creative cultures, they're really at the center of that in terms of creating that vibe.\"\nThe Rays honored some local landmarks with their caps and logos. The main logo on the caps features the Sunshine Skyway Bridge in the outline of a sting ray. A second logo has three palm trees and a pelican. The palm trees logo replicates the mark seen on Florida Historical Makers, such as Perry Harvey Sr. Park, Florida's first public skatepark. The other logo is a stingray on a skateboard, further embracing the city's skater culture.\n\"It's also something we think that we have in common as an organization,\" Walsh said of Tampa Bay's skater culture in the statment. \"We have demonstrated that, that you've kind of got to be willing to go against the grain and have some courage and disrupt. So I think it's exciting that there's that overlap, too.\"\nThe Rays will debut the uniforms in their three-game home series against the New York Mets this season. They'll wear the alternate look in every Saturday home game after that.\nPhiladelphia Phillies\nThe Phillies were the first team to unveil their City Connect uniforms this season. \"PHILLY\" is written across the chest in white coloring while the uniform's colors resemble the city's flag. The cap's logo is the Liberty Bell with the same coloring as the city's flag, which has Philadelphia's skyline placed within the logo. \n[Want great stories delivered right to your inbox? Create or log in to your FOX Sports account, follow leagues, teams and players to receive a personalized newsletter daily.]\nNew York Mets\nThe Mets introduced their City Connect uniforms in April. It's a base gray uniform with \"NYC\" stitched on the front and the Queensboro Bridge on the hat. The jersey also has a black patch on the arm with the Mets logo in pink lettering.\n[Read more: New York Mets release 'City Connect' jersey with new color scheme]\nOther teams set to unveil City Connect uniforms in 2024\nCleveland GuardiansDetroit TigersLos Angeles Dodgers (will release their second look after releasing first look in 2021)Minnesota TwinsSt. Louis Cardinals Toronto Blue Jays\nCleveland Guardians\nDetroit Tigers\nLos Angeles Dodgers (will release their second look after releasing first look in 2021)\nMinnesota Twins\nSt. Louis Cardinals \nToronto Blue Jays\n \n", "description": "The Tampa Bay Rays become the 23rd team to unveil City Connect jerseys, embracing the city's skater culture as part of their look. Check out all the latest alternates here!", "hero_img": "https://statics.foxsports.com/www.foxsports.com/content/uploads/2024/04/Tampa-Bay-Rays.jpg", "thumbnail": "https://a57.foxsports.com/statics.foxsports.com/www.foxsports.com/content/uploads/2024/04/128/72/Tampa-Bay-Rays.jpg", "category": "MLB", "date": "Mon, 29 Apr 2024 14:24:33 -0400", "comments": []}, {"title": "Crew chief says Aaron Judge should have been called for interference on slide during Yankees' rally", "url": "https://www.foxsports.com/stories/mlb/crew-chief-says-aaron-judge-should-have-been-called-for-interference-on-slide-during-yankees-rally", "content": "Aaron Judge should have been called for interference for his slide on a botched double-play attempt that sparked New York's winning rally Sunday at Milwaukee, crew chief Andy Fletcher acknowledged after the Yankees' 15-5 victory.\nWith the score tied 4-all in the sixth inning, Judge raised his left arm while sliding into second base after Alex Verdugo hit a bouncer to the right side of the infield. Brewers shortstop Willy Adames was attempting to complete the double play when his throw bounced off Judge's padded hand and landed on the ground, enabling Verdugo to reach safely.\nThe Yankees went on to score seven runs in the inning, all with two outs.\n\"On the field, we got together and did the best that we could to come up with the correct answer,\" Fletcher told a pool reporter after the game. \"After looking at it off the field in replay, it appears that the call was missed. It should've been called interference because it wasn't a natural part of his slide. It didn't appear that way to us. We did everything we could to get together and get it right. But after looking at it, it appears that it should've been called interference.\"\nFletcher noted the call isn't reviewable.\nJudge said he had no worries about getting called for interference even as the crew gathered to discuss the play.\n\"No, that's never happened before in my life, and I've been sliding like that for years,\" Judge said.\nBrewers manager Pat Murphy had come out of the dugout to argue for an interference call. He continued pleading his case while speaking to reporters after the game.\n\"It's hard to say that he wasn't making an attempt at least purposely to obstruct,\" Murphy said. \"I don't think he wanted to get hit by the ball, but I think he was trying to purposely obstruct. That's my opinion. I don't know what his intent was. He seems like a wonderful man, but very competitive also.\"\nAdames noted how Judge's 6-foot-7 frame made it particularly difficult to attempt a throw to first.\n\"He's like 7 feet tall,\" Adames said. \"He's huge. I think when he puts his hands up, he's taller than me even when he's sliding to second base. It's a tough space for me to throw the ball.\"\nJudge reached on a leadoff walk before Verdugo hit his bouncer to second baseman Brice Turang, who threw to Adames to retire Judge at second. As Judge raised his left arm on his slide to second, he was wearing a sliding glove on his hand. Judge, who said the throw hit him on the side of his fingers, noted he frequently slides that way.\n\"You can look back at any picture you want of me sliding into second base,\" Judge said. \"That's always happened.\"\nIt appeared the lack of an interference call wouldn't make much of a difference in Sunday's outcome after Abner Uribe retired Giancarlo Stanton on a pop fly for the second out of the inning. But everything fell apart for the Brewers from that point on.\nVerdugo advanced on Anthony Rizzo's walk and scored the go-ahead run on Gleyber Torres' single to center. Oswaldo Cabrera walked to load the bases before Jose Trevino singled home two runs. Elvis Peguero replaced Uribe and threw a wild pitch that brought home Cabrera. After Anthony Volpe walked, Juan Soto hit an RBI single.\nVolpe and Soto executed a double steal while Judge was at the plate receiving a chorus of boos from the American Family Field crowd. Judge capped the seven-run outburst with a two-run single that extended the Yankees' lead to 11-4.\nThe Brewers never recovered from the missed call.\n\"They admitted they messed up,\" Adames said. \"We mess up sometimes. That's how it goes sometimes.\"\nReporting by The Associated Press.\n[Want great stories delivered right to your inbox? Create or log in to your FOX Sports account, follow leagues, teams and players to receive a personalized newsletter daily.]\n", "description": "Crew chief Andy Fletcher says Aaron Judge should have been called for interference for his slide on a botched double-play attempt that sparked New York’s winning rally in the Yankees’ 15-5 victory at Milwaukee.", "hero_img": "https://statics.foxsports.com/www.foxsports.com/content/uploads/2024/02/Aaron-Judge-horizontal-022024.jpg", "thumbnail": "https://a57.foxsports.com/statics.foxsports.com/www.foxsports.com/content/uploads/2024/02/128/72/Aaron-Judge-horizontal-022024.jpg", "category": "MLB", "date": "Sun, 28 Apr 2024 20:52:42 -0400", "comments": []}, {"title": "MLB to address Nike uniform issues after players' complaints, per memo", "url": "https://www.foxsports.com/stories/mlb/report-mlb-plans-to-address-players-uniform-complaints-per-union-memo", "content": "Major League Baseball plans to introduce changes to the oft-criticized new Nike uniforms this season, ESPN reported.\nAccording to ESPN, a memo sent out by the MLB Players' Association on Sunday said that Nike — not Fanatics, which manufactures the uniforms — was to blame for the uniform issues that caused criticism from both fans and players when the jerseys were rolled out at the beginning of spring training.\nThe fixes that MLB reportedly plans to make to the uniforms include a return to larger name lettering on the backs of jerseys, fixing mismatched shades of gray on road jerseys and pants, and reverting to a \"higher quality zipper\" on the pants.\nThe memo reportedly went as far as praising Fanatics for how it has listened to player and fan feedback while shading Nike for not taking a similar approach. \nNike has been MLB's official uniform supplier since 2019.\n[Want great stories delivered right to your inbox? Create or log in to your FOX Sports account, follow leagues, teams and players to receive a personalized newsletter daily.]\n", "description": "Major League Baseball plans to introduce changes to the oft-criticized new Nike uniforms this season, according to a report.", "hero_img": "https://statics.foxsports.com/www.foxsports.com/content/uploads/2024/04/AnthonyRizzo.jpg", "thumbnail": "https://a57.foxsports.com/statics.foxsports.com/www.foxsports.com/content/uploads/2024/04/128/72/AnthonyRizzo.jpg", "category": "MLB", "date": "Sun, 28 Apr 2024 20:37:58 -0400", "comments": []}, {"title": "Yankees' Gerrit Cole unlikely to return from IL before June", "url": "https://www.foxsports.com/stories/mlb/yankees-gerrit-cole-unlikely-to-return-from-il-before-june", "content": "Don't expect to see Gerrit Cole back on the pitcher's mound in a New York Yankees game any time soon.\nThe six-time All-Star and reigning American League Cy Young Award winner has been dealing with elbow discomfort since spring training and has yet to appear in a game this season. Cole was shut down from baseball activities after his first spring start and placed on the 60-day injured list before the regular season began in late March. He is not eligible to be activated off that list until May 27.\nYankees fans got a glimmer of hope last week when cameras caught Cole playing catch on flat ground at Yankee Stadium. But according to FOX Sports MLB insider Ken Rosenthal, the Yankees ace will likely have to wait to make his return to the active roster.\n\"It's probably unlikely he'll be ready at that time,\" Rosenthal said Monday on FS1. \"It's a six-week buildup normally for pitchers in spring training, and that would be before six weeks [of Cole returning to baseball activities] are up. The good news for the Yankees is that they're winning, and they're doing really well without Cole, so there's no need to push this.\"\nRosenthal did say that Cole is expected to take another step in his rehab by throwing off a mound at some point this coming week.\nThe Yankees are currently 19-10 and one game ahead of the Baltimore Orioles in the American League East despite getting nothing from Cole so far and a slow start to the season from superstar slugger and 2022 AL MVP Aaron Judge.\n[Want great stories delivered right to your inbox? Create or log in to your FOX Sports account, follow leagues, teams and players to receive a personalized newsletter daily.]\n", "description": "Gerrit Cole is unlikely to return to action for the Yankees when he is eligible on May 27, according to a report by FOX Sports' Ken Rosenthal.", "hero_img": "https://statics.foxsports.com/www.foxsports.com/content/uploads/2024/04/GerritCole10.jpg", "thumbnail": "https://a57.foxsports.com/statics.foxsports.com/www.foxsports.com/content/uploads/2024/04/128/72/GerritCole10.jpg", "category": "MLB", "date": "Mon, 29 Apr 2024 20:32:28 -0400", "comments": []}, {"title": "Minnesota Twins' new home-run sausage is fueling their seven-game winning streak", "url": "https://www.foxsports.com/stories/mlb/minnesota-twins-new-home-run-sausage-is-fueling-their-seven-game-winning-streak", "content": "The Minnesota Twins are no stranger to unique home-run celebrations. Last season, the team introduced a fishing vest and toy fishing pole to the dugout, a nod to the state's 10,000 lakes.\nThis year, it's none other than a midwestern delicacy — the summer sausage — fueling the Twins' seven-game winning streak.\nIn Thursday's matchup against the White Sox, the Twins faced a 2-0 deficit in the bottom of the sixth inning. Then, hitting coach David Popkins brought a Cloverdale Foods tangy summer sausage into the dugout and beckoned his players to tap it before they hit.\nThe presence of the sausage ignited a flurry of hits, including back-to-back homers from Edouard Julien and Ryan Jeffers in the same inning. After Carlos Santana homered in the eighth, Jeffers tossed the sausage to the first baseman on his return to the dugout and the home-run celebration was born.\n\"It was a bad toss, I needed to get it a little higher,\" Jeffers said. \"So, we'll work on our alley-oop skills.\"\nSince then, the sausage has been by the Twins' side, and they have plenty of success to show for it. After sweeping the White Sox, Minnesota went to Los Angeles where they totaled 32 runs and 45 hits to win three straight against the Angels.\nThe sausage has been traveling with the team in a Ziploc bag shoved into a shoe. When it comes to their upcoming games in Toronto, it's unclear whether the sausage will make it through customs — though Jeffers is confident they can find a way.\nIn contrast to other MLB dugout celebrations, the Twins choice is unfortunately perishable. Jeffers said they're working on locating a fresh sausage for every series.\n\"It's bringing us a lot of hits and runs, so I'm all for it,\" said Twins manager Rocco Baldelli. \"I'm slightly concerned that the package is going to open up. The thing hasn't been refrigerated in many days, and there's no doubt that when that thing opens up whoever's touching it is in deep trouble.\"\nJeffers echoed Baldelli: \"He doesn't want another epidemic. We don't want the Minnesota Twins' sausage to start a world-wide crisis.\"\nSo far, it's hard to tell whether the sausage will supersede the vest in its good luck capabilities. Jeffers said the team hasn't learned enough about the sausage yet, and they need to get more in touch with it to see what it's going to provide them.\n\"It's the idea of the sausage. It's the meaning behind the sausage,\" he said. \"We're going to learn more about the sausage as the games go by.\"\nWhen asked if he thinks the sausage lore would distract his players from improving upon where they were a week ago, Baldelli didn't seem concerned. He emphasized how the sausage has fueled a \"winning mindset,\" which is benefiting the Twins now.\n\"The season's too grueling and baseball's too hard of a sport to not have fun once in a while, right?\" Jeffers said.\nReporting by The Associated Press.\n[Want great stories delivered right to your inbox? Create or log in to your FOX Sports account, follow leagues, teams and players to receive a personalized newsletter daily.]\n", "description": "The Minnesota Twins are no stranger to unique home-run celebrations, and now they have a summer sausage fueling their seven-game winning streak.", "hero_img": "https://statics.foxsports.com/www.foxsports.com/content/uploads/2024/04/twins-celebration.jpg", "thumbnail": "https://a57.foxsports.com/statics.foxsports.com/www.foxsports.com/content/uploads/2024/04/128/72/twins-celebration.jpg", "category": "MLB", "date": "Mon, 29 Apr 2024 19:41:23 -0400", "comments": []}, {"title": "Angels star Mike Trout to undergo knee surgery", "url": "https://www.foxsports.com/stories/mlb/angels-star-mike-trout-to-undergo-knee-surgery", "content": "Los Angeles Angels superstar Mike Trout will have surgery to repair a torn meniscus in his left knee, sidelining the three-time AL MVP indefinitely, team general manager Perry Minasian announced. The Angels believe Trout will be able to return this season, Minasian said.\nIt is unknown when the 32-year-old former MVP suffered the knee injury. Trout played the entirety of the Angels' 6-5 win over the Philadelphia Phillies in center field Monday and did not appear to be hurt. \nTrout has a .220 batting average and .867 OPS in 29 games this season, but is tied for the MLB lead with 10 home runs. He is an 11-time All-Star and has won American League MVP three times, and has been considered one of the best overall players in baseball throughout the vast majority of his 13-year MLB career, all of which has been spent with the Angels.\nTuesday's news means that 2024 will be the fourth straight season where Trout has missed significant time due to injury.\nTrout told reporters he had an MRI after playing in the Angels' 6-5 victory over Philadelphia on Monday. The outfielder fought back tears while describing the pain that gradually crept up on him after the game.\n\"It's crazy, because I look back and I don't even know when I did it,\" Trout said.\nTrout's latest injury is another major blow to the Angels, who are off to an 11-18 start in their first season since Shohei Ohtani's free-agent departure. Los Angeles also has lost $245 million third baseman Anthony Rendon indefinitely to a torn hamstring. Rendon's tenure with the Angels, which began in 2020, has been marred by injuries and poor performance.\nThe 32-year-old Trout won his three MVP awards during a dominant decade of play in the 2010s, but the formerly durable outfielder has been bedeviled by injuries since 2021.\nHe missed all but 36 games of the 2021 season with a strained calf, and he missed several weeks of the 2022 season with a back injury. Trout then broke a bone in his hand last season, missing all but one game after July 3.\n[Want great stories delivered right to your inbox? Create or log in to your FOX Sports account, follow leagues, teams and players to receive a personalized newsletter daily.]\nThe Associated Press contributed to this report.\n", "description": "Los Angeles Angels superstar Mike Trout will undergo knee surgery but is expected to return this season.", "hero_img": "https://statics.foxsports.com/www.foxsports.com/content/uploads/2024/04/MikeTrout2.jpg", "thumbnail": "https://a57.foxsports.com/statics.foxsports.com/www.foxsports.com/content/uploads/2024/04/128/72/MikeTrout2.jpg", "category": "MLB", "date": "Tue, 30 Apr 2024 18:48:42 -0400", "comments": []}, {"title": "Astros to option 2020 AL MVP José Abreu to spring training facility in Florida", "url": "https://www.foxsports.com/stories/mlb/astros-to-option-2020-al-mvp-jose-abreu-to-spring-training-facility-in-florida", "content": "The Houston Astros will option slumping first baseman José Abreu to their spring training facility to try and get the 2020 AL MVP back on track.\nGeneral manager Dana Brown made the announcement Tuesday, saying that they'd make the move Wednesday. The 37-year-old will report to the Astros complex in West Palm Beach, Florida.\nBrown said the decision was made after a meeting that included himself, Abreu, coaches and front-office personnel.\nAbreu, in the second season of a $58.5 million, three-year contract, is hitting .099 with just one extra-base hit and three RBIs. In 77 plate appearances across 22 games this season, Abreu has just seven hits.\nBrown said Abreu was very receptive during their conversation and had a good attitude about the move.\n\"Jose Abreu is an outstanding human being,\" Brown said. \"He is unselfish, and he's a teammate's guy, and he wants to get himself back to what he was doing last fall. And so, in the midst of this conversation, you could see that this guy is passionate and determined to get back to helping his team.\n\"And so he unselfishly was on board with an agreement with going back to West Palm Beach and getting some extra bats, getting some detailed instruction on what we could do to get him back,\" Brown continued.\nThe Astros selected the contract of Joey Loperfido from Triple-A Sugar Land on Tuesday, and he will likely play some first base, but Brown indicated that he'd mostly be used in the outfield. The 24-year-old was set to make his major-league debut Tuesday night against the Guardians in left field, leaving Jon Singleton to fill in for Abreu at first base. Singleton entered Tuesday hitting .238 with 10 hits and no RBIs.\nAbreu was the 2014 AL Rookie of the Year and is a three-time All-Star and a three-time Silver Slugger award winner. He is in his 11th big-league season.\n\"He got to the point where he was frustrated,\" Brown said. \"It's rare to do it. But I think it tells us about his dedication and commitment and I don't think he sees this as a long term and I don't think we see it as a long-term thing. I think it's more like… let's go down, let's make some adjustments. Let's get the rhythm and timing back. And I think in his eyes, he's looking at it as I'll be back in a couple of weeks or whatever it takes to get better.\"\nAbreu hit .237 with 18 home runs and 90 RBIs last season in his first year in Houston after nine seasons with the White Sox. He had four homers and 13 RBIs in 11 postseason games.\n\"The bat speed is still pretty good,\" Brown said. \"So, we've got to get his timing right, and we've got to get his rhythm right, so that he can consistently do it. And so I still feel very optimistic about it.\"\nReporting by The Associated Press.\n[Want great stories delivered right to your inbox? Create or log in to your FOX Sports account, follow leagues, teams and players to receive a personalized newsletter daily.]\n", "description": "The Astros will option first baseman José Abreu to their spring training facility to try and get the 2020 AL MVP back on track.", "hero_img": "https://statics.foxsports.com/www.foxsports.com/content/uploads/2024/04/abreu.jpg", "thumbnail": "https://a57.foxsports.com/statics.foxsports.com/www.foxsports.com/content/uploads/2024/04/128/72/abreu.jpg", "category": "MLB", "date": "Tue, 30 Apr 2024 17:41:20 -0400", "comments": []}, {"title": "Dodgers play entire game without striking out for first time since 2006", "url": "https://www.foxsports.com/stories/mlb/dodgers-play-entire-game-without-striking-out-for-first-time-since-2006", "content": "The Los Angeles Dodgers' powerful offense that includes Mookie Betts, Shohei Ohtani and Freddie Freeman isn't used to putting zeros on the scoreboard.\nThey're just fine with one that occurred Monday night.\nThe Dodgers played an entire game without striking out once in their 8-4 win over the Arizona Diamondbacks, which is the first time the franchise played a full game without a punchout since 2006.\n\"A lot of competitive at-bats,\" Dodgers manager Dave Roberts said. \"Eighteen years — we've seen a lot of baseball games since that's happened. I just think you've got to give the players all the credit for winning pitches and fighting to move the ball forward.\"\nLos Angeles has won seven of its past eight games.\nThe Dodgers had 44 plate appearances without a strikeout. The D-backs threw Tommy Henry, Andrew Saalfrank, Scott McGough, Logan Allen and Justin Martinez, who walked eight.\nHenry took the loss, giving up two runs over four innings.\n\"Their game plan was to be really aggressive,\" Henry said. \"Felt like there was a lot of early contact. Anything in the zone early, they were hacking at and they're good hitters. They were putting barrels on them.\"\nReporting by The Associated Press.\n", "description": "The Dodgers' powerful offense isn't used to putting up zeros, but the team put up a good kind of zero in its win over Arizona on Monday.", "hero_img": "https://statics.foxsports.com/www.foxsports.com/content/uploads/2024/04/ab00b46e-Shohei-Ohtani.jpg", "thumbnail": "https://a57.foxsports.com/statics.foxsports.com/www.foxsports.com/content/uploads/2024/04/128/72/ab00b46e-Shohei-Ohtani.jpg", "category": "MLB", "date": "Tue, 30 Apr 2024 09:27:30 -0400", "comments": []}, {"title": "Three reasons why Brewers' William Contreras is the best catcher in baseball", "url": "https://www.foxsports.com/stories/mlb/three-reasons-why-brewers-william-contreras-is-the-best-catcher-in-baseball", "content": "First, there was shock. Then, there was delight. \nThe shock emanated from Atlanta, after Braves general manager Alex Anthopolous traded away his young All-Star catcher for a top-five backstop. The delight came from Milwaukee, as Brewers fans realized their front office had just pulled off a heist.\nIn December 2022, William Contreras was part of a three-team trade that sent him from the reigning world champion Atlanta Braves, the only organization he had ever known, to the Brewers, where he has since become a beloved and essential piece of their roster. The Braves couldn't pass up the opportunity to grab Sean Murphy from the Athletics, and the Brewers only gave up outfielder Esteury Ruiz in the swap.\nNo one would've faulted Contreras if he needed a few months, perhaps even a full season, with an unfamiliar team to adjust to his new role as the full-time catcher for Milwaukee. But Contreras embraced his opportunity, revamped his defense and immediately slugged from the top of the order as the trade, already favorable on paper for the Brewers, quickly became a jackpot.\nWith all due respect to Adley Rutschman, Will Smith, Salvador Pérez, Yainer Díaz and Willson Contreras, William Contreras has ascended to become the best catcher in baseball. Here are three reasons why.\n1. He's a pure, top-tier hitter\nA catcher who can really hit? Say no more. Contreras has the best fWAR among all major-league catchers since the start of the 2023 season. And since 2022, the first season Contreras played at least 60 games in the majors, he ranks first in average (.292), on-base percentage (.370), slugging (.485) and OPS (.855) among 23 qualifying big-league catchers. Everything's coming up Contreras, even his advanced metrics. Since 2022, he has the best average exit velocity (91.3 mph) and top hard hit rate (49%), too.\nNow is around the time you might be thinking, uh, what about that perennial MVP candidate who plays catcher for the Orioles? Contreras has simply been more consistent and more effective at the plate than Rutschman — and all full-time catchers, actually. Only Pérez, who's spending 40% of his time at first base or DH, has a higher OPS than Contreras (.958). No catcher comes within 10 of Contreras' 28 runs scored or has walked as much (15). His .345 average ranks fourth in the National League and his 64 total bases sixth. \nThese days, Contreras often flashes the ultimate flex: batting leadoff as a catcher. And he isn't just elite at the dish because he's a backstop. Contreras is in the 99th percentile in batting run value, the 98th percentile in hard-hit percentage, and the 96th percentile in average exit velocity — among all position players. Plus, he's a master at timely hitting. Contreras has the most game-winning RBIs (24) among all catchers since 2022, and the most hits with two outs and runners in scoring position in that span.\nWhen the pressure is at a boiling point, when a hit is needed the most, Contreras is a player every team would want at the plate. That's the mark of an elite hitter, much less a premier catcher.\n2. His defense is improving\nContreras isn't just a glorified designated hitter moonlighting as a catcher. The 26-year-old's defense has vastly improved under the Brewers' catching lab, and while he thoroughly impressed us behind the plate in 2023, now he has the challenge of maintaining that consistency across multiple seasons.\nContreras' transformation with his framing, blocking and throwing was eye-popping last year. In just a matter of months, the backstop evolved from a below-average defender in Atlanta to posting top-tier catching metrics in Milwaukee. He improved his strike rate from 45.1% in 2022 to 49.2% in 2023. He became an excellent framer, going from a below-average -3 framing runs in 2022 to an above-average seven framing runs in 2023. With the Brewers, he started effectively blocking all those breaking balls and led all catchers in blocking runs saved last year. His caught stealing percentage also jumped from 7% in 2022 to 17% in 2023 despite the new rules. \nTo improve all of these defensive catching metrics — all at once, in just one year — is nothing short of spectacular.\nMilwaukee, of course, has a strong track record of improving catcher defense, from Omar Narváez to Yasmani Grandal to Victor Caratini to, now, Contreras. But the magic of the Brewers' coaching staff isn't the only element to Contreras' success. There must be a full buy-in from the catcher's side, and Contreras has demonstrated the hard work, application, and repetition necessary to flaunt such a major turnaround behind the plate.\nWhat's most interesting is that the Braves gave up Contreras in large part because of his subpar defense. Atlanta traded for Murphy, another slugging catcher with a Gold Glove to his name, because he was a significant upgrade on defense without losing much pop on offense. With the Braves, Contreras was in the 20th percentile in framing and the 50th percentile in pop time. Murphy, meanwhile, had been in the 86th percentile in framing and the 96th percentile in pop time with the A's.\nBut, perhaps, the Braves didn't account for Contreras' younger age and greater durability compared to Murphy. Contreras, three-plus years younger than Murphy, has played in 170 games compared to Murphy's 109 since the start of the 2023 season. Murphy is currently sitting idle on the injured list, while Contreras is in the early-season conversation for the National League MVP award. \n3. He has the requisite drive\nA player's will to achieve is not something that can be taught. Contreras' new teammates in Milwaukee have repeatedly noted just how much his work ethic stands out. He's a student of the game, and he's acing all of his tests. His determination to be the best, all while modeling his game after some of this sport's best catchers, like Pérez and Yadier Molina, lends to his rise as the top catcher in MLB. \nAnd it's not like Contreras is ascending during a dormant period for slugging catchers. In fact, it's the opposite. Right now, catchers are all the rave again thanks to a cluster of young stars with lots of pop. Whether it's Rutschman, Díaz, Francisco Álvarez or Gabriel Moreno, there are plenty of newcomers who could challenge proven veterans like J.T. Realmuto, Perez, Smith, Murphy and William's older brother Willson for the title of best catcher. Young blood is mixing with vets at the top of their game, making for legitimate reasons to be excited about MLB catchers in the present and the future. \nIt's just that, well, no one is pulling ahead in the race quite like the Brewers' special backstop. \nThe backdrop of this loaded competition only makes Contreras' two-way exploits that much more impressive. Another full season of stellar production should convince those who might not be paying close attention to the mid-market Brewers. But for the better part of a year now, Contreras has been wearing a crown fit for the game's contemporary catcher king.\nDeesha Thosar is an MLB writer for FOX Sports. She previously covered the Mets as a beat reporter for the New York Daily News. The daughter of Indian immigrants, Deesha grew up on Long Island and now lives in Queens. Follow her on Twitter at @DeeshaThosar.\n", "description": "William Contreras doesn't draw the headlines, but for the better part of a year, he's quietly been MLB's best catcher. Here's why.", "hero_img": "https://statics.foxsports.com/www.foxsports.com/content/uploads/2024/05/2024-04-30_MLB-Three-Reasons_16x9.jpg", "thumbnail": "https://a57.foxsports.com/statics.foxsports.com/www.foxsports.com/content/uploads/2024/05/128/72/2024-04-30_MLB-Three-Reasons_16x9.jpg", "category": "MLB", "date": "Wed, 01 May 2024 19:02:47 -0400", "comments": []}, {"title": "Abner Uribe, Freddy Peralta among four suspended in Brewers-Rays brawl", "url": "https://www.foxsports.com/stories/mlb/brewers-uribe-suspended-6-games-for-brawl-peralta-5-and-murphy-2-while-rays-siri-penalized-3", "content": "Milwaukee reliever Abner Uribe was suspended for six games and starter Freddy Peralta for five on Wednesday for their roles in a brawl during a Brewers' game against the Tampa Bay Rays.\nRays outfielder Jose Siri was suspended for three games and Milwaukee manager Pat Murphy for two by Mike Hill, Major League Baseball's senior vice president for on-field operations. All four were also fined.\nMurphy started his suspension on Wednesday, when associate manager Rickie Weeks led the team against the Rays.\nMilwaukee said Uribe and Peralta planned to appeal. If a player appeals to MLB special assistant John McHale Jr., discipline remains pending until the appeal is resolved.\nMLB cited Peralta for intentionally throwing at Siri and Murphy for Peralta's actions plus \"inappropriate conduct towards umpires.\" Uribe was disciplined for causing a benches-clearing incident and Siri for his actions during the incident.\nBefore Wednesday's game, Siri revealed a bruise on his left leg that he received after getting hit by a 3-0 fastball from Peralta in the sixth inning of the Brewers' 8-2 victory Tuesday. That incident led to the ejection of Peralta and Murphy.\nThe animosity between Siri and the Brewers had been building since he took a long look at his solo home run off Peralta in the third inning.\nAfter Siri grounded out leading off the eighth against Uribe, the two exchanged words near first base and Uribe threw a punch at Siri, who then took a wild swing at the pitcher. Milwaukee first baseman Rhys Hoskins tried to break up the fight and was knocked to the ground as dugouts and bullpens emptied.\nSiri wasn't in the Rays' starting lineup Wednesday but said he planned on getting treatment and would be available later in the game.\n\"He was the one who threw first. I don't think I did anything bad,\" Siri said through an interpreter. \"Of course, I would expect (Uribe) to get a suspension. Me, I might even get a game or two.\"\nSiri said he remained unsure why Uribe took a swing at him.\n\"When I was in the on-deck circle and he was warming up, I felt like he kept looking over at me and staring at me, so I just had that feeling,\" Siri said. \"Obviously, when I went to first base, I confirmed that he had a problem with me.\"\nUribe assessed the situation after Tuesday's game.\n\"I think there were some words shared that didn't have much to do with the game, that probably shouldn't have been shared there in that exchange\" he said through an interpreter.\nSiri stressed on Wednesday he has no dispute with Peralta.\n\"I never really had a problem with Peralta. Never have,\" he said. \"He hit me, and I just went to first base.\"\nSiri said celebrations by pitchers and batters alike are part of the game but insisted that he wasn't trying to show up Peralta.\n\"I don't think I did anything wrong. I stood there. I didn't look at it. I put my head down and just ran,\" he said.\nMurphy had been ejected from each of the Brewers' previous two games. He was tossed from a 1-0 loss to Tampa Bay on Monday after arguing with a decision that kept the Brewers from scoring a tying run in the ninth inning.\nReporting by The Associated Press.\n", "description": "Milwaukee reliever Abner Uribe was suspended for six games and starter Freddy Peralta for five for their roles in a brawl during the Brewers’ game against the Tampa Bay Rays", "hero_img": "https://statics.foxsports.com/www.foxsports.com/content/uploads/2024/05/Tampa-Bay.jpg", "thumbnail": "https://a57.foxsports.com/statics.foxsports.com/www.foxsports.com/content/uploads/2024/05/128/72/Tampa-Bay.jpg", "category": "MLB", "date": "Wed, 01 May 2024 16:58:08 -0400", "comments": []}, {"title": "MLB Rookie Power Rankings: Who takes top spot one month in?", "url": "https://www.foxsports.com/stories/mlb/mlb-rookie-power-rankings-who-takes-top-spot-one-month-in", "content": "How are your preseason Rookie of the Year picks looking? \nAfter a full month of play, we can begin to assess which young players are making the most significant impact. \nBelow are FOX Sports' first rookie power rankings of the season, which we'll continue to update after each month. \nHonorable mention: Andy Pages (OF, Los Angeles Dodgers)\nPages' power has changed the look of the bottom of a Dodgers lineup that desperately needed the boost. He has earned a regular role in the outfield since his debut on April 16 by amassing a top-five slugging percentage and OPS among all rookies with at least 50 at-bats. His smaller sample size compared to other rookies on this list is really the only reason he sits outside the top 10, so it wouldn't be surprising to see him move up the charts quickly if he continues to make this kind of impact. \n10. Jacob Young (OF, Washington Nationals)\nYoung flies under the radar on a Nationals team teeming with top outfield prospects, but his 12 steals in 22 games this year (and 25 steals without being caught stealing since his debut last year) should start to put him on the map. Young is hitting .377 over his last 15 starts and went 8-for-16 with six steals during the Nats' four-game sweep of the Marlins this past weekend. The impact of his speed has been profound — after that sweep, Young ranked in the top three among all rookie position players in both Baseball-Reference's and FanGraphs' version of WAR — and it'll be interesting to see what the Nats do once Victor Robles is back. \n9. Jackson Merrill (OF, San Diego Padres) \nMerrill entered this year as one of the top shortstop prospects in baseball, but the Padres needed outfield help, so the 20-year-old debuted in center field — a position he had never played professionally after getting selected in the first round in 2021 — and joined Ken Griffey Jr. and Andruw Jones as the only players in the past 50 years to start on Opening Day in center field before turning 21. Despite playing above Double-A for the first time in his career, Merrill hasn't looked out of place on defense or at the plate, where he's consistently hitting the ball hard, rarely whiffing and is tied for the lead in hits among all rookies. While he hasn't looked quite the same since dealing with groin tightness last week, he demonstrated with a .333 batting average over his first 20 career games that he belongs. \n8. Evan Carter (OF, Texas Rangers)   \nCarter's extraordinary debut last year didnt seem sustainable — he had a 1.058 OPS and MLB's lowest chase rate in 23 regular-season games, then reached base in a record 17 straight games to begin his postseason career — and the start to his follow-up campaign has been more solid than spectacular. Carter is still mashing righties this year (.869 OPS, five homers), but he's not getting on base or walking as often, and his small-sample struggles against lefties (1-for-24 with 12 strikeouts and two walks since debuting last year) have continued, which have led to him platooning. Still, there should be better days ahead for rookies Carter and Wyatt Langford in Texas. \n7. Masyn Winn (SS, St. Louis Cardinals) \nWhile Winn and his 80-grade arm make it easy to project him becoming an above-average defensive shortstop, it's his offense that has been the most pleasant surprise to begin the 2024 season. The power Wynn flashed last year at Triple-A hasn't yet carried over, but his .304 batting average and .785 OPS are a massive step forward from the .172 average and .467 OPS he had in 37 games last year. Once on base, he becomes an instant threat with his speed. Winn entered Tuesday tied for the lead in bWAR among all rookies. \n6. Michael Busch (1B, Chicago Cubs) \nBusch leads all Cubs players with six homers — he recorded a home run in five straight games from April 10-15 — and is tied for the lead among all rookies in the category. After jumping out to a 1.002 OPS through his first 20 games of the year, however, an elevated strikeout rate has brought him back down to earth over the past 10 days. But his ability to slug brought a crucial element to a Cubs club that desperately needed more corner infield pop, and his exceptional start alone is worthy of placement on this top 10. \n5. Wilyer Abreu (OF, Boston Red Sox) \nWhen former Red Sox chief baseball officer Chaim Bloom traded catcher Christian Vazquez to the Astros at the deadline in 2022 for Abreu and infielder Enmanuel Valdez, it was the latter who was the more highly regarded of the two prospects. But both of them are now up with the big-league club, and Abreu is demonstrating it's not always the elite prospects who make the greatest impacts. Abreu ranks in the top three among all rookie position players in both bWAR and fWAR. He was sensational in 28 games with the Red Sox last year (132 OPS+), and has looked just as terrific early this year (135 OPS+), hitting for both contact and power, playing strong defense in the corner outfield, stealing bases and establishing his place in the heart of the Boston order. \n4. Yoshinobu Yamamoto (SP, Los Angeles Dodgers) \nThings could only trend up for Yamamoto after his abysmal debut — and they have. Since allowing five runs in one inning against the Padres in Korea, Yamamoto has a 2.00 ERA, 35 strikeouts and five walks over his past five starts. The lack of command with his four-seamer and the amount of hard contact he has allowed have been surprising, but his ability to miss bats with his secondaries is evident. His splitter in particular has been almost untouchable, and he appears to be turning a corner. \n3. Colton Cowser (OF, Baltimore Orioles) \nThe Orioles possess such an embarrassment of riches among their upper levels that it felt inevitable at least one of their rookies would make a significant leap forward. Cowser is taking that jump behind a more aggressive approach in the zone. Baltimore can stomach his 33.7% strikeout rate when he's running a 52.2% hard-hit rate and leading all qualified rookies in slugging, OPS and RBIs (and is also tied for the lead in homers and doubles). Cowser ranks eighth overall in OPS among all players with at least 70 plate appearances this year, though his hot start has cooled off some. \n2. Jared Jones (SP, Pittsburgh Pirates) \nIt's not a surprise that a Pirates pitcher is among the best rookies in baseball this year. It is a surprise that it's not Paul Skenes (at least not yet, as we eagerly await his arrival). Jones has drawn comparisons to Spencer Strider for a fastball/slider combo that has flummoxed opponents. He fills the zone with his high velocity, which can make him prone to homers and hard contact, but man, that Statcast page is RED. Jones has 42 strikeouts and only five walks over his first six starts, good for the best strikeout-to-walk ratio of any rookie starter, and has logged the highest whiff rate among all qualified starters this year. \n1. Shota Imanaga (SP, Chicago Cubs) \nThe numbers speak for themselves. Forget just rookies: Among all MLB starters who've thrown at least 20 innings this year, Imanaga ranks first in ERA (0.98) and third in strikeout-to-walk ratio (9.33) and WHIP (0.80). Though he has allowed a homer in each of his past two starts — which was an issue at times for him in Japan — he has thus far done an excellent job limiting damage. He didn't allow a run in his first three starts, and he is the first starter since Dave Ferriss in 1945 to go 4-0 or better with a sub-1.00 ERA over his first five career games. \nAlso considered: Keaton Winn (SP, San Francisco Giants), Blaze Alexander (SS, Arizona Diamondbacks), Mitchell Parker (SP, Washington Nationals), Ben Brown (SP, Chicago Cubs), Justin Slaten (RP, Boston Red Sox), Jung Hoo Lee (OF, San Francisco Giants), Max Meyer (SP, Miami Marlins), Bryan Hudson (RP, Milwaukee Brewers), Joey Ortiz (INF, Milwaukee Brewers), Jackson Chourio (OF, Milwaukee Brewers), José Buttó (SP, New York Mets), Davis Schneider (INF/OF, Toronto Blue Jays) \nRowan Kavner is an MLB writer for FOX Sports. He previously covered the L.A. Dodgers, LA Clippers and Dallas Cowboys. An LSU grad, Rowan was born in California, grew up in Texas, then moved back to the West Coast in 2014. Follow him on Twitter at @RowanKavner.\n", "description": "From former NPB stars, to a Pirates flamethrower, to yet another young Orioles standout, Rowan Kavner debuts his first rookie power rankings of the year.", "hero_img": "https://statics.foxsports.com/www.foxsports.com/content/uploads/2024/05/2024-04-30_MLB-Rookie-Power-Rankings_16x9-1.jpg", "thumbnail": "https://a57.foxsports.com/statics.foxsports.com/www.foxsports.com/content/uploads/2024/05/128/72/2024-04-30_MLB-Rookie-Power-Rankings_16x9-1.jpg", "category": "MLB", "date": "Wed, 01 May 2024 14:19:45 -0400", "comments": []}, {"title": "Mike Trout's sublime talent overshadowed by 4 years of injuries", "url": "https://www.foxsports.com/stories/mlb/mike-trouts-sublime-talent-overshadowed-by-4-years-of-injuries", "content": "Mike Trout never had a significant injury in his charmed baseball career until May 2017, when he tore a thumb ligament sliding headfirst into second base.\nOn his first day back from a 39-game absence, the superstar slugger stole second — and he slid headfirst again.\n[Angels star Mike Trout to undergo knee surgery]\n\"I'm not changing the way I play,\" a grinning Trout said that night in the Los Angeles Angels' clubhouse, a singular young athlete confident in his exceptionalism.\nLess than seven years later in the hallway outside that same Anaheim clubhouse, Trout repeatedly fought back tears Tuesday while he publicly processed his fourth major injury in the past four seasons.\n\"It's just frustrating,\" he said quietly, his eyes downcast. \"But we'll get through it. ... I play the game hard, and (stuff) happens.\"\nTrout still might be the greatest baseball player produced by his generation, but he'll never again be that 25-year-old who seemed pretty sure he was invincible. Like Ken Griffey Jr. before him, Trout's mid-career injury problems have waylaid a meteoric career and stalled his historic rate of production at the plate.\nThe 32-year-old Trout's talent and passion still shine when he's on the field, but they haven't kept him healthy in his second decade in baseball.\nSince the start of the 2021 season, Trout has played in 266 games. The Angels' meeting with Philadelphia on Wednesday will be the 251st game he has missed in that stretch.\nTrout had 285 career homers when he won his third AL MVP award in 2019. The Angels' center fielder has hit just 93 homers in the four-plus seasons since then, with COVID-19 shortening his 2020 campaign and injuries doing the rest.\nTrout had 1,324 hits after the 2019 season, but he has compiled just 324 since, greatly slowing his march toward 2,000 or 3,000. His batting average (.277) and OPS (.958) since 2019 are also significantly below his career marks.\nWhile Trout's bat speed remains among the fastest in the majors, he has acknowledged several struggles with his mechanics for the past two seasons, including a declining contact rate and troubles with high-velocity pitching. Trout still led the majors with 10 homers when he got hurt this week, but his batting average was down to .220 — even dipping his career average below .300 shortly before his injury.\nTrout now has a torn meniscus in his left knee. Compounding his frustration, he doesn't know how it happened — perhaps while running in the outfield, perhaps while simply walking to the dugout.\n\"Nobody wants to play more than Mike does,\" Angels general manager Perry Minasian said. \"He loves this. He loves everything about this. He wakes up thinking about it. He goes to bed thinking about it. He eats, sleeps and breathes baseball. I really feel for him.\"\nTrout was baseball's breakout star of the 2010s, a strapping slugger from small-town southern New Jersey who dazzled the sport when he landed in Orange County. He's an electrifying hitter, an exciting fielder, and a fiery competitor often described as the spiritual heir to Mickey Mantle.\nTrout seemed capable of anything, even if he only got the Angels to the playoffs once in 2014. But as the Halos' losing seasons piled up, he gradually became familiar with pain, sleepless nights and interminable medical procedures.\nTrout missed all but 36 games of the 2021 season with a strained calf that healed confoundingly slowly. He missed five weeks of the 2022 season with a back injury, although he still hit 40 homers.\nTrout then broke a bone in his hand on a foul ball last July 3. He tried to return in August when it briefly looked like the Angels might make a postseason run, but he played only one painful game before shutting it down for the year.\nTrout had been in \"a good frame of mind\" this season, new Angels manager Ron Washington said. \"He was loving coming to the ballpark, and he was loving going out there, trying to get in the swing of things of the season, and then this happened.\"\nThe Angels have provided no timeline for Trout's recovery from surgery, but most athletes with the injury miss at least a couple of months, often more.\nWith or without Trout, the Angels are reeling.\nThe club lost Shohei Ohtani to a $700 million free-agent deal with the nearby Dodgers, and the front office signed no significant help for Trout. At 11-19 heading into May after losing 10 of 12, a 10th consecutive non-playoff season and a ninth straight losing season — both the longest active streaks in the majors — seem increasingly likely for the Halos.\nTrout's injury problems have been crushing for his franchise — but so have the extensive injury woes of Anthony Rendon, the $245 million third baseman signed by owner Arte Moreno to provide Trout with a dynamic counterpart. Rendon is currently out with yet another injury, a hamstring tear that probably won't heal quickly.\nWhen Rendon arrived for the short 2020 season, Trout and Rendon played together 46 times in 60 games. Since then, the Angels' two highest-paid players have appeared together in only 118 of the Angels' 516 games (22.8%) from the start of the 2021 season.\nTrout is older and more fragile than that golden youth of the previous decade, but he's also wiser: When he slides these days, he tries to go feet-first — and he wears a bulky sliding mitt.\nHis $426.5 million contract runs through 2030, and he has repeatedly said he isn't interested in leaving Anaheim. Trout still wants to turn the Angels into a winner, believing it will be even sweeter because it took so long.\nBut first, another surgery and another recovery await.\n\"It's a pretty simple procedure,\" Trout said. \"I'll have it right away and get back as fast as I can. (But) this is tough.\"\nWith the injury, Trout is no longer on the AL MVP oddsboard at FanDuel Sportsbook. In mid-April, he was at +950, fourth on the board. \nAs of last week, the Angels' World Series odds were at +13000. They now sit at +16000.\n[Want great stories delivered right to your inbox? Create or log in to your FOX Sports account, follow leagues, teams and players to receive a personalized newsletter daily.]\nReporting by The Associated Press.\n", "description": "Mike Trout still might be the greatest baseball player produced by his generation, but the torn meniscus in his left knee is his fourth major injury in the past four seasons.", "hero_img": "https://statics.foxsports.com/www.foxsports.com/content/uploads/2024/05/trout-wide-050124.jpg", "thumbnail": "https://a57.foxsports.com/statics.foxsports.com/www.foxsports.com/content/uploads/2024/05/128/72/trout-wide-050124.jpg", "category": "MLB", "date": "Wed, 01 May 2024 11:29:53 -0400", "comments": []}, {"title": "Bee swarm delays Dodgers-Diamondbacks game for two hours", "url": "https://www.foxsports.com/stories/mlb/bee-swarm-delays-dodgers-diamondbacks-game-for-two-hours", "content": "The Arizona Diamondbacks were able to get one of their best wins of the season on Tuesday, but not before something bizarre caused a lengthy delay.\nA bee swarm on the netting behind home plate at Chase Field caused Tuesday's Los Angeles Dodgers-Diamondbacks game to be delayed for roughly two hours.\nPlayers and fans waited for a beekeeper to remove the colony. Players tried to keep busy in the indoor batting cage and clubhouse to kill time while they waited for the bees to be removed.\nDiamondbacks vice president of operations Mike Rock knew they had a problem on their hands prior to Tuesday's game. \n\"She doesn't usually call me about that time. I knew something was odd,\" Rock told reporters. \"She said we have bees landing on the net right behind home plate. I said, 'How many?' And she said, 'Hundreds — no way, thousands.' And I knew we had a problem.\"\nAs the Diamondbacks wondered what they could do to play Tuesday's game, Rock made a call to the Blue Sky Pest Control's Phoenix office. Matt Hilton eventually saved the day. Hilton, a branch manager for Blue Sky Pest Control's Phoenix office, received a call while watching his 6-year-old son's tee ball game on Tuesday. The tee ball game was at Surprise Stadium, where the Texas Rangers and Kansas City Royals play their spring training games and located 23 miles away from Chase Field.\n\"Well, we know that this was really important to get these games going, and so when we hear that there's bee issues out at [the] Diamondbacks’ stadium, we [snaps fingers] tried to get at it right away,\" Hilton told reporters. \"We were happy to deploy really quickly and come get this game going.\"\nHilton had a 30-minute commute to Chase Field, receiving a hero's welcome when he made his way to the ballpark. But as a cart drove him to the scene, Hilton explained that they would need some extra time in order to safely remove the bees before starting the game. \nAs Hilton sprayed the bees with non-pesticide and placed them in a vacuum, he played along with the crowd, pumping them up as he did his job.\n\"I wasn't [expecting that],\" Hilton said. \"I thought I was just going to do my thing and cruise out. But it was fun because of the thousands of people cheering for you. It was a little nerve-racking, I'm not going to lie — a lot of pressure to get this game going.\"\nEventually, the bees were removed. Bonnie Tyler's hit song \"Holding Out for a Hero\" played throughout Chase Field as fans showered Hilton with \"M-V-P!\" chants. \nHilton had one more thing to do before leaving: throw out the first pitch. He kept his beekeeper suit on for the occasion.\n\"Minor leagues to the big leagues now,\" Hilton said. \"It's pretty cool.\"\nHilton's son also seems to understand that his dad was a hero to some people after leaving his tee ball game early. \n\"I think he was probably a little bummed that I left a little early,\" Hilton said. \"But I think he's OK with it now.\"\nThe bees weren't killed, either. After being placed in the vacuum, they were taken off-site, according to the Los Angeles Times.As for the game itself, Christian Walker homered twice, including a two-run drive in the 10th inning that gave the Arizona Diamondbacks a 4-3 win. But all anyone could think about was the bee delay.\n\"It was weird, but props to the guys for shutting it down and then getting it back on and being ready to play,\" Walker said.\nDodgers manager Dave Roberts applauded Hilton for his handling of the situation.\n\"I've never seen something like that, but I'm happy we got the game in,\" Roberts said. \"It was a crazy situation, but I thought that the Diamondbacks and that [bee keeper] did a nice job of taking care of the situation in a timely manner.\"\nDiamondbacks manager Torey Lovullo also had a fun time with the situation on Tuesday, but he also wanted Walker to end the game as soon as possible when he came up to the plate in the 10th inning.\nIt's one of those fun baseball moments,\" Lovullo said. \"I told him to hit one to the [expletive] moon. I said you're locked in, nobody's a better hitter on this field at this point in time.\"\nThe Associated Press contributed to this report. \n", "description": "The Diamondbacks earned a big win against the Dodgers on Tuesday, but not before a bee swarm paused the start of the game.", "hero_img": "https://statics.foxsports.com/www.foxsports.com/content/uploads/2024/05/Bee-swarm.jpg", "thumbnail": "https://a57.foxsports.com/statics.foxsports.com/www.foxsports.com/content/uploads/2024/05/128/72/Bee-swarm.jpg", "category": "MLB", "date": "Wed, 01 May 2024 09:57:18 -0400", "comments": []}]