[{"title": "2024 MLB City Connect uniforms: Rays unveil alternate look", "url": "https://www.foxsports.com/stories/mlb/2024-mlb-city-connect-uniforms", "content": "The Tampa Bay Rays are adding a City Connect uniform to their closet.\nTampa Bay unveiled its City Connect uniforms on Monday, becoming the 23rd MLB team to embrace the alternate look since the Nike-backed brand launched in 2021.\nThe Rays' City Connect uniforms have \"Tampa Bay\" written across the chest in neon coloring, a similar look they had on their road jerseys in their first three seasons as a franchise (1998-2000), to go with the dark base. It marks the first time the Rays will have their city name written across their chest since 2007.\nTampa Bay's skater culture inspired some of the look. The flames coming off each letter on the nameplate on the front of the jersey include flames, which are meant to honor street art and skate media, such as \"Thrasher\" magazine. Gradient accents cover the sleeves and pants of the uniforms, purposely making them asymmetrically as a symbol of doing things differently. \nThe Rays wanted to capture the feel of what it's like to be in Tampa Bay, displaying a look of what people see when they're in the city and calling it \"Grit and Glow.\"\n[Related: Report: MLB plans to address players' uniform complaints per union memo]\n\"When we started thinking about that feeling that you have when you're in some of these really special places around this community, it's fueled by this energy,\" Rays chief business officer Bill Walsh said in a statement. \"A lot of these types of countercultures, creative cultures, they're really at the center of that in terms of creating that vibe.\"\nThe Rays honored some local landmarks with their caps and logos. The main logo on the caps features the Sunshine Skyway Bridge in the outline of a sting ray. A second logo has three palm trees and a pelican. The palm trees logo replicates the mark seen on Florida Historical Makers, such as Perry Harvey Sr. Park, Florida's first public skatepark. The other logo is a stingray on a skateboard, further embracing the city's skater culture.\n\"It's also something we think that we have in common as an organization,\" Walsh said of Tampa Bay's skater culture in the statment. \"We have demonstrated that, that you've kind of got to be willing to go against the grain and have some courage and disrupt. So I think it's exciting that there's that overlap, too.\"\nThe Rays will debut the uniforms in their three-game home series against the New York Mets this season. They'll wear the alternate look in every Saturday home game after that.\nPhiladelphia Phillies\nThe Phillies were the first team to unveil their City Connect uniforms this season. \"PHILLY\" is written across the chest in white coloring while the uniform's colors resemble the city's flag. The cap's logo is the Liberty Bell with the same coloring as the city's flag, which has Philadelphia's skyline placed within the logo. \n[Want great stories delivered right to your inbox? Create or log in to your FOX Sports account, follow leagues, teams and players to receive a personalized newsletter daily.]\nNew York Mets\nThe Mets introduced their City Connect uniforms in April. It's a base gray uniform with \"NYC\" stitched on the front and the Queensboro Bridge on the hat. The jersey also has a black patch on the arm with the Mets logo in pink lettering.\n[Read more: New York Mets release 'City Connect' jersey with new color scheme]\nOther teams set to unveil City Connect uniforms in 2024\nCleveland GuardiansDetroit TigersLos Angeles Dodgers (will release their second look after releasing first look in 2021)Minnesota TwinsSt. Louis Cardinals Toronto Blue Jays\nCleveland Guardians\nDetroit Tigers\nLos Angeles Dodgers (will release their second look after releasing first look in 2021)\nMinnesota Twins\nSt. Louis Cardinals \nToronto Blue Jays\n \n", "description": "The Tampa Bay Rays become the 23rd team to unveil City Connect jerseys, embracing the city's skater culture as part of their look. Check out all the latest alternates here!", "hero_img": "https://statics.foxsports.com/www.foxsports.com/content/uploads/2024/04/Tampa-Bay-Rays.jpg", "thumbnail": "https://a57.foxsports.com/statics.foxsports.com/www.foxsports.com/content/uploads/2024/04/128/72/Tampa-Bay-Rays.jpg", "category": "MLB", "date": "Mon, 29 Apr 2024 14:24:33 -0400", "comments": []}, {"title": "Crew chief says Aaron Judge should have been called for interference on slide during Yankees' rally", "url": "https://www.foxsports.com/stories/mlb/crew-chief-says-aaron-judge-should-have-been-called-for-interference-on-slide-during-yankees-rally", "content": "Aaron Judge should have been called for interference for his slide on a botched double-play attempt that sparked New York's winning rally Sunday at Milwaukee, crew chief Andy Fletcher acknowledged after the Yankees' 15-5 victory.\nWith the score tied 4-all in the sixth inning, Judge raised his left arm while sliding into second base after Alex Verdugo hit a bouncer to the right side of the infield. Brewers shortstop Willy Adames was attempting to complete the double play when his throw bounced off Judge's padded hand and landed on the ground, enabling Verdugo to reach safely.\nThe Yankees went on to score seven runs in the inning, all with two outs.\n\"On the field, we got together and did the best that we could to come up with the correct answer,\" Fletcher told a pool reporter after the game. \"After looking at it off the field in replay, it appears that the call was missed. It should've been called interference because it wasn't a natural part of his slide. It didn't appear that way to us. We did everything we could to get together and get it right. But after looking at it, it appears that it should've been called interference.\"\nFletcher noted the call isn't reviewable.\nJudge said he had no worries about getting called for interference even as the crew gathered to discuss the play.\n\"No, that's never happened before in my life, and I've been sliding like that for years,\" Judge said.\nBrewers manager Pat Murphy had come out of the dugout to argue for an interference call. He continued pleading his case while speaking to reporters after the game.\n\"It's hard to say that he wasn't making an attempt at least purposely to obstruct,\" Murphy said. \"I don't think he wanted to get hit by the ball, but I think he was trying to purposely obstruct. That's my opinion. I don't know what his intent was. He seems like a wonderful man, but very competitive also.\"\nAdames noted how Judge's 6-foot-7 frame made it particularly difficult to attempt a throw to first.\n\"He's like 7 feet tall,\" Adames said. \"He's huge. I think when he puts his hands up, he's taller than me even when he's sliding to second base. It's a tough space for me to throw the ball.\"\nJudge reached on a leadoff walk before Verdugo hit his bouncer to second baseman Brice Turang, who threw to Adames to retire Judge at second. As Judge raised his left arm on his slide to second, he was wearing a sliding glove on his hand. Judge, who said the throw hit him on the side of his fingers, noted he frequently slides that way.\n\"You can look back at any picture you want of me sliding into second base,\" Judge said. \"That's always happened.\"\nIt appeared the lack of an interference call wouldn't make much of a difference in Sunday's outcome after Abner Uribe retired Giancarlo Stanton on a pop fly for the second out of the inning. But everything fell apart for the Brewers from that point on.\nVerdugo advanced on Anthony Rizzo's walk and scored the go-ahead run on Gleyber Torres' single to center. Oswaldo Cabrera walked to load the bases before Jose Trevino singled home two runs. Elvis Peguero replaced Uribe and threw a wild pitch that brought home Cabrera. After Anthony Volpe walked, Juan Soto hit an RBI single.\nVolpe and Soto executed a double steal while Judge was at the plate receiving a chorus of boos from the American Family Field crowd. Judge capped the seven-run outburst with a two-run single that extended the Yankees' lead to 11-4.\nThe Brewers never recovered from the missed call.\n\"They admitted they messed up,\" Adames said. \"We mess up sometimes. That's how it goes sometimes.\"\nReporting by The Associated Press.\n[Want great stories delivered right to your inbox? Create or log in to your FOX Sports account, follow leagues, teams and players to receive a personalized newsletter daily.]\n", "description": "Crew chief Andy Fletcher says Aaron Judge should have been called for interference for his slide on a botched double-play attempt that sparked New York’s winning rally in the Yankees’ 15-5 victory at Milwaukee.", "hero_img": "https://statics.foxsports.com/www.foxsports.com/content/uploads/2024/02/Aaron-Judge-horizontal-022024.jpg", "thumbnail": "https://a57.foxsports.com/statics.foxsports.com/www.foxsports.com/content/uploads/2024/02/128/72/Aaron-Judge-horizontal-022024.jpg", "category": "MLB", "date": "Sun, 28 Apr 2024 20:52:42 -0400", "comments": []}, {"title": "MLB to address Nike uniform issues after players' complaints, per memo", "url": "https://www.foxsports.com/stories/mlb/report-mlb-plans-to-address-players-uniform-complaints-per-union-memo", "content": "Major League Baseball plans to introduce changes to the oft-criticized new Nike uniforms this season, ESPN reported.\nAccording to ESPN, a memo sent out by the MLB Players' Association on Sunday said that Nike — not Fanatics, which manufactures the uniforms — was to blame for the uniform issues that caused criticism from both fans and players when the jerseys were rolled out at the beginning of spring training.\nThe fixes that MLB reportedly plans to make to the uniforms include a return to larger name lettering on the backs of jerseys, fixing mismatched shades of gray on road jerseys and pants, and reverting to a \"higher quality zipper\" on the pants.\nThe memo reportedly went as far as praising Fanatics for how it has listened to player and fan feedback while shading Nike for not taking a similar approach. \nNike has been MLB's official uniform supplier since 2019.\n[Want great stories delivered right to your inbox? Create or log in to your FOX Sports account, follow leagues, teams and players to receive a personalized newsletter daily.]\n", "description": "Major League Baseball plans to introduce changes to the oft-criticized new Nike uniforms this season, according to a report.", "hero_img": "https://statics.foxsports.com/www.foxsports.com/content/uploads/2024/04/AnthonyRizzo.jpg", "thumbnail": "https://a57.foxsports.com/statics.foxsports.com/www.foxsports.com/content/uploads/2024/04/128/72/AnthonyRizzo.jpg", "category": "MLB", "date": "Sun, 28 Apr 2024 20:37:58 -0400", "comments": []}, {"title": "Yankees' Gerrit Cole unlikely to return from IL before June", "url": "https://www.foxsports.com/stories/mlb/yankees-gerrit-cole-unlikely-to-return-from-il-before-june", "content": "Don't expect to see Gerrit Cole back on the pitcher's mound in a New York Yankees game any time soon.\nThe six-time All-Star and reigning American League Cy Young Award winner has been dealing with elbow discomfort since spring training and has yet to appear in a game this season. Cole was shut down from baseball activities after his first spring start and placed on the 60-day injured list before the regular season began in late March. He is not eligible to be activated off that list until May 27.\nYankees fans got a glimmer of hope last week when cameras caught Cole playing catch on flat ground at Yankee Stadium. But according to FOX Sports MLB insider Ken Rosenthal, the Yankees ace will likely have to wait to make his return to the active roster.\n\"It's probably unlikely he'll be ready at that time,\" Rosenthal said Monday on FS1. \"It's a six-week buildup normally for pitchers in spring training, and that would be before six weeks [of Cole returning to baseball activities] are up. The good news for the Yankees is that they're winning, and they're doing really well without Cole, so there's no need to push this.\"\nRosenthal did say that Cole is expected to take another step in his rehab by throwing off a mound at some point this coming week.\nThe Yankees are currently 19-10 and one game ahead of the Baltimore Orioles in the American League East despite getting nothing from Cole so far and a slow start to the season from superstar slugger and 2022 AL MVP Aaron Judge.\n[Want great stories delivered right to your inbox? Create or log in to your FOX Sports account, follow leagues, teams and players to receive a personalized newsletter daily.]\n", "description": "Gerrit Cole is unlikely to return to action for the Yankees when he is eligible on May 27, according to a report by FOX Sports' Ken Rosenthal.", "hero_img": "https://statics.foxsports.com/www.foxsports.com/content/uploads/2024/04/GerritCole10.jpg", "thumbnail": "https://a57.foxsports.com/statics.foxsports.com/www.foxsports.com/content/uploads/2024/04/128/72/GerritCole10.jpg", "category": "MLB", "date": "Mon, 29 Apr 2024 20:32:28 -0400", "comments": []}, {"title": "Minnesota Twins' new home-run sausage is fueling their seven-game winning streak", "url": "https://www.foxsports.com/stories/mlb/minnesota-twins-new-home-run-sausage-is-fueling-their-seven-game-winning-streak", "content": "The Minnesota Twins are no stranger to unique home-run celebrations. Last season, the team introduced a fishing vest and toy fishing pole to the dugout, a nod to the state's 10,000 lakes.\nThis year, it's none other than a midwestern delicacy — the summer sausage — fueling the Twins' seven-game winning streak.\nIn Thursday's matchup against the White Sox, the Twins faced a 2-0 deficit in the bottom of the sixth inning. Then, hitting coach David Popkins brought a Cloverdale Foods tangy summer sausage into the dugout and beckoned his players to tap it before they hit.\nThe presence of the sausage ignited a flurry of hits, including back-to-back homers from Edouard Julien and Ryan Jeffers in the same inning. After Carlos Santana homered in the eighth, Jeffers tossed the sausage to the first baseman on his return to the dugout and the home-run celebration was born.\n\"It was a bad toss, I needed to get it a little higher,\" Jeffers said. \"So, we'll work on our alley-oop skills.\"\nSince then, the sausage has been by the Twins' side, and they have plenty of success to show for it. After sweeping the White Sox, Minnesota went to Los Angeles where they totaled 32 runs and 45 hits to win three straight against the Angels.\nThe sausage has been traveling with the team in a Ziploc bag shoved into a shoe. When it comes to their upcoming games in Toronto, it's unclear whether the sausage will make it through customs — though Jeffers is confident they can find a way.\nIn contrast to other MLB dugout celebrations, the Twins choice is unfortunately perishable. Jeffers said they're working on locating a fresh sausage for every series.\n\"It's bringing us a lot of hits and runs, so I'm all for it,\" said Twins manager Rocco Baldelli. \"I'm slightly concerned that the package is going to open up. The thing hasn't been refrigerated in many days, and there's no doubt that when that thing opens up whoever's touching it is in deep trouble.\"\nJeffers echoed Baldelli: \"He doesn't want another epidemic. We don't want the Minnesota Twins' sausage to start a world-wide crisis.\"\nSo far, it's hard to tell whether the sausage will supersede the vest in its good luck capabilities. Jeffers said the team hasn't learned enough about the sausage yet, and they need to get more in touch with it to see what it's going to provide them.\n\"It's the idea of the sausage. It's the meaning behind the sausage,\" he said. \"We're going to learn more about the sausage as the games go by.\"\nWhen asked if he thinks the sausage lore would distract his players from improving upon where they were a week ago, Baldelli didn't seem concerned. He emphasized how the sausage has fueled a \"winning mindset,\" which is benefiting the Twins now.\n\"The season's too grueling and baseball's too hard of a sport to not have fun once in a while, right?\" Jeffers said.\nReporting by The Associated Press.\n[Want great stories delivered right to your inbox? Create or log in to your FOX Sports account, follow leagues, teams and players to receive a personalized newsletter daily.]\n", "description": "The Minnesota Twins are no stranger to unique home-run celebrations, and now they have a summer sausage fueling their seven-game winning streak.", "hero_img": "https://statics.foxsports.com/www.foxsports.com/content/uploads/2024/04/twins-celebration.jpg", "thumbnail": "https://a57.foxsports.com/statics.foxsports.com/www.foxsports.com/content/uploads/2024/04/128/72/twins-celebration.jpg", "category": "MLB", "date": "Mon, 29 Apr 2024 19:41:23 -0400", "comments": []}, {"title": "Angels star Mike Trout to undergo knee surgery", "url": "https://www.foxsports.com/stories/mlb/angels-star-mike-trout-to-undergo-knee-surgery", "content": "Los Angeles Angels superstar Mike Trout will have surgery to repair a torn meniscus in his left knee, sidelining the three-time AL MVP indefinitely, team general manager Perry Minasian announced. The Angels believe Trout will be able to return this season, Minasian said.\nIt is unknown when the 32-year-old former MVP suffered the knee injury. Trout played the entirety of the Angels' 6-5 win over the Philadelphia Phillies in center field Monday and did not appear to be hurt. \nTrout has a .220 batting average and .867 OPS in 29 games this season, but is tied for the MLB lead with 10 home runs. He is an 11-time All-Star and has won American League MVP three times, and has been considered one of the best overall players in baseball throughout the vast majority of his 13-year MLB career, all of which has been spent with the Angels.\nTuesday's news means that 2024 will be the fourth straight season where Trout has missed significant time due to injury.\nTrout told reporters he had an MRI after playing in the Angels' 6-5 victory over Philadelphia on Monday. The outfielder fought back tears while describing the pain that gradually crept up on him after the game.\n\"It's crazy, because I look back and I don't even know when I did it,\" Trout said.\nTrout's latest injury is another major blow to the Angels, who are off to an 11-18 start in their first season since Shohei Ohtani's free-agent departure. Los Angeles also has lost $245 million third baseman Anthony Rendon indefinitely to a torn hamstring. Rendon's tenure with the Angels, which began in 2020, has been marred by injuries and poor performance.\nThe 32-year-old Trout won his three MVP awards during a dominant decade of play in the 2010s, but the formerly durable outfielder has been bedeviled by injuries since 2021.\nHe missed all but 36 games of the 2021 season with a strained calf, and he missed several weeks of the 2022 season with a back injury. Trout then broke a bone in his hand last season, missing all but one game after July 3.\n[Want great stories delivered right to your inbox? Create or log in to your FOX Sports account, follow leagues, teams and players to receive a personalized newsletter daily.]\nThe Associated Press contributed to this report.\n", "description": "Los Angeles Angels superstar Mike Trout will undergo knee surgery but is expected to return this season.", "hero_img": "https://statics.foxsports.com/www.foxsports.com/content/uploads/2024/04/MikeTrout2.jpg", "thumbnail": "https://a57.foxsports.com/statics.foxsports.com/www.foxsports.com/content/uploads/2024/04/128/72/MikeTrout2.jpg", "category": "MLB", "date": "Tue, 30 Apr 2024 18:48:42 -0400", "comments": []}, {"title": "Astros to option 2020 AL MVP José Abreu to spring training facility in Florida", "url": "https://www.foxsports.com/stories/mlb/astros-to-option-2020-al-mvp-jose-abreu-to-spring-training-facility-in-florida", "content": "The Houston Astros will option slumping first baseman José Abreu to their spring training facility to try and get the 2020 AL MVP back on track.\nGeneral manager Dana Brown made the announcement Tuesday, saying that they'd make the move Wednesday. The 37-year-old will report to the Astros complex in West Palm Beach, Florida.\nBrown said the decision was made after a meeting that included himself, Abreu, coaches and front-office personnel.\nAbreu, in the second season of a $58.5 million, three-year contract, is hitting .099 with just one extra-base hit and three RBIs. In 77 plate appearances across 22 games this season, Abreu has just seven hits.\nBrown said Abreu was very receptive during their conversation and had a good attitude about the move.\n\"Jose Abreu is an outstanding human being,\" Brown said. \"He is unselfish, and he's a teammate's guy, and he wants to get himself back to what he was doing last fall. And so, in the midst of this conversation, you could see that this guy is passionate and determined to get back to helping his team.\n\"And so he unselfishly was on board with an agreement with going back to West Palm Beach and getting some extra bats, getting some detailed instruction on what we could do to get him back,\" Brown continued.\nThe Astros selected the contract of Joey Loperfido from Triple-A Sugar Land on Tuesday, and he will likely play some first base, but Brown indicated that he'd mostly be used in the outfield. The 24-year-old was set to make his major-league debut Tuesday night against the Guardians in left field, leaving Jon Singleton to fill in for Abreu at first base. Singleton entered Tuesday hitting .238 with 10 hits and no RBIs.\nAbreu was the 2014 AL Rookie of the Year and is a three-time All-Star and a three-time Silver Slugger award winner. He is in his 11th big-league season.\n\"He got to the point where he was frustrated,\" Brown said. \"It's rare to do it. But I think it tells us about his dedication and commitment and I don't think he sees this as a long term and I don't think we see it as a long-term thing. I think it's more like… let's go down, let's make some adjustments. Let's get the rhythm and timing back. And I think in his eyes, he's looking at it as I'll be back in a couple of weeks or whatever it takes to get better.\"\nAbreu hit .237 with 18 home runs and 90 RBIs last season in his first year in Houston after nine seasons with the White Sox. He had four homers and 13 RBIs in 11 postseason games.\n\"The bat speed is still pretty good,\" Brown said. \"So, we've got to get his timing right, and we've got to get his rhythm right, so that he can consistently do it. And so I still feel very optimistic about it.\"\nReporting by The Associated Press.\n[Want great stories delivered right to your inbox? Create or log in to your FOX Sports account, follow leagues, teams and players to receive a personalized newsletter daily.]\n", "description": "The Astros will option first baseman José Abreu to their spring training facility to try and get the 2020 AL MVP back on track.", "hero_img": "https://statics.foxsports.com/www.foxsports.com/content/uploads/2024/04/abreu.jpg", "thumbnail": "https://a57.foxsports.com/statics.foxsports.com/www.foxsports.com/content/uploads/2024/04/128/72/abreu.jpg", "category": "MLB", "date": "Tue, 30 Apr 2024 17:41:20 -0400", "comments": []}, {"title": "Dodgers play entire game without striking out for first time since 2006", "url": "https://www.foxsports.com/stories/mlb/dodgers-play-entire-game-without-striking-out-for-first-time-since-2006", "content": "The Los Angeles Dodgers' powerful offense that includes Mookie Betts, Shohei Ohtani and Freddie Freeman isn't used to putting zeros on the scoreboard.\nThey're just fine with one that occurred Monday night.\nThe Dodgers played an entire game without striking out once in their 8-4 win over the Arizona Diamondbacks, which is the first time the franchise played a full game without a punchout since 2006.\n\"A lot of competitive at-bats,\" Dodgers manager Dave Roberts said. \"Eighteen years — we've seen a lot of baseball games since that's happened. I just think you've got to give the players all the credit for winning pitches and fighting to move the ball forward.\"\nLos Angeles has won seven of its past eight games.\nThe Dodgers had 44 plate appearances without a strikeout. The D-backs threw Tommy Henry, Andrew Saalfrank, Scott McGough, Logan Allen and Justin Martinez, who walked eight.\nHenry took the loss, giving up two runs over four innings.\n\"Their game plan was to be really aggressive,\" Henry said. \"Felt like there was a lot of early contact. Anything in the zone early, they were hacking at and they're good hitters. They were putting barrels on them.\"\nReporting by The Associated Press.\n", "description": "The Dodgers' powerful offense isn't used to putting up zeros, but the team put up a good kind of zero in its win over Arizona on Monday.", "hero_img": "https://statics.foxsports.com/www.foxsports.com/content/uploads/2024/04/ab00b46e-Shohei-Ohtani.jpg", "thumbnail": "https://a57.foxsports.com/statics.foxsports.com/www.foxsports.com/content/uploads/2024/04/128/72/ab00b46e-Shohei-Ohtani.jpg", "category": "MLB", "date": "Tue, 30 Apr 2024 09:27:30 -0400", "comments": []}]