[{"title": "Timberwolves coach Chris Finch reportedly tears patellar tendon after colliding with Mike Conley", "url": "https://www.foxsports.com/stories/nba/timberwolves-coach-chris-finch-reportedly-tears-patellar-tendon-after-colliding-with-mike-conley", "content": "Minnesota Timberwolves coach Chris Finch is believed to have a torn patellar tendon after colliding with Mike Conley on Sunday night, according to a report from The Athletic.\nFinch was helped off the court late in the fourth quarter against the Phoenix Suns.\nConley was trying to dribble down the sideline when he collided with Suns star Devin Booker and ran into Finch, who appeared to injure his right knee as Conley tried to brace their fall. Finch grimaced and immediately grabbed his right knee.\nHe was down for a few minutes, surrounded by Minnesota players, coaches and staff, before slowly getting up and being assisted off the court.\nMinnesota won 122-116 to sweep the first-round series.\nAssistant coach Micah Nori directed the team for the final 1:41. Nori said Finch was in the medical room getting checked out and that the team went down to see him after the game.\n\"He’s obviously in good spirits and so are the guys,\" Nori said.\nReporting by The Associated Press.\n[Want great stories delivered right to your inbox? Create or log in to your FOX Sports account, follow leagues, teams and players to receive a personalized newsletter daily.]\n", "description": "Minnesota coach Chris Finch was helped off the court late in the fourth quarter against the Phoenix Suns on Sunday night after colliding with Timberwolves guard Mike Conley.", "hero_img": "https://statics.foxsports.com/www.foxsports.com/content/uploads/2024/04/b2862200-timberwolves1.jpg", "thumbnail": "https://a57.foxsports.com/statics.foxsports.com/www.foxsports.com/content/uploads/2024/04/128/72/b2862200-timberwolves1.jpg", "category": "NBA", "date": "Mon, 29 Apr 2024 00:59:19 -0400", "comments": []}, {"title": "Timberwolves complete first-round sweep of Suns with 122-116 win in Game 4", "url": "https://www.foxsports.com/stories/nba/timberwolves-complete-first-round-sweep-of-suns-with-122-116-win-in-game-4", "content": "Anthony Edwards scored 40 points, Karl-Anthony Towns added 28 and the Minnesota Timberwolves pulled away late to beat the Phoenix Suns 122-116 on Sunday night and sweep the first-round playoff series.\nEdwards scored 31 of his points in the second half and finished 13 of 23 from the field, including 7 of 13 from 3-point range. Continuing his ascent into superstardom, the 22-year-old threw down a powerful, one-handed jam to give Minnesota a 115-111 lead with 2:14 left.\nPhoenix would never recover.\nThe Wolves finished off the Suns despite Devin Booker's 49 points on 13 of 21 shooting. He also made 20 of 21 free throws. Kevin Durant added 33, but the rest of the team struggled.\nMinnesota won despite coach Chris Finch leaving the game late in the fourth after an inadvertent collision with Wolves guard Mike Conley.\nIt was a tight fourth quarter and the Suns tied it at 107 on Royce O'Neale's 3-pointer with 4:30 remaining. Edwards and Jaden McDaniels hit back-to-back corner 3s to put the Wolves up 113-109 with 3:20 left.\nThe Wolves now wait to see if they will face the Denver Nuggets or Los Angeles Lakers in the second round.\nEdwards hit back-to-back 3-pointers early in the third and McDaniels followed with a powerful dunk, helping Minnesota turn a six-point deficit into a 68-66 lead. It was part of a big third for Edwards, who hit four 3-pointers and had 15 points.\nBooker responded, scoring 18 points during the quarter and the Suns took a 92-90 lead into the fourth.\nThe Suns threw various looks at the Wolves in the first half, using five perimeter players at various times to try to pull big men Rudy Gobert and Towns away from the basket.\nBooker hit a fallaway jumper at the buzzer to give the Suns a 61-56 halftime lead. Durant led Phoenix with 20 points before the break, while Booker had 17. Towns had 15 for the Wolves.\nSuns guard Grayson Allen missed his second straight game because of a sprained ankle suffered in Game 1 that he aggravated in Game 2. He averaged 13.5 points per game and led the NBA in 3-point percentage during the regular season.\nReporting by The Associated Press.\n[Want great stories delivered right to your inbox? Create or log in to your FOX Sports account, follow leagues, teams and players to receive a personalized newsletter daily.]\n", "description": "Anthony Edwards scored 40 points, Karl-Anthony Towns added 28 and the Minnesota Timberwolves pulled away late to beat the Phoenix Suns 122-116 and sweep the first-round playoff series.", "hero_img": "https://statics.foxsports.com/www.foxsports.com/content/uploads/2024/04/88c9ada4-ant1.jpg", "thumbnail": "https://a57.foxsports.com/statics.foxsports.com/www.foxsports.com/content/uploads/2024/04/128/72/88c9ada4-ant1.jpg", "category": "NBA", "date": "Mon, 29 Apr 2024 00:52:10 -0400", "comments": []}, {"title": "Pacers hit franchise playoff-best 22 3-pointers to beat Bucks 126-113, take 3-1 lead in series", "url": "https://www.foxsports.com/stories/nba/pacers-hit-franchise-playoff-best-22-3pointers-to-beat-bucks-126113-take-31-lead-in-series", "content": "Myles Turner scored 29 points, Tyrese Haliburton added 24 and the Indiana Pacers made a franchise playoff-record 22 3-pointers as they pulled away late for a 126-113 victory over the Milwaukee Bucks on Sunday night.\nThe win gave the Pacers a 3-1 lead in the best-of-seven series. Indiana has won three straight since losing the opener and can reach the Eastern Conference semifinals for the first time since 2014 — with a win Tuesday at Milwaukee.\nIndiana is 7-2 this season against the Bucks, who are trying to avoid a second straight first-round exit.\nHaliburton posted a career playoff scoring high for the second straight game, while Turner matched a playoff career high that he set in Friday night's overtime win. Turner also had nine rebounds and four assists against a Bucks squad that was missing two injured All-Stars, Giannis Antetokounmpo and Damian Lillard.\nIt's unclear if either will be available in Game 5. Antetokounmpo hasn't played since straining his left calf April 9. Lillard injured his Achilles tendon Friday night and had a protective walking boot covering his right foot this weekend.\nBrook Lopez led the Bucks with 27 points and nine rebounds, and Khris Middleton added 25 points, 10 rebounds and five assists.\nBut the Bucks depth took even bigger hits with Middleton playing much of the second half with four fouls and forward Bobby Portis Jr. being ejected with 5:01 left in the first quarter after he and Andrew Nembhard were involved in a shoving match. Portis drew two technical fouls on the play, part of a six-technical first half.\nStill, the Pacers struggled to take advantage, finishing the back-and-forth first half with just a 67-64 lead.\nBut after Lopez's opened the third quarter with a basket, Haliburton responded with three straight 3s to give the Pacers a 76-66 lead. The Bucks never completely recovered as Indiana extended the margin to 95-78 on Obi Toppin's layup with 2:24 left in the quarter.\nMilwaukee opened the fourth with seven straight points to close to 98-92. Indiana answered with a 10-2 run to rebuild a 108-94 cushion with 7:25 to play and the Bucks couldn't get within single digits the rest of the game.\nNembhard finished with 15 points and nine assists for the Pacers and Pascal Siakam added 13 points, nine rebounds and seven assists.\nMalik Beasley added 20 points for Milwaukee.\nReporting by The Associated Press.\n[Want great stories delivered right to your inbox? Create or log in to your FOX Sports account, follow leagues, teams and players to receive a personalized newsletter daily.]\n", "description": "The Indiana Pacers made a franchise playoff-record 22 3-pointers as they pulled away from the Milwaukee Bucks 126-113 on Sunday to take a 3-1 lead in the series.", "hero_img": "https://statics.foxsports.com/www.foxsports.com/content/uploads/2024/04/pacers-bucks.jpg", "thumbnail": "https://a57.foxsports.com/statics.foxsports.com/www.foxsports.com/content/uploads/2024/04/128/72/pacers-bucks.jpg", "category": "NBA", "date": "Sun, 28 Apr 2024 22:25:31 -0400", "comments": []}, {"title": "2024 NBA Awards Winners Tracker: Thunder's Mark Daigneault named Coach of the Year", "url": "https://www.foxsports.com/stories/nba/2023-24-nba-awards-tracker-tyrese-maxey-wins-most-improved-player", "content": "As the 2024 NBA playoffs get underway, the league's standout players from the past season will be individually honored for their accomplishments over the coming weeks.\nFollow our tracker below to see who takes home 2023-24 NBA MVP, Most Improved Player, Defensive Player of the Year, Coach of the Year and more!\n[2024 NBA Playoff Bracket: Updated schedule, scores, standings]\nCoach of the Year: Mark Daigneault, Oklahoma City Thunder\nDaigneault was promoted from head coach of the Thunder's G-League affiliate in 2020, tasked with shepherding a young, rebuilding Oklahoma City team. That rebuild paid off in a major way this past season, as the Thunder finished with a 57-20 record and secured the No. 1 seed in the Western Conference.\nShai Gilgeous-Alexander cemented his status as one of the best players in the NBA — becoming an MVP finalist — second-year players Chet Holmgren and Jalen Williams took a major leap in the frontcourt, and fellow starters Lu Dort and Josh Giddey continued to show off their two-way abilities under Daigneault's tutelage. All five regular Thunder starters averaged double-digit points per game during the regular season.\nClutch Player of the Year: Stephen Curry, Golden State Warriors\nThe 10-time NBA All-Star and four-time NBA champion finished first in points (189), made field goals (59) and made 3-pointers (32) in the clutch this season, defined by the NBA as the last five minutes of a game in which the score is within five points.\nCurry shot 49.6% from the field and 45.7% from 3-point range in these scenarios, and the Warriors were 23-20 with him in the lineup.\nIn February, the two-time NBA MVP became the first player to reach 3,600 career 3-pointers. The 36-year-old will join Team USA men's basketball this summer in Paris for his Olympic debut. \nSixth Man of the Year: Naz Reid, Minnesota Timberwolves\nNaz Reid flourished off the bench for the Minnesota Timberwolves this season, averaging 13.5 points, 5.2 rebounds and 1.3 assists per game — all career-highs — in 24.2 minutes per game. Reid also notably shot 41.4% from 3-point range on 5.0 attempts per game. A little less than half of his field goal attempts came from beyond the arc.\nReid beat out Sacramento Kings guard Malik Monk for the award. Monk was the betting favorite to win at -280, followed by Reid at +230. Monk led the league in points off of the bench with 15.4 PPG.\nMost Improved Player: Tyrese Maxey, Philadelphia 76ers\nFollowing the Sixers' trade of James Harden to the Clippers in October 2023, Maxey quickly became the No. 2 scorer on the team behind reigning league MVP Joel Embiid while also blossoming into his role as Philadelphia's starting point guard. The 23-year-old former first-round pick out of Kentucky was named to his first All-Star game in February, and averaged 25.9 points, 6.2 assists and 3.7 rebounds per game in the 2023-24 regular season.\nMaxey, who was +1100 in betting odds to win the Most Improved Player award before the season, has three 50-plus point games in his career, with his latest being a 52-point performance in April against the San Antonio Spurs. He finished the season averaging 25.9 points and 6.2 assists per game, helping the Sixers reach the playoffs again as the No. 7 seed after beating the Miami Heat in the play-in tournament.\n[Want great stories delivered right to your inbox? Create or log in to your FOX Sports account, follow leagues, teams and players to receive a personalized newsletter daily.]\n", "description": "Follow along here as the NBA's standout players are honored for their individual accomplishments during 2023-24 NBA awards season!", "hero_img": "https://statics.foxsports.com/www.foxsports.com/content/uploads/2024/04/4.17.23_NBA-Awards-Tracker_16x9.jpeg", "thumbnail": "https://a57.foxsports.com/statics.foxsports.com/www.foxsports.com/content/uploads/2024/04/128/72/4.17.23_NBA-Awards-Tracker_16x9.jpeg", "category": "NBA", "date": "Sun, 28 Apr 2024 19:49:50 -0400", "comments": []}, {"title": "Clippers hang on beat Mavericks 116-111 after blowing 31-point lead", "url": "https://www.foxsports.com/stories/nba/clippers-hang-on-beat-mavericks-116-111-after-blowing-31-point-lead", "content": "Paul George and James Harden each scored 33 points while playing key fourth-quarter roles to help the Los Angeles Clippers hold on after blowing a 31-point lead and beat the Dallas Mavericks 116-111 on Sunday, evening the first-round series at 2-2.\nThe Clippers won again without Kawhi Leonard, who missed the series opener with right knee inflammation before playing in the two Dallas victories.\nThe teams have split a pair on each other's home court in the third Western Conference first-round meeting between them in the past five seasons. Game 5 is Wednesday night in Los Angeles.\nKyrie Irving scored 40 points for Dallas, including an acrobatic layup with 2:15 remaining for a 104-103 lead that was the first for the Mavericks since the middle of the first quarter.\nLuka Doncic had 29 points, 10 rebounds and 10 assists in his fourth career playoff triple-double — all against the Clippers.\nGeorge scored 26 points in the first half, when the Clippers' lead reached 55-24 on a 3-pointer by Harden. The high-scoring stars combined to go 11 of 16 from long range as LA finished 18 of 29 overall.\nAfter Irving's go-ahead layup, George hit his first basket of the second half, a fadeaway 3 from the corner. Irving missed a layup, and Harden converted a three-point play as the 10-time All-Star scored 15 points in the fourth.\nThe Clippers tied a franchise playoff record for a quarter with eight 3s in the first, and George had three of them while scoring his playoff first-quarter high with 16 points to match the Mavericks and help build a 39-16 lead.\nThe LA lead reached 55-24 when Harden hit a 3 not long after Doncic was called for a technical foul coming down the court when his miss dropped Dallas to 0-11 from long range.\nIrving hit the next two 3s for Dallas, and the rally was on. He scored 16 in the second quarter and kept it going in the third, finishing those two quarters with 26 after a scoreless first. Dallas trailed by four entering the fourth quarter.\nReporting by The Associated Press.\n[Want great stories delivered right to your inbox? Create or log in to your FOX Sports account, follow leagues, teams and players to receive a personalized newsletter daily.]\n", "description": "Paul George and James Harden each scored 33 points to help the Los Angeles Clippers hold on after blowing a 31-point lead and beat the Dallas Mavericks 116-111.", "hero_img": "https://statics.foxsports.com/www.foxsports.com/content/uploads/2024/04/clips-mavs.jpg", "thumbnail": "https://a57.foxsports.com/statics.foxsports.com/www.foxsports.com/content/uploads/2024/04/128/72/clips-mavs.jpg", "category": "NBA", "date": "Sun, 28 Apr 2024 19:21:34 -0400", "comments": []}, {"title": "Jalen Brunson scores career playoff-high 47 points, leads Knicks over 76ers for 3-1 lead", "url": "https://www.foxsports.com/stories/nba/brunson-scores-career-playoffhigh-47-points-leads-knicks-over-76ers-for-31-lead", "content": "Jalen Brunson scored a career playoff-high 47 points, added 10 assists and the New York Knicks beat the Philadelphia 76ers 97-92 on Sunday to take a 3-1 lead in their first-round playoff series.\nOG Anunoby added 16 points and 14 rebounds, and took on some of the defensive assignment against Joel Embiid in the fourth quarter as the Knicks moved within a victory of getting to the Eastern Conference semifinals for the second straight year.\nThe No. 2-seeded Knicks can do that with a victory at home on Tuesday night.\nEmbiid played the entire second half after the 76ers faltered badly when he sat in the first. But the All-Star center, who has been dealing with lingering problems from his surgically repaired left knee that he appeared to reinjure after a dunk in Game 1, and was recently diagnosed with Bell's palsy, a form of facial paralysis, couldn't muster a basket in the fourth quarter.\nEmbiid finished with 27 points, 10 rebounds and six assists. Tyrese Maxey added 23 points for the 76ers, who will try to force another game at home, which would be Thursday.\nNot that the 76ers had much of a home-court advantage Sunday. Knicks fans were all over the arena and gave Brunson louder chants of \"MVP! MVP!\" than Embiid — who won the award last season — received from the home fans.\nBrunson earned every one of them on a day some of his usual support couldn't get going.\nJosh Hart missed all seven shots and Donte DiVincenzo missed his first seven. But Hart grabbed 17 rebounds and the Knicks kept going after missed shots, especially when it was clear Embiid didn't have the energy to keep chasing them, and scored 21 second-chance points.\nBrunson was in the locker room to start the fourth quarter but returned to hit a basket over Embiid during a 6-0 Knicks run that gave them the lead for good and made it 86-81. He had another basket that made it 95-89 with 55 seconds remaining and the Knicks closed it out.\nEmbiid scored 50 points, his postseason best, to lead the 76ers to a victory in Game 3, He had them off to a great start in Game 4 but Brunson soon became the dominant player on the floor, the first time All-Star finishing 18 of 34 from the field.\nBrunson's shot was off the in the two games in New York but whatever was working for the Sixers against in New York is gone now. The point guard had 39 on Thursday and was confidently getting to his spots in Game 4, looking like the player who was fourth in the NBA in scoring with 28.7 per game.\nEmbiid tried to keep pace. With 76ers Hall of Famers Julius Erving and Allen Iverson sitting behind the baseline, the Sixers' current star showed how much the current Philadelphia team needs him on the floor. But without getting a rest he wilted late and finished 7 for 19.\nBrunson had a 41-point game for Dallas against Utah in 2022 and another for the Knicks last year against Miami, but that one came in the Game 6 where the Knicks' season ended.\nHe wouldn't let them lose Sunday and a crowd that seemed split between big Northeast cities had a decidedly Knicks sound down the stretch.\nThe Knicks played without backup center Mitchell Robinson because of a sprained left ankle, then lost reserve swingman Bojan Bogdanovic to a bruised left ankle after Nicolas Batum fell on him chasing a loose ball after barely a minute of playing time.\nSo the Knicks relied on the guys they had, with Anunoby playing 47 minutes, Hart 46 and Brunson 43.\nThe 76ers led by 10 after one quarter. But Philadelphia couldn't get anything going offensively with Embiid on the bench to start the second and New York capitalized.\nThe Knicks held the 76ers without a field goal while outscoring them 12-2 to begin the period, with Brunson's basket shortly after Embiid returned tying it at 29. Maxey hit a 3-pointer for Philadelphia's first basket of the period nearly halfway through it, but five consecutive points by Brunson moved New York back into the lead at 34-32.\nThe 76ers regained the lead and were ahead 49-47 at halftime.\nPhiladelphia went up by double digits again in the third before a couple bad turnovers halted their momentum and DiVincenzo finally got going with consecutive 3-pointers.\nReporting by The Associated Press.\n", "description": "Jalen Brunson scored a career playoff-high 47 points, leading the New York Knicks to a 3-1 lead over the Philadelphia 76ers in their first-round playoff series.", "hero_img": "https://statics.foxsports.com/www.foxsports.com/content/uploads/2024/04/brunson-knicks.jpg", "thumbnail": "https://a57.foxsports.com/statics.foxsports.com/www.foxsports.com/content/uploads/2024/04/128/72/brunson-knicks.jpg", "category": "NBA", "date": "Sun, 28 Apr 2024 17:30:29 -0400", "comments": []}, {"title": "The Lakers avoided a sweep. Can they steal Game 5 in Denver?", "url": "https://www.foxsports.com/stories/nba/the-lakers-avoided-a-sweep-can-they-steal-game-5-in-denver", "content": "Denver Nuggets center DeAndre Jordan was walking down the hallway when he saw Anthony Davis' father standing outside of the Los Angeles Lakers' locker room. \nFlashing a smile, Jordan approached Anthony Davis Sr. \n\"He didn't have to do us like that tonight,\" Jordan said, as Davis' father laughed. \nWith the Lakers trailing their first round playoff series 3-0 and facing elimination, Davis had his third 20-20 performance of the season and his first this postseason, finishing with 25 points and 23 rebounds to lead the Lakers to a 119-108 win in Game 4 at Crypto.com Arena on Saturday. \nThe Lakers snapped their 11-game losing streak against the Nuggets and avoided being swept by them in consecutive postseasons, following the Nuggets' swift dismantling of them in the 2023 Western Conference Finals. \nIt was a giant relief for Davis, who said he had a bitter taste in his mouth all of last summer. When asked if he had a talk with LeBron James about not allowing that to happen again, he said words weren't necessary. \n\"I just think there was a feeling in the room starting in yesterday's film session,\" Davis said. \"It sucks to get swept. Nobody wants that feeling, especially going into the summer. You have to have that feeling for the rest of the summer.\"\nThe Lakers might have avoided the embarrassment of the proverbial broom, but they still have an incredibly steep road ahead. No team in NBA history has ever recovered from a 3-0 series deficit. \nConsidering the Lakers hadn't beaten the Nuggets in 499 days, mounting that type of a run seems unlikely. That being said, the Lakers did something Saturday that they hadn't been able to do this series: Hold their lead.\nThe Lakers blew a 12-point advantage in Game 1, a 20-point lead in Game 2 and a 12-point lead in Game 3. Their kryptonite? Third quarters. So, when they led by as much as 13 points in the first half, it seemed as though fans were holding their breath when they took the court again after halftime. \nBut the Lakers pushed their advantage to as much as 19 points in the fourth quarter and never trailed. The biggest difference was that Davis and James finally had some help. D'Angelo Russell, who was 0-for-7 in Game 3, had 21 points, four rebounds and four assists. And Austin Reaves poured in 21 points and got six assists.\nThis series shouldn't be so lopsided as it is, considering the Lakers have led for 136 minutes and 31 seconds, while the Nuggets have only been ahead for 41 minutes and 53 seconds.\nEvery third quarter except for Saturday, the Lakers have looked discombobulated and stunned that the reigning NBA champions, who have a two-time MVP in Nikola Jokić and a postseason superstar in Jamal Murray, emerge from their locker room with a sense of urgency. \nThis time, the Lakers matched their energy, only getting outscored 32-30 in the period that has marked their downfall. Lakers coach Darvin Ham chalked up the difference to focus. \n\"Not becoming stagnant,\" Ham said. \"Just continuing with our pace, continuing getting stops. We got a bunch of dominant stops and then we got some timely stops. They hit some tough shots, got some and-ones. And we didn't hang our head.\"\nIt would've been a bit of a shame had the Lakers been swept considering James' and Davis' performances these playoffs.\nJames has continued to defy time, finishing with 30 points in Game 4, including scoring 14 in the fourth quarter. He entered Game 4 averaging 26.3 points, 9.7 assists and 6.7 rebounds this postseason.\nAs for Davis, he has averaged 30.5 points and a playoff career-high 15.7 rebounds against Jokic this round. And on Saturday, he aggressively attacked the paint, dunking, finessing and using force to impose his will on both ends of the court. \n\"I think AD doesn't have to prove anything to anybody,\" James said. \"He's one of the best bigs we have in the game, one of the best bigs in the world. And he's showing that again through the first four games.\"\nJust ask Jordan, who was so impressed by Davis that he had to stop his father in a hallway. \nMeanwhile, Davis' father patiently waited to congratulate his son, who played a career-high 76 games this season and helped shed the injury-prone narrative that has plagued him. \nNow, he has an even greater challenge ahead. \nWhatever happens, at least he'll have a better taste in his mouth after Saturday. \nMelissa Rohlin is an NBA writer for FOX Sports. She previously covered the league for Sports Illustrated, the Los Angeles Times, the Bay Area News Group and the San Antonio Express-News. Follow her on Twitter @melissarohlin.\n[Want great stories delivered right to your inbox? Create or log in to your FOX Sports account, follow leagues, teams and players to receive a personalized newsletter daily.]\n", "description": "With the Lakers trailing their first round playoff series 3-0 and facing elimination, they won Game 4, 119-108.", "hero_img": "https://statics.foxsports.com/www.foxsports.com/content/uploads/2024/04/2dc11a55-lakers1.jpg", "thumbnail": "https://a57.foxsports.com/statics.foxsports.com/www.foxsports.com/content/uploads/2024/04/128/72/2dc11a55-lakers1.jpg", "category": "NBA", "date": "Sun, 28 Apr 2024 13:35:07 -0400", "comments": []}, {"title": "Bucks' Giannis Antetokounmpo, Damian Lillard out vs. Pacers in Game 4", "url": "https://www.foxsports.com/stories/nba/bucks-giannis-antetokounmpo-damian-lillard-out-vs-pacers-in-game-4", "content": "The Milwaukee Bucks will be without injured All-Stars Giannis Antetokounmpo and Damian Lillard when their playoff series resumes Sunday night at Indiana.\nBoth were officially listed as out for a pivotal Game 4 on Sunday's injury report.\nAntetokounmpo has missed the first three games in this best-of-seven first-round series and has not played since straining his left calf April 9. Rivers said Saturday that he \"doubted\" the two-time league MVP would be cleared to play.\nThe Pacers lead the series 2-1.\nLillard joined the injury list following Friday night’s 121-118 overtime loss in Game 3. He twisted his left knee in the first quarter, went to the locker room and then injured his Achilles tendon in the waning minutes of regulation. He finished the game with 28 points and eight assists but only scored two points, both on free throws, in the final 10 minutes of action.\nRivers said after the game that Lillard said he lacked his typical explosiveness late in the game. Lillard had a protective walking boot covering his right foot while walking through the team hotel Saturday.\nRivers told reporters the team was awaiting MRI results before making a decision about Lillard’s status but that it was \"not looking good.\"\nMilwaukee is trying to even up the series and avoid a second straight first-round exit in the postseason.\nReporting by The Associated Press.\n", "description": "The Bucks will be without injured stars Giannis Antetokounmpo and Damian Lillard when their playoff series resumes Sunday at Indiana.", "hero_img": "https://statics.foxsports.com/www.foxsports.com/content/uploads/2024/04/1b6da75e-Giannis.jpg", "thumbnail": "https://a57.foxsports.com/statics.foxsports.com/www.foxsports.com/content/uploads/2024/04/128/72/1b6da75e-Giannis.jpg", "category": "NBA", "date": "Sun, 28 Apr 2024 13:29:02 -0400", "comments": []}, {"title": "Lakers force Game 5 in Denver with 119-108 win over Nuggets at home", "url": "https://www.foxsports.com/stories/nba/lakers-force-game-5-in-denver-with-119-108-win-over-nuggets-at-home", "content": "The Los Angeles Lakers finally cracked the Denver Nuggets' mastery of this rivalry and extended their playoff lives for at least another game.\nTo absolutely nobody's surprise, LeBron James led the way.\nJames scored 30 points, Anthony Davis added 25 points and 23 rebounds, and the Lakers avoided postseason elimination with a 119-108 victory over Denver in Game 4 of their first-round series Saturday night.\nD'Angelo Russell and Austin Reaves scored 21 points apiece for the seventh-seeded Lakers, who snapped their 11-game losing streak against the defending NBA champions with their first win over the Nuggets since December 2022.\n\"We get another opportunity to go play one more game, and if we win, come back and play another one and keep moving from there,\" Reaves said. \"Odds aren't stacked in our favor, but anytime we can keep ourselves floating above water and give ourselves an opportunity to do something special, we're up for the challenge.\"\nDenver swept Los Angeles out of the Western Conference finals last season, but the current Lakers responded to this 0-3 deficit with a performance more worthy of a team that rolled into the postseason with 12 wins in 15 games. James scored 14 points in the fourth quarter on 6-of-8 shooting, again carrying the Lakers late in his 21st NBA season.\n\"We deserved this tonight,\" Lakers coach Darvin Ham said. \"We've just got to bottle it up and keep pushing and understand it can be our time. Why not us? Every new game is a new opportunity to be more competitive and more together and more selfless.\"\nGame 5 is Monday night in Denver.\nNikola Jokic had 33 points, 14 rebounds and 14 assists for his 18th career triple-double and second in this series, but the two-time MVP and his teammates couldn't reassert their usual late-game dominance over the Lakers.\nAfter blowing a double-digit lead in each of the first three games of the series, Los Angeles again took a healthy lead early in the second half of Game 4, but never fell behind again despite the Nuggets' unsurprising late rally.\n\"The paint (defense) was a joke,\" Denver coach Michael Malone said after his team allowed a whopping 72 points in the paint.\n\"Every huddle, I sounded like a broken record tonight,\" Malone added. \"Every huddle was, ‘Paint, paint, paint.' (In) Game 3, they had 70 and we found a way to win. Tonight, they had 72. That's an incredible number. ... I just didn't think we had the requisite physicality or urgency. This did not seem like a closeout game.\"\nMichael Porter Jr. had 27 points and 11 rebounds for Denver, and Jamal Murray scored 22 points while going 0 for 4 on 3-point attempts. Aaron Gordon had just seven points for the Nuggets after putting up 29 in Game 3 during the highest-scoring playoff game of his career.\nThe Lakers' 19-point lead with just over six minutes left dwindled to 113-106 on Jokic's three-point play with 1:25 left, but Reaves hit a short jumper before adding four free throws in the final minute as LA held on.\nThe second-seeded Nuggets also lost a closeout game in last season's first round while up 3-0 on Minnesota, but Denver won that series in five games and lost only three more times on the way to its first title.\nThe Lakers showed no quit in their dire circumstances in Game 4, pounding the ball inside for 44 points in the paint during the first half. Los Angeles' 61-48 halftime lead was its fourth of the series.\nThe Lakers stretched their advantage to 15 points in the third quarter and kept building until the final minutes, when Jokic and Kentavious Caldwell-Pope finally sparked a Nuggets rally.\nReggie Jackson played nine minutes for Denver despite spraining his ankle in the second half of Game 3. Malone initially didn't think Jackson would be available for Game 4, but the 13-year veteran stunned the coaches with his quick recovery.\nCaleb Williams, the Heisman Trophy-winning former USC quarterback and the No. 1 overall pick in this weekend's NFL draft by the Chicago Bears, watched the game from courtside.\nReporting by The Associated Press.\n[Want great stories delivered right to your inbox? Create or log in to your FOX Sports account, follow leagues, teams and players to receive a personalized newsletter daily.]\n", "description": "The Los Angeles Lakers avoided playoff elimination with a 119-108 victory over the Denver Nuggets in Game 4 of their first-round series.", "hero_img": "https://statics.foxsports.com/www.foxsports.com/content/uploads/2024/04/0b23e18c-lakers1.jpg", "thumbnail": "https://a57.foxsports.com/statics.foxsports.com/www.foxsports.com/content/uploads/2024/04/128/72/0b23e18c-lakers1.jpg", "category": "NBA", "date": "Sun, 28 Apr 2024 00:06:24 -0400", "comments": []}, {"title": "Celtics take 2-1 lead in series vs. Heat with wire-to-wire win in Miami", "url": "https://www.foxsports.com/stories/nba/celtics-take-2-1-lead-in-series-vs-heat-with-wire-to-wire-win-in-miami", "content": "Jayson Tatum and Jaylen Brown each scored 22 points, and the Boston Celtics soundly beat the Miami Heat 104-84 on Saturday night to a take a 2-1 lead in their Eastern Conference first-round playoff series.\nTatum added 10 rebounds and six assists for the Celtics, who led Game 3 wire-to-wire and reclaimed the home-court edge that they lost when Miami won Game 2 in Boston. Kristaps Porzingis had 18 points and Derrick White scored 16 for the Celtics, who used runs of 12-3, 11-0 and 20-8 in the first half to take full control.\nBam Adebayo scored 20 points for eighth-seeded Miami, which remains without starters Jimmy Butler and Terry Rozier because of injuries. Nikola Jovic and Tyler Herro each scored 15 for the Heat, who got 12 from Jaime Jaquez Jr.\nGame 4 is Monday in Miami, where the Celtics are 9-2 in their last 11 games and 6-1 in their last seven playoff games.\nIt was a season low in points scored for Miami, a season low in points allowed for Boston.\nBounce-back efforts have been a trend for Boston this season. The Celtics — the No. 1 overall seed in the playoffs — don't lose often, and when they do, they tend to just come out and win their next one. Boston is now 15-4 in the game immediately following a loss this season, its average victory margin in those games 12.2 points.\nBoston never trailed in Game 1, a 114-94 win, and never trailed in Game 3 either, on its way to beating Miami for the fifth time in six meetings this season. The Celtics started slowly and Miami started slower, Boston leading 21-12 after one and setting the tone for how nothing would come easily for the Heat.\nIt was Miami's lowest-scoring first quarter in its last 197 games, dating back to the 2022 playoffs — also against Boston, when the Heat managed 11 points in the opening 12 minutes of Game 4 of that East finals series.\nMidway through the second quarter, it — briefly — seemed like Miami had weathered the storm. The Heat were making a bit of a run, the building had some life and Herro had a look at a 3-pointer that would have gotten the Heat within 10.\nIt rimmed out. The storm was not weathered. It was, in fact, just starting.\nThe Celtics outscored Miami 20-8 in the next 4 ½ minutes to go up 61-36, and that was when a good number of fans decided to head for halftime refreshments a bit early. It was 63-39 at the break, Boston dominant in every which way — a 19-2 edge in points off turnovers, a 26-12 scoring edge in the paint, 27-15 in rebounds, 13-6 in assists.\nThe lead reached 29 in the second half, Miami never getting closer than 18 after halftime.\nReporting by The Associated Press.\n[Want great stories delivered right to your inbox? Create or log in to your FOX Sports account, follow leagues, teams and players to receive a personalized newsletter daily.]\n", "description": "Jayson Tatum and Jaylen Brown each scored 22 points, and the Boston Celtics soundly beat the Miami Heat 104-84 to a take a 2-1 lead in their Eastern Conference first-round playoff series on Saturday night.", "hero_img": "https://statics.foxsports.com/www.foxsports.com/content/uploads/2024/04/f8cbb679-celtics1.jpg", "thumbnail": "https://a57.foxsports.com/statics.foxsports.com/www.foxsports.com/content/uploads/2024/04/128/72/f8cbb679-celtics1.jpg", "category": "NBA", "date": "Sat, 27 Apr 2024 20:56:37 -0400", "comments": []}, {"title": "Jimmy Butler says he's 'working,' but there's no timetable for his return to Heat", "url": "https://www.foxsports.com/stories/nba/jimmy-butler-says-hes-working-but-theres-no-timetable-for-his-return-to-heat", "content": "Jimmy Butler says he wants to play in the NBA playoffs, though there's no timetable for his return from a sprained MCL.\nThe Miami Heat forward spoke to TNT during a first-quarter stoppage of his team's Eastern Conference first-round game against the Boston Celtics on Saturday night, as he watched from the team's bench area. Butler got hurt in the play-in round against Philadelphia and has missed all four Heat games since.\n\"I don't know about a timeline, but we've been working,\" Butler said during the televised interview. \"I want to hoop. I want to get out here. I want some of this.\"\nThe preliminary assessment on Butler was that he would miss multiple weeks because of the knee injury, which happened in the first quarter of the game at Philadelphia — before Butler played through it for the final three quarters of that game.\nButler has been getting treatment in the days since, but the team has not revealed any more specific timeframe about when he could play again.\nMiami is playing this series without Butler and point guard Terry Rozier, who is sidelined with a neck injury. The Heat went to the NBA Finals last year as the eighth seed in the East, and Butler said the team's confidence remains high even as a No. 8 seed taking on a Celtics team that finished the regular season with the NBA's best record.\n\"I think we believe,\" Butler said. \"It's everybody else that don't.\"\nReporting by The Associated Press.\n[Want great stories delivered right to your inbox? Create or log in to your FOX Sports account, follow leagues, teams and players to receive a personalized newsletter daily.]\n", "description": "Jimmy Butler says he wants to play in the NBA playoffs, though there’s no timetable for his return from a sprained MCL.", "hero_img": "https://statics.foxsports.com/www.foxsports.com/content/uploads/2024/04/heat1.jpg", "thumbnail": "https://a57.foxsports.com/statics.foxsports.com/www.foxsports.com/content/uploads/2024/04/128/72/heat1.jpg", "category": "NBA", "date": "Sat, 27 Apr 2024 19:02:56 -0400", "comments": []}, {"title": "Shai Gilgeous-Alexander, Thunder roll to 3-0 series lead with 106-85 win over the Pelicans", "url": "https://www.foxsports.com/stories/nba/shai-gilgeous-alexander-thunder-roll-to-3-0-series-lead-with-106-85-win-over-the-pelicans", "content": "Shai Gilgeous-Alexander scored 24 points and the Oklahoma City Thunder beat the New Orleans Pelicans 106-85 on Saturday to take a 3-0 lead in their first-round playoff series.\nJalen Williams and Josh Giddey each scored 21 for the Thunder, who escaped Game 1 with a two-point victory before posting victory margins of 32 in Game 2 and 21 in Game 3.\nTop-seeded Oklahoma City hit 17 of 36 (47.2%) from 3-point range and held a lead of 10 points or more throughout the second half, going up by as many as 24 in the fourth quarter.\nThe eighth-seeded Pelicans, who've been without star forward Zion Williamson during the series because of his hamstring injury, will try to avoid elimination at home in Game 4 on Monday night. But even if they do, history is not on their side. No team in NBA history has come back from a 3-0 series deficit.\nBrandon Ingram scored 19 points and CJ McCollum had 16 for New Orleans, which struggled to hit from the perimeter and to take care of the ball.\nThe Pelicans, who shot just 27.7% from 3-point range during the series' first two games combined, improved only marginally in their return home, hitting 28.1% (9 of 32). New Orleans also turned the ball over 21 times, leading to 23 Thunder points.\nThe game began ominously for the Thunder when Williams took a forearm to the face from Ingram while attempting a driving floater and fell to his hands and knees.\nNo foul was called on the collision, which sent Williams to the locker room for much of the first quarter before he checked back in late in the period.\nThe game was competitive until the Thunder went on a 14-0 run in the second quarter that gave Oklahoma City a 54-39 lead.\nThe surge began with a 3 by Gilgeous-Alexander before Lu Dort connected on three straight from deep.\nAfter McCollum's 3 cut the Pelicans' deficit to 12, they had a chance to get closer in the final seconds of the half, but Gilgeous-Alexander stole the ball from McCollum and was fouled.\nGilgeous-Alexander hit two free throws to give the Thunder a 60-46 lead at halftime.\nWilliams, who has averaged about 20 points per game in the series, was back to his usual by the second half, when he scored 13 of his points, including a pair of 3s during a 9-0 run late in the third quarter that gave the Thunder an 85-66 lead.\nReporting by The Associated Press.\n[Want great stories delivered right to your inbox? Create or log in to your FOX Sports account, follow leagues, teams and players to receive a personalized newsletter daily.]\n", "description": "Shai Gilgeous-Alexander scored 24 points and the Oklahoma City Thunder beat the New Orleans Pelicans 106-85 on Saturday to take a 3-0 lead in their first-round playoff series.", "hero_img": "https://statics.foxsports.com/www.foxsports.com/content/uploads/2024/04/thunder1.jpg", "thumbnail": "https://a57.foxsports.com/statics.foxsports.com/www.foxsports.com/content/uploads/2024/04/128/72/thunder1.jpg", "category": "NBA", "date": "Sat, 27 Apr 2024 18:53:59 -0400", "comments": []}, {"title": "Lakers reportedly 'very open' to idea of pairing LeBron James with Bronny", "url": "https://www.foxsports.com/stories/nba/lakers-reportedly-very-open-to-idea-of-pairing-lebron-james-with-bronny", "content": "LeBron James could have his wish of playing alongside his oldest son, Bronny James, granted by the Los Angeles Lakers next season.\nAccording to a report from The Athletic, the Lakers are \"very open\" to the idea of drafting Bronny, who declared for the 2024 NBA Draft in April despite not doing much to improve his draft stock in his one season at USC.\nBronny, 19, averaged 4.8 points, 2.8 rebounds and 2.1 assists, while shooting 36.6% from the field in 25 games with the Trojans.\nThe Lakers will only have the No. 55 pick in this summer's draft (via the LA Clippers) unless the New Orleans Pelicans choose to defer their owed pick to 2025. In that case, the Lakers will also have the No. 17 pick, just outside of the lottery.\nLeBron James has a player option worth $51.4 million he can decline this summer to become an unrestricted free agent, which puts more pressure on the Lakers to draft Bronny.\nThe 2024 NBA Draft will take place at Barclays Center on June 26 and June 27. NBA free agency starts July 1.\nBronnny to the Lakers?\n2024 Bronny James NBA Draft odds: Lakers aiming to pair LeBron-Bronny?Bronny James' NBA future: Should he stay in the draft?USC's Bronny James to prioritize team interest above all in looming NBA Draft decision\n2024 Bronny James NBA Draft odds: Lakers aiming to pair LeBron-Bronny?\nBronny James' NBA future: Should he stay in the draft?\nUSC's Bronny James to prioritize team interest above all in looming NBA Draft decision\n", "description": "LeBron James could have his wish of playing alongside his oldest son, Bronny James, granted by the Los Angeles Lakers next season.", "hero_img": "https://statics.foxsports.com/www.foxsports.com/content/uploads/2024/02/lebron-bronny.jpg", "thumbnail": "https://a57.foxsports.com/statics.foxsports.com/www.foxsports.com/content/uploads/2024/02/128/72/lebron-bronny.jpg", "category": "NBA", "date": "Tue, 30 Apr 2024 02:00:39 -0400", "comments": []}, {"title": "Jamal Murray overcomes calf injury to score 32, hit game-winner in Nuggets' 108-106 win over Lakers", "url": "https://www.foxsports.com/stories/nba/jamal-murray-overcomes-calf-injury-to-score-32-hit-game-winner-in-nuggets-108-106-win-over-lakers", "content": "Jamal Murray scored 32 points despite a strained calf and sank the game-winner with 3.6 seconds left as the defending NBA champion Denver Nuggets bounced LeBron James from the playoffs again with a 108-106 win over the Los Angeles Lakers in Game 5 Monday night.\nJames' two free throws tied it at 106 with 26 seconds left and the Nuggets, just as they did in Game 2, eschewed the timeout and Murray took the ball on a high screen and roll to his left, shaking Austin Reaves and he crossed through the lane and swished the 14-footer.\nIt was Murray's buzzer beater that won Game 2.\n\"This one was a little better,\" Murray said as confetti swirled around him and his celebrating teammates.\nNikola Jokic, who committed an uncharacteristic seven turnovers, narrowly missed his 19th career playoff triple-double with 25 points, 20 rebounds and nine assists and Michael Porter Jr. scored 26.\nJames had 30 points and 11 assists and Davis had 17 points and 15 rebound but appeared bothered down the stretch after banging his left shoulder into MPJ in the second half.\nThe Nuggets advanced to face the Minnesota Timberwolves in the second round starting next weekend. That series starts in Denver, where the Nuggets are a Western Conference-best 36-8, including 3-0 in the playoffs.\nNot that it's been easy.\nThe Nuggets trailed for about three-fourths of the minutes in this series, they scuffled through extended shooting slumps and they're a banged-up bunch that can definitely use the rest.\nThe Nuggets, who swept the Lakers in the Western Conference finals last summer on their way to winning the franchise's first NBA championship, beat the Lakers for the 12th time in their last 13 games.\nThe only other time James was eliminated in the first round of the playoffs came in 2021 when the Phoenix Suns beat L.A. in six games.\nSo, this was the shortest of James' 17 trips to the playoffs, where he's now 183-104 overall with a 41-13 series record and four titles.\nAfter warming up with an ice pack on his injured calf, Murray got medical clearance to play. He wasn't his usual explosive self on drives to the basket — at first — but he managed 16 points in the first half, including 12 in the first quarter which ended with Denver ahead (28-24) for the first time all series.\nThe Lakers led 53-50 at halftime and pushed that advantage to nine points but the Nuggets closed on a 21-10 run to take an 81-79 lead into the fourth quarter that was tight until the buzzer.\nAfter Murray's clutch shot, Taurean Prince heaved up a half-courter that fell short, sending the Lakers to an early exit despite taking the defending champs to the brink in all five games.\nReporting by The Associated Press.\n[Want great stories delivered right to your inbox? Create or log in to your FOX Sports account, follow leagues, teams and players to receive a personalized newsletter daily.]\n", "description": "Jamal Murray scored a game-high 32 points Monday night despite a strained left calf and sank the game-winning shot with 3.6 seconds remaining as the defending NBA champion Denver Nuggets again bounced LeBron James from the playoffs with a 108-106 win over the Los Angeles Lakers in Game 5", "hero_img": "https://statics.foxsports.com/www.foxsports.com/content/uploads/2024/04/0c1ff9f1-lakers1.jpg", "thumbnail": "https://a57.foxsports.com/statics.foxsports.com/www.foxsports.com/content/uploads/2024/04/128/72/0c1ff9f1-lakers1.jpg", "category": "NBA", "date": "Tue, 30 Apr 2024 01:10:30 -0400", "comments": []}, {"title": "Oklahoma City Thunder notch 97-89 Game 4 victory — and sweep of the Pelicans", "url": "https://www.foxsports.com/stories/nba/oklahoma-city-thunder-notch-97-89-game-4-victory-and-sweep-of-the-pelicans", "content": "Jalen Williams highlighted a 24-point performance with a back-breaking 3 with three minutes left, and the Oklahoma City Thunder beat the New Orleans Pelicans 97-89 on Monday night to complete a four-game sweep of their first-round playoff series.\nShai Gilgeous-Alexander had 24 points and 10 rebounds for Oklahoma City, which trailed by five in the fourth quarter before suddenly seizing control with a combination of stifling defense and opportunistic shooting.\nNew Orleans led 80-75 and had a chance to take what would have been the biggest lead for either team when Jose Alvarado blocked Gilgeous-Alexander and sent CJ McCollum the other way on a two-on-one break.\nMcCollum could not convert at the rim, however. Soon after, Chet Holmgren's putback and Josh Giddey's 3 tied it at 80 and ignited a decisive 18-2 run, capped by Williams' second-chance 3, that put the Thunder up 93-82 with 3:08 left.\nNew Orleans, which played the entire series without star power forward Zion Williamson, never recovered.\nGiddey and Holmgren each scored 14 points. Holmgren also had nine rebounds.\nMcCollum scored 20 for New Orleans, which continued to be plagued by poor 3-point shooting. The Pelicans hit just eight of 34 shots from deep (23.5%).\nJonas Valanciunas had 19 points and 13 rebounds but might have produced more had he not been limited by foul trouble to 26 minutes on the court. Naji Marshall hit half of the Pelicans' 3s and finished with 16 points.\nThe Thunder held a 44-43 halftime lead in a game that was highly competitive through three quarters, with 18 lead changes and neither team leading by more than five.\nNew Orleans stayed close despite Brandon Ingram missing nine of his first 10 shots and 12 of 14 for the game.\nIngram's free throws with 3 seconds left in the third quarter gave the Pelicans a 71-70 lead at the end of the period, but he finished with just eight points when more was needed of him with Williamson out of the lineup.\nReporting by The Associated Press.\n[Want great stories delivered right to your inbox? Create or log in to your FOX Sports account, follow leagues, teams and players to receive a personalized newsletter daily.]\n", "description": "The Oklahoma City Thunder advanced to the Western Conference semifinals of the NBA Playoffs on Monday after sweeping the New Orleans Pelicans, 4-0.", "hero_img": "https://statics.foxsports.com/www.foxsports.com/content/uploads/2024/04/Jalen-Williams-H.jpg", "thumbnail": "https://a57.foxsports.com/statics.foxsports.com/www.foxsports.com/content/uploads/2024/04/128/72/Jalen-Williams-H.jpg", "category": "NBA", "date": "Mon, 29 Apr 2024 23:54:37 -0400", "comments": []}, {"title": "Celtics top Heat 102-88 despite Kristaps Porzingis' injury to take a 3-1 East playoff series lead", "url": "https://www.foxsports.com/stories/nba/celtics-top-heat-102-88-despite-kristaps-porzingis-injury-to-take-a-3-1-east-playoff-series-lead", "content": "Derrick White scored a career-high 38 points, Jayson Tatum added 20 points and 10 rebounds, and the Boston Celtics beat the Miami Heat 102-88 on Monday night to take a 3-1 lead in their Eastern Conference first-round series.\nJaylen Brown scored 17 points and Jrue Holiday had 11 for the top-seeded Celtics, who lost Kristaps Porzingis in the first half to what the team said was a right calf injury. Boston won at Miami for the sixth straight time and improved to 14-3 in their last 17 games on the Heat's home floor.\nBam Adebayo finished with 25 points, 17 rebounds and five assists for Miami, which had a sellout crowd — including Lionel Messi — but played again without injured starters Jimmy Butler (knee) and Terry Rozier (neck). The Heat managed only 84 points in Game 3 and struggled again on offense in Game 4. Tyler Herro scored 19 points and Caleb Martin had 18 for the eighth-seeded Heat.\nThe Celtics can advance to the second round on Wednesday when they host Game 5. The Boston-Miami winner will meet the Cleveland-Orlando winner in the East semifinals; that Cavaliers-Magic series won't end until at least Friday.\nBut the Celtics now have an injury concern, with Porzingis lifting his jersey over his face in exasperation after getting hurt late in the first half. And with 5:04 left, the drama ramped up again when Tatum tried to shoot a 3-pointer after a foul was called. Adebayo defended the dead-ball play, and Tatum rolled his left ankle — but stayed in the game — after Adebayo stepped into his landing area. Referees called a flagrant-1 on Adebayo, and a technical on Al Horford.\nThe good news for Boston: History says this series is just about over.\nThis is the 29th time a Boston team has taken a 3-1 lead in a best-of-seven series. The Celtics won all 28 of the previous series, including seven times in the NBA Finals and a first-round series against Miami in 2010 — the last games the Heat played before luring LeBron James and Chris Bosh to South Florida and forming a superteam around Dwyane Wade.\nMiami just couldn't keep up in this one. White had 16 points in the first quarter, when the Celtics built a 34-24 lead. And no matter what the Heat did on defense, the offense couldn't make up any gaps.\nConsider: The Celtics had 34 points after 12 minutes, and it took the Heat almost 23 minutes — nearly the entire first half — to hit the 34-point mark. Miami had only 59 points through three quarters, matching a season low set in Game 1 of this series at Boston.\nReporting by The Associated Press.\n[Want great stories delivered right to your inbox? Create or log in to your FOX Sports account, follow leagues, teams and players to receive a personalized newsletter daily.]\n", "description": "Derrick White scored a career-high 38 points, Jayson Tatum added 20 points and 10 rebounds, and the Boston Celtics beat the Miami Heat 102-88 to take a 3-1 series lead.", "hero_img": "https://statics.foxsports.com/www.foxsports.com/content/uploads/2024/04/celtics-heat-series.jpg", "thumbnail": "https://a57.foxsports.com/statics.foxsports.com/www.foxsports.com/content/uploads/2024/04/128/72/celtics-heat-series.jpg", "category": "NBA", "date": "Mon, 29 Apr 2024 22:30:02 -0400", "comments": []}, {"title": "Messi, Inter Miami teammates show up for Heat-Celtics playoff game", "url": "https://www.foxsports.com/stories/soccer/messi-inter-miami-teammates-show-up-for-heat-celtics-playoff-game", "content": "Lionel Messi took a night off to watch the Miami Heat.\nThe Inter Miami star and eight-time Ballon d'Or winner as the world's best player — along with teammates Jordi Alba, Sergio Busquets and Luis Suarez — arrived just before tip-off of the Heat playoff game with the Boston Celtics on Monday night.\nThe group — some clad in Heat attire — arrived in the players' parking garage, then were brought in through a VIP entrance before making their way to their seats. Messi has been to the arena before for at least one other event, but never before had arranged to be at a Heat game since moving to Miami last year.\nInter Miami is 6-2-3 so far this season in Major League Soccer play, sitting in first place in the Eastern Conference and with the most points of any team in the league.\nMessi had two goals and an assist in Inter Miami's 4-1 win at New England on Saturday, and has multiple goal contributions in five straight matches — the first MLS player ever to do that. He has nine goals and seven assists in seven matches with Inter Miami this season.\nMessi, who led Argentina to the World Cup title in 2022, has more than 800 goals in his career for club and country, making him one of the greatest scorers in soccer history. He scored twice in the 2022 World Cup final against France, a match that ended 3-3 with Argentina prevailing 4-2 on penalty kicks.\nReporting by The Associated Press.\n", "description": "Lionel Messi took a night off to watch the Miami Heat play the Boston Celtics in a playoff game, and he brought some teammates with him.", "hero_img": "https://statics.foxsports.com/www.foxsports.com/content/uploads/2024/04/messi-wide-042924.jpg", "thumbnail": "https://a57.foxsports.com/statics.foxsports.com/www.foxsports.com/content/uploads/2024/04/128/72/messi-wide-042924.jpg", "category": "NBA", "date": "Mon, 29 Apr 2024 21:01:01 -0400", "comments": []}, {"title": "LeBron James' agent does not expect star to retire after this season", "url": "https://www.foxsports.com/stories/nba/lebron-james-agent-does-not-expect-star-to-retire-after-this-season", "content": "If the Los Angeles Lakers' season ends on Monday, what will come next for LeBron James? \nAccording to his agent — it's not retirement.\nWhile appearing on SiriusXM NBA Radio on Monday, Rich Paul gave an update on James' future plans, stating that he expects the 20-time All-Star to be in an NBA uniform next season. \n\"I think we do see him next year,\" Paul said. \"Now, how many more after that? I do not know. But I think he's got maybe two or three years left in the tank, maybe.\"\nJames and the Lakers' season is on the line as they face playoff elimination in a must-win Game 5 against the Denver Nuggets on Monday night.\nThe 39-year-old is currently the oldest active player in the league, and he has played 21 seasons since being drafted No. 1 by the Cleveland Cavaliers in 2003.\nJames has a $51.4 million player option for the 2024-25 season, which he could turn down to become a free agent.\nWhile Paul is confident James will come back for another season, he understands the end of his playing career is not far away, which the two have discussed.\n\"My conversation with him is ‘just have fun,’\" Paul said. \"'Just enjoy it because you've got a lot less years to play than you've already played. Just enjoy the ride.'\" \n[Want great stories delivered right to your inbox? Create or log in to your FOX Sports account, follow leagues, teams and players to receive a personalized newsletter daily.]\n", "description": "Will this be LeBron James' final season? His agent thinks not. \"I think he's got maybe two or three years left in the tank, maybe,\" he said.", "hero_img": "https://statics.foxsports.com/www.foxsports.com/content/uploads/2024/04/LeBron-James-H.jpg", "thumbnail": "https://a57.foxsports.com/statics.foxsports.com/www.foxsports.com/content/uploads/2024/04/128/72/LeBron-James-H.jpg", "category": "NBA", "date": "Mon, 29 Apr 2024 20:44:22 -0400", "comments": []}, {"title": "Bucks rule out Damian Lillard, Giannis Antetokounmpo for elimination Game 5", "url": "https://www.foxsports.com/stories/nba/bucks-rule-out-damian-lillard-giannis-antetokounmpo-for-elimination-game-5", "content": "Milwaukee's Giannis Antetokounmpo and Damian Lillard were unavailable again as the Bucks attempted to keep their season alive in Game 5 of their Eastern Conference first-round series with the Indiana Pacers on Tuesday night.\nAntetokounmpo is dealing with a strained left calf that has kept him out for the entire series. Lillard injured his Achilles tendon during the Bucks' 121-118 Game 3 loss on Friday.\nBucks coach Doc Rivers said before Tuesday's game that Antetokounmpo had done some shooting earlier in the day and that Lillard hadn't done anything. Both players had been listed as doubtful on the injury report leading up to Tuesday's game.\nThe Bucks headed into Tuesday's game trailing the best-of-seven series 3-1. Indiana was seeking to clinch its first playoff series victory since 2014, while Milwaukee was trying to avoid a second straight first-round exit.\nAntetokounmpo hasn't played since straining his left calf in an April 9 victory over the Boston Celtics. The two-time MVP was struggling to run up the court in the third quarter of that game when he grabbed his left calf and took a seat on the floor before eventually heading to the locker room. An MRI revealed the muscle strain.\nLillard twisted his left knee in the first quarter of Game 3, went to the locker room and returned to the game, then hurt his Achilles late in the fourth quarter. He didn't play in the Bucks' 126-113 Game 4 loss on Sunday.\nThe Bucks did have forward Khris Middleton and guard Patrick Beverley available for Tuesday's game. Both players were listed as probable on the injury report, as Middleton has a sprained right ankle and Beverley has a strained right oblique.\nReporting by The Associated Press.\n[Want great stories delivered right to your inbox? Create or log in to your FOX Sports account, follow leagues, teams and players to receive a personalized newsletter daily.]\n", "description": "Giannis Antetokounmpo and Damian Lillard were unavailable again as the Bucks attempted to keep their season alive in Game 5 of their Eastern Conference first-round series with the Indiana Pacers on Tuesday.", "hero_img": "https://statics.foxsports.com/www.foxsports.com/content/uploads/2024/04/lillard1.jpg", "thumbnail": "https://a57.foxsports.com/statics.foxsports.com/www.foxsports.com/content/uploads/2024/04/128/72/lillard1.jpg", "category": "NBA", "date": "Tue, 30 Apr 2024 20:34:52 -0400", "comments": []}, {"title": "Celtics' Kristaps Porzingis could miss 'several games' with strained right calf", "url": "https://www.foxsports.com/stories/nba/celtics-kristaps-porzingis-could-miss-several-games-with-strained-right-calf", "content": "Celtics center Kristaps Porzingis has been ruled out of Boston's potential series-clinching matchup against the Miami Heat with a strained right calf. Porzingis is expected to miss \"several games\" with the injury, according to a report from ESPN on Tuesday.\nPorzingis played only 14 minutes in Boston's 102-88 Game 4 win at Miami, leaving in the second quarter and finishing with seven points and three rebounds.\nVeteran Al Horford will likely replace Porzingis in the starting lineup for Wednesday's Game 5, with support off the bench from Luke Kornet.\nThe Celtics lead the Heat 3-1. The Boston-Miami winner will meet the Cleveland-Orlando winner in the Eastern Conference semifinals.\nAsked after Game 4 how Porzingis' potential absence could affect his team, Boston coach Joe Mazzulla said nothing would change.\n\"Bringing the same mindset, intentionality, toughness, details to the next game regardless of who's available,\" Mazzulla said. \"It doesn't matter. There's no difference between the regular season and the playoffs. And all year, we've had guys step in and play.\"\nThe Associated Press contributed to this report.\n[Want great stories delivered right to your inbox? Create or log in to your FOX Sports account, follow leagues, teams and players to receive a personalized newsletter daily.]\n", "description": "Celtics center Kristaps Porzingis has been ruled out of Boston's potential series-clinching matchup against the Miami Heat with a strained right calf.", "hero_img": "https://statics.foxsports.com/www.foxsports.com/content/uploads/2024/04/porzingis1.jpg", "thumbnail": "https://a57.foxsports.com/statics.foxsports.com/www.foxsports.com/content/uploads/2024/04/128/72/porzingis1.jpg", "category": "NBA", "date": "Tue, 30 Apr 2024 19:58:02 -0400", "comments": []}, {"title": "Kawhi Leonard ruled out for Clippers' pivotal Game 5 vs. Mavericks", "url": "https://www.foxsports.com/stories/nba/kawhi-leonard-ruled-out-for-clippers-pivotal-game-5-vs-mavericks", "content": "Kawhi Leonard will miss Game 5 of the Los Angeles Clippers' tight first-round series against the Dallas Mavericks on Wednesday night due to right knee inflammation.\nLeonard was ruled out by Clippers coach Tyronn Lue on Tuesday. The six-time All-Star will sit out for the third time in the series' five games.\nLeonard missed Game 1 and Game 4 of the series after missing the final eight games of the regular season with right knee pain. Leonard returned to play in the second and third games of the series, but managed just 24 points in the two games while failing to make a 3-pointer and generally not looking sharp.\nSurprisingly, the Clippers won both of the games that Leonard missed, while Dallas won both of the games in which Leonard played.\nLeonard averaged 23.7 points, 6.1 rebounds and 3.6 assists this season while playing in 68 games, his most since the 2016-17 season with San Antonio. Injuries have repeatedly slowed Leonard in the second half of his NBA career, and he has never played a full healthy season since joining the Clippers in 2019.\nHe missed the entire 2021-22 season after injuring his right knee during the 2021 playoffs and requiring major surgery. The Clippers advanced to their only Western Conference finals in franchise history that spring, but Leonard missed the entire season.\nReporting by The Associated Press.\n[Want great stories delivered right to your inbox? Create or log in to your FOX Sports account, follow leagues, teams and players to receive a personalized newsletter daily.]\n", "description": "The six-time All-Star will sit out for the third time in the series' five games against the Mavericks.", "hero_img": "https://statics.foxsports.com/www.foxsports.com/content/uploads/2024/04/Kawhi-leonard-H.jpg", "thumbnail": "https://a57.foxsports.com/statics.foxsports.com/www.foxsports.com/content/uploads/2024/04/128/72/Kawhi-leonard-H.jpg", "category": "NBA", "date": "Tue, 30 Apr 2024 18:36:29 -0400", "comments": []}, {"title": "Knicks reserve Bojan Bogdanovic will have foot surgery, miss rest of playoffs", "url": "https://www.foxsports.com/stories/nba/knicks-reserve-bojan-bogdanovic-will-have-foot-surgery-miss-rest-of-playoffs", "content": "New York Knicks swingman Bojan Bogdanovic will have surgery on his left foot and miss the rest of the playoffs.\nBogdanovic, who had played well off the bench to help the Knicks take a 3-1 lead over the Philadelphia 76ers, was hurt in Game 4 on Sunday when Nicolas Batum fell on his leg while they chased a loose ball.\nThe Knicks didn't specify the nature of the injury Tuesday or when Bogdanovic would have surgery. They said he would be evaluated again in three months.\nThe veteran from Croatia was acquired from Detroit in February at the trade deadline. He had 13 points in Game 1, with the Knicks outscoring the 76ers by 27 points while he was in the game.\nReporting by The Associated Press.\n", "description": "New York Knicks swingman Bojan Bogdanovic will have surgery on his left foot and miss the rest of the playoffs.", "hero_img": "https://statics.foxsports.com/www.foxsports.com/content/uploads/2024/04/8f5f1c6e-knicks1.jpg", "thumbnail": "https://a57.foxsports.com/statics.foxsports.com/www.foxsports.com/content/uploads/2024/04/128/72/8f5f1c6e-knicks1.jpg", "category": "NBA", "date": "Tue, 30 Apr 2024 18:06:40 -0400", "comments": []}, {"title": "What should LeBron James, Lakers do next after first-round exit?", "url": "https://www.foxsports.com/stories/nba/what-should-lebron-james-lakers-do-next-after-first-round-exit", "content": "LeBron James' NBA future is as uncertain as ever entering the 2024 season. \nThe NBA's all-time scoring leader declined to comment about his future following the Los Angeles Lakers' Game 5 loss to the Denver Nuggets on Monday, which ended their season in the first round.\n\"I don't have an answer ... to be honest. I haven't given it much thought,\" James told reporters when asked how he would handle his decision about playing in the 2024-25 season. James added that he'll have to discuss with his agent Rich Paul and his family what's best for him moving forward. Then he was asked if he had played his final game as a member of the Lakers.\n\"I'm not going to answer that,\" James said, ending his press conference on Monday after that question.\nThe 39-year-old James has a $51.4 million player option for next season which he'll have to make a decision on by June 29. That's part of the reason why it isn't a guarantee James will be back with the Lakers next season. He also contemplated retirement last offseason, and his eldest son, Bronny, has declared for the NBA Draft. LeBron has said in the past that playing with Bronny is one of the last things he wants to accomplish in his playing career.\nJames' comment following Monday's season-ending loss left FOX Sports' Keyshawn Johnson a little worried for the Lakers, asking at the start to not \"have us twiddling our thumbs\" to find out what he wants to do. However, Johnson also believes the Lakers should be cautious in how they approach the situation with James this offseason, believing they have to \"look at the big picture\" before making him a three-year, $164 million max offer.\n\"They've also got to look at where LeBron's at in his career; 21 seasons going on 22 to tie Vince Carter for the most seasons played in the NBA,\" Johnson said on Tuesday's \"Undisputed.\" \"Do you want to commit the type of dollars to someone who, I don't want to call him an aging star because he's still a superstar, but is getting older and there's a risk he can slow down?\"\nJohnson added that if the Lakers bring James back, they'll likely be starting \"all over again,\" as reports suggest Darvin Ham will be ousted as their head coach. \nStill, Johnson would still like to see James and Anthony Davis remain in Tinseltown. Paul Pierce thinks that will be the case. \n\"He'll be back,\" Pierce said. \"If the Lakers are smart, they'll give him a new three-year deal. He's still playing at a high level. His family uprooted here. His businesses are here. Will he entertain going somewhere else? I don't think so. If he goes to, let's say, Golden State or Cleveland, I just think that would be a little smear on his legacy if he tried to form another super-team and teamed up with Steph Curry or brought Kevin Durant over here.\"\nSkip Bayless agreed with Pierce, saying it's \"much ado about nothing\" due to the James family embracing Los Angeles as their home since he signed with the team in 2018. He also believes the Lakers will do their part to make sure that James doesn't leave Los Angeles this summer. \n\"His son is going to be a Laker,\" Bayless said. \"I'll bet you on it because Klutch (the agency that represents James) will make it happen. Klutch will send out the message, ‘Don't draft this kid because he's going to be a Laker.' I don't think the Lakers are going to have to even spend a draft pick or Bronny.\"\nThe Lakers seem to be willing to grant James that opportunity. They're open to offering a deal, including the max offer, to bring James back and drafting his son, The Athletic reported. After James had another All-Star season averaging 25.7 points per game, Bayless believes that James has \"earned that right\" to receive a max contract offer and for the Lakers to give him the opportunity to play with his son. \n\"He's earned that money because he's not only the face of this franchise, but he's still the face of this league,\" Bayless said. \"Did you see any drop-off in his game? I saw none. Can he lift like he used to? No, he can't. But is he at least as effective as he used to be? Sure, he is. Do you think he can do it again next year or there's a danger that he'll hit the wall next year? I don't think so. He's too smart about what to do in the offseason with his body.\"\nIf those shoes drop for the Lakers, Pierce has an ideal trade target for them this offseason.\n\"Donovan Mitchell would be the perfect fit,\" Pierce said. \"He's not looking for an extension with Cleveland. With the way this series is going against Orlando and they lose in the first round, they'll trade him because he's not going to sign an extension.  \n\"Now, you have a young Donovan Mitchell you can play with Anthony Davis, who needs to be a No. 2. He's clearly a No. 2 on a championship team. Mitchell would take so much pressure off of LeBron if you give him three years. Now, you're window is back open.\"\n", "description": "LeBron James' future is in question entering the 2024 offseason. Paul Pierce expects him to remain with the Lakers and dishes out an ideal trade target.", "hero_img": "https://statics.foxsports.com/www.foxsports.com/content/uploads/2024/04/LeBron.jpg", "thumbnail": "https://a57.foxsports.com/statics.foxsports.com/www.foxsports.com/content/uploads/2024/04/128/72/LeBron.jpg", "category": "NBA", "date": "Tue, 30 Apr 2024 12:02:44 -0400", "comments": []}, {"title": "Tyrese Maxey saves Sixers from elimination with huge finish in OT win that cuts Knicks' lead to 3-2", "url": "https://www.foxsports.com/stories/nba/tyrese-maxey-saves-sixers-from-elimination-with-huge-finish-in-ot-win-that-cuts-knicks-lead-to-32", "content": "Tyrese Maxey saved Philadelphia from elimination with seven points in the final 25 seconds of regulation, finished with 46 and led the 76ers to a 112-106 overtime victory over the New York Knicks on Tuesday night in Game 5 of their first-round series.\nThe 76ers trailed by six points with 28 seconds left in regulation before Maxey pulled out a comeback that evoked memories of Reggie Miller's eight points in nine seconds for Indiana at Madison Square Garden in 1995.\nThe All-Star guard converted a four-point play with 25 seconds remaining to cut it to two, and after Josh Hart's free throw, pulled up from 35 feet to tie it at 97 with 8.1 seconds left in front of a stunned crowd that was set to celebrate the Knicks' second straight trip to the Eastern Conference semifinals.\nJoel Embiid finished with 19 points, 16 rebounds and 10 assists for the 76ers, who will host Game 6 on Thursday night.\nJalen Brunson scored 40 points for the Knicks, who were thinking about a possible Game 1 of the second round at MSG on Saturday night. Instead, it could be Game 7 of this series, which seemed all but over.\nReporting by The Associated Press.\n[Want great stories delivered right to your inbox? Create or log in to your FOX Sports account, follow leagues, teams and players to receive a personalized newsletter daily.]\n", "description": "Tyrese Maxey saved Philadelphia from elimination with 46 points as he led the 76ers to a 112-106 overtime victory over the New York Knicks.", "hero_img": "https://statics.foxsports.com/www.foxsports.com/content/uploads/2024/04/tymaxey2.jpg", "thumbnail": "https://a57.foxsports.com/statics.foxsports.com/www.foxsports.com/content/uploads/2024/04/128/72/tymaxey2.jpg", "category": "NBA", "date": "Tue, 30 Apr 2024 22:27:43 -0400", "comments": []}, {"title": "Why the Knicks are a good fit for LeBron James if he leaves the Lakers", "url": "https://www.foxsports.com/stories/nba/why-the-knicks-are-a-good-fit-for-lebron-james-if-he-leaves-the-lakers", "content": "LeBron James was not willing to discuss his future following the Los Angeles Lakers' Game 5 defeat to the Denver Nuggets on Monday night, which ended their season. And that doesn't come as much of a surprise.\n\"The King\", who's been known to have an affinity for suspense, was fresh off a 30-point, 11-rebound, nine-assist performance that was made null by a soul-crunching game-winner from Jamal Murray. It's understandable that his gaze was not pointed towards future endeavors.\nBut that's not stopping the basketball world from pondering what's next for James. \"First Things First's\" Nick Wright had some ideas for a new destination that he felt would benefit James from both a basketball perspective, and a legacy one: the New York Knicks.\n\"From a trade perspective, a basketball fit perspective … and it is the best storyline perspective, the New York Knicks,\" Wright said Tuesday on the show. \"That team has not won a championship in 51 years, they have not been to the Finals in 25 years. They have a legitimately excellent team right now that I think –- with respect to the Knicks and what they're building – is not quite championship caliber right now. … They have the assets, I think they have a need a power forward right now because I don't trust Julius Randle come the postseason. … For the first time, the Knicks are, basketball-wise an attractive option for anybody.\"\nFor Wright, James' ability to impact winning at a championship level is not up for debate.\n\"There's no question,\" Wright said, \"LeBron does not impact winning as much as younger LeBron, or peak LeBron. But let's ask it in a different way. How many guys in the league right now impact winning more than LeBron James? … What do I want LeBron to do next? I'd like him to come to the Knicks. Yes that's a little selfish cause I live here. It also would be an unbelievable final act. … That's where he could win a championship, he would help get them over the top, it's an iconic franchise, and it would truly add to his legend.\"\nBut Wright was not completely one-track minded in his thinking. He laid out other viable options for James if he decides to depart from L.A.\n\"The Sixers,\" he said, \"who have a ton of cap space, make sense. The Cavs are an interesting one, they could make sense. But what do I think is gonna happen? I think he's gonna stay with the Lakers. I think he's going to leverage his spot with the Lakers to get them to draft Bronny in the second round, to get a three-year full max with a no-trade clause, and see if they can make a few moves, and he can stay at this level, and they can be back in it again.\"\nAnd in case James needed any extra incentivization to join New York, Wright asserted that it'd help his standing in the GOAT debate.\n\"By they way, [you could] get all those Knicks fans that never liked Jordan to begin with on your side in the GOAT debate. That's like an electoral college thing, it's like flipping Texas. All of a sudden, the math is different forever.\"\n", "description": "Could LeBron James the missing piece for the up-and-coming New York Knicks?", "hero_img": "https://statics.foxsports.com/www.foxsports.com/content/uploads/2024/04/ljames2.jpg", "thumbnail": "https://a57.foxsports.com/statics.foxsports.com/www.foxsports.com/content/uploads/2024/04/128/72/ljames2.jpg", "category": "NBA", "date": "Tue, 30 Apr 2024 22:08:09 -0400", "comments": []}, {"title": "LeBron James addresses retirement rumors: 'I do not know yet'", "url": "https://www.foxsports.com/stories/nba/lebron-james-addresses-retirement-rumors-i-do-not-know-yet", "content": "When the Denver Nuggets eliminated the Los Angeles Lakers in the first round of the NBA Playoffs on Monday, the attention immediately shifted to LeBron James, the league's all-time leading scorer and the face of the league.\nJames, 39, has a player option worth $51.4 million that he can exercise this summer, or he can decline it to become an unrestricted free agent. There's also the possibility that James retires after 21 seasons, one that has grown more likely in recent years. James will be 40 years old in December.\nIn other words, James' future is in his hands, and no one knows what he's going to do — not even him.\nIn a post on X (formerly Twitter) on Tuesday, James addressed the rumors about his future by saying he hasn't made up his mind yet, and hinted that his decision won't be made any time soon.\nJames averaged 25.7 points, 8.3 assists, 7.3 rebounds and 1.3 steals in 71 games with the Lakers this past season. He'll join Team USA at the summer Olympic Games in Paris this summer along with Steph Curry, Kevin Durant and Anthony Davis.\n[Want great stories delivered right to your inbox? Create or log in to your FOX Sports account, follow leagues, teams and players to receive a personalized newsletter daily.]\n", "description": "LeBron James addressed recent rumors about his NBA future in a post on social media, saying he hasn't made a decision yet.", "hero_img": "https://statics.foxsports.com/www.foxsports.com/content/uploads/2024/04/LeBron1-1.jpg", "thumbnail": "https://a57.foxsports.com/statics.foxsports.com/www.foxsports.com/content/uploads/2024/04/128/72/LeBron1-1.jpg", "category": "NBA", "date": "Tue, 30 Apr 2024 21:52:50 -0400", "comments": []}, {"title": "Bucks avoid elimination with Damian Lillard, Giannis Antetokounmpo sidelined", "url": "https://www.foxsports.com/stories/nba/bucks-avoid-elimination-with-damian-lillard-giannis-antetokounmpo-sidelined", "content": "Khris Middleton and Bobby Portis each scored 29 points and the short-handed Milwaukee Bucks kept their season alive by routing the Indiana Pacers 115-92 in Game 5 of their Eastern Conference first-round playoff series on Tuesday night.\nPortis had the highest point total of his playoff career and added 10 rebounds to make amends two nights after he got ejected from a Game 4 loss. Middleton had his third straight game with at least 25 points, and he also contributed 12 rebounds and five assists.\nThe Pacers still lead the best-of-seven series 3-2 heading into Game 6 on Thursday in Indianapolis. The Pacers are trying to advance beyond the opening round for the first time since 2014.\nMilwaukee, which has never won a series in which it 3-1, made sure the Pacers wouldn't clinch anything Tuesday. The Bucks held Indiana to its lowest point total of the season and won without injured stars Giannis Antetokounmpo and Damian Lillard as the Fiserv Forum crowd chanted \"Bucks In Seven.\"\nAntetokounmpo has missed this entire series and hasn't played since straining his left calf on April 9. Lillard sat out a second straight game after injuring his Achilles tendon in the Bucks' 121-118 Game 3 loss on Friday.\nThe Bucks won anyway, thanks to a balanced effort.\nMalik Beasley scored 18 points. Pat Beverley had 13 points and 12 assists, and sparked a second-quarter run that put the Bucks ahead for good.\nTyrese Haliburton scored 16 points to lead the Pacers. Myles Turner added 13. Obi Toppin, Aaron Nembhard and Pascal Siakam had 12 each.\nTwo nights after shooting 22 of 43 from 3-point range in Game 3, the Pacers went 7 of 12 from beyond the arc in the first 10 minutes and led 31-21 late in the first quarter.\nBut the Bucks responded with an 18-2 run as Beverley continually irritated the Pacers — to the delight of the crowd.\nShortly after a Middleton 3-pointer put the Bucks ahead for good, Toppin was called for traveling in front of Milwaukee's bench. As Beverley tried to grab the ball from him, Toppin shoved the Bucks guard and drew a technical foul.\nOn the Bucks' ensuing possession, Beverley hit a short jumper while getting fouled by Haliburton. Beverley did a particularly showy version of the \"Too Small\" taunting gesture before sinking his free throw to complete a three-point play that gave Milwaukee a 39-33 lead.\nBeverley scored 12 points in the second quarter, helping the Bucks build a 53-48 lead at the half. The Bucks then scored the first nine points of the third period to make it 62-48.\nIndiana got the margin down to nine midway through the third, but the Bucks outscored the Pacers 20-8 over the next 5½ minutes to put the game away.\nReporting by The Associated Press.\n[Want great stories delivered right to your inbox? Create or log in to your FOX Sports account, follow leagues, teams and players to receive a personalized newsletter daily.]\n", "description": "The Bucks held Indiana to its lowest point total of the season and won without injured stars Giannis Antetokounmpo and Damian Lillard as the Fiserv Forum crowd chanted “Bucks In Seven.\"", "hero_img": "https://statics.foxsports.com/www.foxsports.com/content/uploads/2024/05/bucks1.jpg", "thumbnail": "https://a57.foxsports.com/statics.foxsports.com/www.foxsports.com/content/uploads/2024/05/128/72/bucks1.jpg", "category": "NBA", "date": "Wed, 01 May 2024 00:40:30 -0400", "comments": []}, {"title": "Donovan Mitchell scores 28 as Cavaliers hold off Magic 104-103 in Game 5", "url": "https://www.foxsports.com/stories/nba/donovan-mitchell-scores-28-as-cavaliers-hold-off-magic-104-103-in-game-5", "content": "Donovan Mitchell scored 28 points, Evan Mobley blocked Franz Wagner's layup in the final seconds and the Cleveland Cavaliers survived a scare from Orlando, holding off Paolo Banchero and the Magic 104-103 in Game 5 on Tuesday night to take a 3-2 lead in their Eastern Conference series.\nThe Cavs, who were embarrassed by the Magic while dropping two games in Orlando last week, regrouped inside the roaring Rocket Mortgage FieldHouse.\nIt took everything they had.\nAfter Mitchell missed a jumper with 15.7 seconds left, Wagner drove the left side for a potential game-tying layup but was denied at the rim with 6 seconds left by Mobley, who smacked the ball off the backboard.\nMitchell was fouled and made two free throws with 3.2 seconds remaining to make it 104-100. There wasn't enough time for the Magic, who got a 3-pointer in the final second from Banchero, giving him 39 points.\nPlaying in just his fifth postseason game, the 21-year-old Banchero looked like a savvy veteran. He scored 16 points in the fourth and finished 14 of 24 from the field (4 of 7 on 3s) and added eight rebounds.\nMissing starting center Jarrett Allen with a bruised rib, Cleveland got a big lift from Max Strus, who scored 16 in his best game in the back-and-forth series. Mobley added 14 points and 13 rebounds and reserve Marcus Morris Sr. gave Cleveland toughness and 12 points.\nThe Cavs, who spent the season trying to put last year's first-round flameout against New York behind them, can advance with a win in Game 6 on Friday in Orlando.\nThe Magic need a win to salvage their breakthrough season and force a Game 7 in Cleveland on Sunday. Orlando went 29-12 in the regular season at home and are coming off decisive wins at Kia Center.\nMitchell, who has been slowed by a left knee injury, scored 14 in the fourth — going 9 of 10 at the line.\nWith Banchero leading the way, the Magic, who trailed 2-0 before twice winning big at home, stared down the Cavs and a hostile, towel-waving Cleveland crowd and were poised to pull off their first playoff road win since 2019 at Toronto.\nBut Mitchell, Garland and Mobley wouldn't be denied and the Cavs, who are 16-0 when leading 2-0 in a series, took care of business at home for the third time.\nThe Cavaliers were short-handed as Allen, who has arguably been their best player in this back-and-forth series, sat out with what the team said was a bruised rib.\nAllen, who is averaging 17.0 points and 13.8 rebounds, took an elbow to the ribs in the second half of Game 4 on Saturday. He practiced Monday but was added to the injury report before being ruled out.\nWith Allen out, coach J.B. Bickerstaff went with a smaller first five and started Isaac Okoro.\nBickerstaff has been criticized for a lack of adjustments. But he also went deeper into his bench right away, bringing in guard Sam Merrill and both Tristan Thompson and Morris, who had only played garbage time in the Orlando blowouts.\nGarland played with more aggression and erupted for 17 points in the first quarter — more than he scored in any game in the series. He made two 3-pointers and Caris LeVert added another as the Cavs scored nine points in the final 1:04 to take a 10-point lead after one.\nBut the Magic outscored the Cavs 24-15 in the second quarter to pull within one at half.\nReporting by The Associated Press.\n[Want great stories delivered right to your inbox? Create or log in to your FOX Sports account, follow leagues, teams and players to receive a personalized newsletter daily.]\n", "description": "Donovan Mitchell led the Cavaliers to a one-point Game 5 victory over the Magic on Tuesday.", "hero_img": "https://statics.foxsports.com/www.foxsports.com/content/uploads/2024/04/Donovan-Mitchell-H.jpg", "thumbnail": "https://a57.foxsports.com/statics.foxsports.com/www.foxsports.com/content/uploads/2024/04/128/72/Donovan-Mitchell-H.jpg", "category": "NBA", "date": "Tue, 30 Apr 2024 23:55:06 -0400", "comments": []}, {"title": "Celtics thump shorthanded Heat 118-84, advance to Eastern Conference Semifinals", "url": "https://www.foxsports.com/stories/nba/celtics-advance-to-east-semifinals-beating-shorthanded-heat-11884-in-game-5", "content": "Jaylen Brown and Derrick White each scored 25 points and the Boston Celtics advanced to the Eastern Conference semifinals, beating the shorthanded Miami Heat 118-84 in Game 5 on Wednesday night.\nBoston will face the winner of the Cleveland Cavaliers-Orlando Magic series. The Cavaliers lead 3-2, with Game 6 in Orlando on Friday night.\nBrown also had six assists, and White hit five 3-pointers. Sam Hauser added 17 points and Jayson Tatum had 16 points and 12 rebounds, The top-seeded Celtics never trailed and led by 35 points. They also got a measure of revenge a year after the Heat routed them in Game 7 of the conference finals in Boston.\nBam Adebayo scored 23 points and Tyler Herro had 15 for Miami, which made its first exit from the playoffs prior to the conference finals since 2021. The Heat struggled throughout, going 3 of 29 from 3-point range.\nBoston played for the first time this postseason without center Kristaps Porzingis after he strained his right calf in the Celtics' Game 4 victory. His teammates filled in the gaps, as the Celtics' lead reached 30 points in the first half.\nBoston exploited a Heat team that was the most injured it'd been in the series. Jaime Jaquez Jr. sat out after suffering a hip injury in Game 4. He was replaced in the lineup by Delon Wright, marking the 37th starting five the Heat used this season. Jaquez joined Jimmy Butler (knee) and Terry Rozier (neck), who had both been sidelined since the start of the series.\nIt made for unique rotations for Miami, which included veteran Patty Mills logging minutes for just the third time in the series.\n[Want great stories delivered right to your inbox? Create or log in to your FOX Sports account, follow leagues, teams and players to receive a personalized newsletter daily.]\nBoston seized on the vulnerabilities in the Heat's defense, spreading them out and knocking down eight 3-pointers in the opening period. It helped the Celtics carry an 18-point lead into the second quarter.\nThe highlight of the opening 12 minutes came courtesy of White, who pulverized Miami from long distance with eight 3s in Game 4. He stayed on the attack early Wednesday, faking a 3-point attempt and then driving in for an uncontested one-handed dunk.\nWhite played to the home crowd afterward, holding his hand in front of his face as he backpedaled up the court. After the Heat called a timeout, a courtside fan near the Celtics' bench could be seen pantomiming fanning White on the sideline.\nReporting by The Associated Press.\n", "description": "Jaylen Brown and Derrick White each scored 25 points and the Boston Celtics advanced to the Eastern Conference semifinals, beating the short-handed Miami Heat 118-84 in Game 5 on Wednesday night.", "hero_img": "https://statics.foxsports.com/www.foxsports.com/content/uploads/2024/05/JaylenBrown.jpg", "thumbnail": "https://a57.foxsports.com/statics.foxsports.com/www.foxsports.com/content/uploads/2024/05/128/72/JaylenBrown.jpg", "category": "NBA", "date": "Wed, 01 May 2024 22:20:25 -0400", "comments": []}, {"title": "Suns owner Mat Ishbia says franchise doing 'excellent,' expects starters to stay put", "url": "https://www.foxsports.com/stories/nba/suns-owner-mat-ishbia-says-franchise-is-doing-excellent-hes-quiet-on-coach-frank-vogels-future", "content": "Mat Ishbia knows the offseason chatter around the Phoenix Suns is it's a team with a top-heavy roster, salary cap issues and precious little room to maneuver after a disappointing season.\nThe second-year owner doesn't believe it.\n\"The narrative that the house is burning is incorrect,\" Ishbia said. \"The Phoenix Suns are doing great. Excellent. Not as good as we want to be. Not as good as we're going to do next year. And that's what we're going to figure out — what we've got to tweak, modify and adjust to win a championship next year.\"\nIshbia and Suns general manager James Jones talked with the media on Wednesday, three days after their team was swept out of the playoffs in the first round by the Minnesota Timberwolves. It was a weak performance by a franchise that had championship aspirations after assembling the All-Star trio of Devin Booker, Kevin Durant and Bradley Beal.\nIshbia — who splits his time between Michigan and Arizona — is back in the desert to do exit interviews and plot out the direction of the franchise for next season.\nThat includes deciding whether coach Frank Vogel will return for a second season.\nIshbia said he didn't want to get into Vogel's performance because he hadn't talked with him yet, but mentioned several times he'd like to maintain continuity.\nJones supported his coach.\n\"I thought Frank did a great job given the circumstances,\" Jones said. \"We assembled a really talented team, primarily three scorers. Whenever you try to get guys to adjust and adapt their games, there's a transition time. It's sometimes a struggle, but I thought he did a great job this year.\"\nVogel had a tough assignment thanks to questionable roster construction. The Suns didn't have a true point guard — asking Booker and Beal to share that responsibility — and struggled all year with turnovers. They also had a thin bench.\nJones said the team would be open to adding more ballhandlers for next season, but it's got to be the right fit.\n\"Sure, that's great, but who do you want? Who is available given the way we're built?\" Jones said. \"Who can fit with this group? Whose game seamlessly fits with this group?\"\nThe Suns' projected starting five for next season is under contract with Booker, Beal, Durant, center Jusuf Nurkic and guard Grayson Allen. Allen led the league in 3-point shooting percentage this season and averaged a career-high 13.8 points per game, but he suffered a sprained ankle in Game 1 against the Wolves and wasn't able to contribute much.\nIshbia said he expects all five starters back next season.\n[Want great stories delivered right to your inbox? Create or log in to your FOX Sports account, follow leagues, teams and players to receive a personalized newsletter daily.]\nThe 35-year-old Durant continued to defy age with another stellar season, averaging more than 27 points per game and playing in 75 of 82 games. He's one of the most prolific scorers in NBA history, but it's also fair to wonder how long he can play at this level.\nBooker and Durant are among the 12 players who will represent the U.S. in the Paris Olympics this summer.\nBooker — who Ishbia called the ‘face of the franchise' on Wednesday — averaged 27 points per game and made his fourth All-Star appearance.\n\"I think, over time, experience is the best teacher,\" he said after Sunday's loss. \"The more you can spend time and feel this hurt together, go through it together, the better off you are in the future.\"\nReporting by The Associated Press.\n", "description": "Mat Ishbia knows the offseason chatter around the Phoenix Suns is it’s a team with a top-heavy roster, salary cap issues and precious little room to maneuver after a disappointing season.", "hero_img": "https://statics.foxsports.com/www.foxsports.com/content/uploads/2024/05/Suns20241.jpg", "thumbnail": "https://a57.foxsports.com/statics.foxsports.com/www.foxsports.com/content/uploads/2024/05/128/72/Suns20241.jpg", "category": "NBA", "date": "Wed, 01 May 2024 20:36:47 -0400", "comments": []}, {"title": "Jayson Tatum not bothered by Jason Kidd calling Jaylen Brown Celtics' best player", "url": "https://www.foxsports.com/stories/nba/jayson-tatum-bothered-jason-kidd-calling-jaylen-brown-celtics-best-player", "content": "Jason Kidd couldn't figure out how to stop the Boston Celtics in Game 1 of the NBA Finals.\nNow he's hoping they will get in their own way.\nThe Mavericks coach seemed eager to sow dissension in the Boston locker room on Saturday when he singled out Jaylen Brown as the Celtics' best player — words transparently designed to irk Jayson Tatum, an actual NBA first-teamer who was sixth in the voting for the league's MVP.\nAsked during his off-day media availability about a game-plan to defend Brown, Kidd said, \"Well, Jaylen's their best player …\" prompting reporters to perk up and wonder: Did he really say that? (It was the final question of his news conference, so there was no follow-up.)\nTatum said it won't work.\n\"We understand that people try to drive a wedge between us. I guess it's a smart thing to do — or try to do,\" Tatum said. \"We've been in this position for many years, of guys trying to divide us and say that one of us should be traded, or one is better than the other. So it's not our first time at the rodeo.\"\nOn that, Brown agreed completely.\n\"We've been just extremely focused on what our roles and our jobs are. We have all had to sacrifice,\" he said. \"Right now, at this point, it's whatever it takes to win. And we can't let any outside interpretations try to get in between us.\"\n[Related: 2024 NBA Finals MVP odds: Jayson Tatum favored; Jaylen Brown closing in]\nDrafted third overall in back-to-back years, Brown and Tatum have emerged as one of the NBA's best duos, combining to lead the Celtics to the Eastern Conference finals five times in their seven seasons together. But even with the success — 64 wins this year, the league's No. 1 overall seed, and a second trip to the NBA Finals — they have had to combat speculation that there wasn't room in the locker room for both of them.\nAlthough Tatum's career numbers have been better, Brown is the highest-paid player in the league — a quirk of timing and age that gave him the first shot at a supermax contract extension that will earn him more than $300 million over five years. Brown also outplayed Tatum in the 2022 NBA Finals, was the MVP of this year's conference finals and outscored Tatum 22-16 in the Game 1 victory over Dallas on Thursday night.\nThat may explain why Kidd said on Saturday — twice — that Brown was Boston's main threat.\n\"Jaylen's their best player,\" the Mavericks coach said. \"He did everything, and that's what your best player does. Just understanding how to play both sides — defense and offense at a high rate — he's been doing that the whole playoffs.\"\nBut no one else seems to think so.\nTatum averaged 27 points, eight rebounds and five assists this season, and Brown averaged 23, 5.5 and 3.6. And even with Brown outscoring him in Game 1, Tatum's numbers are also better in the playoffs so far. (And besides: The real star of the opener was Boston big man Kristaps Porzingis.)\nCeltics coach Joe Mazzulla said he's not worried about internal rivalries getting in his team's way, as long as his players \"focus on the truth.\"\n\"What goes on in our locker room, how we communicate with each other, how we build relationships with each other and how we treat each other on and off the floor, that's the most important thing,\" he said.\nThe Mavericks have their own Big Two, with five-time All-NBA first-team guard Luka Doncic teaming up with Kyrie Irving to form an All-Star backcourt. Irving, who teamed with LeBron James to win the 2016 NBA championship in Cleveland even as they struggled to co-exist, said he tries not to pay attention to talk pitting him against his teammate.\n\"I'm just here to play basketball,\" Irving said. \"You've got to be selfless in your approach. Obviously, you're not going to get it right all the time, but as a teammate, you just want to push those other things to the side that don't really matter or get you better as a team. So we just leave it to everybody else to argue whose team it is and who has the most responsibility. It's all our jobs to be prepared.\"\nReporting by The Associated Press.\n", "description": "Boston Celtics stars Jaylen Brown and Jayson Tatum won't let the Dallas Mavericks \"drive a wedge\" between them during the NBA Finals.", "hero_img": "https://statics.foxsports.com/www.foxsports.com/content/uploads/2024/06/e73e4626-celtics1.jpg", "thumbnail": "https://a57.foxsports.com/statics.foxsports.com/www.foxsports.com/content/uploads/2024/06/128/72/e73e4626-celtics1.jpg", "category": "NBA", "date": "Sat, 08 Jun 2024 17:42:15 -0400", "date-upload": "2024-06-08 17:43:20", "comments": []}]