[{"title": "Tom Brady to be roasted by former teammates, comedians in upcoming Netflix special", "url": "https://www.foxsports.com/stories/nfl/tom-brady-roast-former-teammates-comedians-netflix-special-new-england-patriots", "content": "Prepare to be roasted, Tom Brady.\nThe GOAT is set to star in an upcoming Netflix special that will premier live on May 5. But this won't be the usual starring role Brady is accustomed to.\nBrady, who's used to receiving deep praise and adulation from his peers, will transform into the butt of several jokes and jabs from his former teammates. That group includes Pro Football Hall of Famer Randy Moss, his former backup QB Drew Bledsoe, and his future FOX Sports teammates Julian Edelman and Rob Gronkowski (Brady is set to join the network for the 2024 season). The title of the program: \"The Greatest Roast of All Time: Tom Brady.\"\nThe special, abbreviated as \"GROAT,\" will be hosted by Kevin Hart and will feature fellow comedian Jeff Ross. It goes live Sunday at 8 p.m. ET. And for those wondering if his former coach Bill Belichick will be part of the festivities, that answer is yes. Ben Affleck is listed as probable for the outing, per NFL Network. \n[Want great stories delivered right to your inbox? Create or log in to your FOX Sports account, follow leagues, teams and players to receive a personalized newsletter daily.]\n", "description": "Tom Brady will be roasted by several celebrities in a live Netflix special that will air Sunday, May 5.", "hero_img": "https://statics.foxsports.com/www.foxsports.com/content/uploads/2024/04/tobrady.jpg", "thumbnail": "https://a57.foxsports.com/statics.foxsports.com/www.foxsports.com/content/uploads/2024/04/128/72/tobrady.jpg", "category": "NFL", "date": "Mon, 29 Apr 2024 14:56:47 -0400", "comments": []}, {"title": "Patriots' Christian Barmore reportedly agrees to 4-year extension worth up to $92 million", "url": "https://www.foxsports.com/stories/nfl/patriots-christian-barmore-reportedly-agrees-to-4-year-extension-worth-up-to-92-million", "content": "New England Patriots defensive tackle Christian Barmore has agreed to a four-year contract extension worth up to $92 million, according to multiple reports. The news was first reported by the Boston Herald.\nBarmore, a second-round pick in 2021, has 133 tackles, 12 1/2 sacks and 18 tackles for loss, 32 quarterback hits and one forced fumble in 44 games (11 starts) over his three seasons. He twice appeared in all 17 games in 2021 and 2023.\nBarmore's agent, Nicole Lynn of Klutch Sports, celebrated the new pact on the X social media platform, referencing the extended wait her client endured on draft night.\nBarmore's signing becomes the latest big retention for a defense that also had the offseason re-signings of safety Kyle Dugger and edge rushers Josh Uche and Anfernee Jennings.\n[Want great stories delivered right to your inbox? Create or log in to your FOX Sports account, follow leagues, teams and players to receive a personalized newsletter daily.]\nReporting by The Associated Press.\n", "description": "New England Patriots defensive tackle Christian Barmore has reportedly agreed to a four-year contract extension with the team worth up to $92 million.", "hero_img": "https://statics.foxsports.com/www.foxsports.com/content/uploads/2024/04/ChristianBarmore.jpg", "thumbnail": "https://a57.foxsports.com/statics.foxsports.com/www.foxsports.com/content/uploads/2024/04/128/72/ChristianBarmore.jpg", "category": "NFL", "date": "Mon, 29 Apr 2024 12:42:52 -0400", "comments": []}, {"title": "Five-time Pro Bowler Jarvis Landry to join Jaguars' rookie camp", "url": "https://www.foxsports.com/stories/nfl/five-time-pro-bowler-jarvis-landry-to-join-jaguars-rookie-camp", "content": "Five-time Pro Bowl receiver Jarvis Landry is trying to get back in the league after sitting out last season.\nThe 31-year-old Landry will take part in Jacksonville's rookie minicamp May 10-11, a chance to prove he's fully healthy following a nagging ankle injury in 2022.\nLandry has played nine NFL seasons, including four in Miami and four in Cleveland. He signed a one-year, $3 million deal with his hometown New Orleans Saints in 2022 but finished with 25 receptions for 272 yards and a touchdown — all career lows. He missed eight games and landed on injured reserve that December.\n\"I don't have a price, I just want an opportunity to EARN my value on a team that recognizes it and wants to win a CHAMPIONSHIP!!!\" Landry posted on X, the social media platform formerly known as Twitter, last month.\nHe has since posted workout videos showing him running routes and catching passes.\nLandry has 713 career catches for 7,870 yards and 38 touchdowns. He made five consecutive Pro Bowls beginning in 2015, the first three with the Dolphins and the last two with the Browns.\nIf the Jaguars decide to sign him, he would give them another veteran in a receiving corps that features Christian Kirk and free-agent addition Gabe Davis.\nJacksonville selected LSU's Brian Thomas Jr. with the 23rd pick in last week's NFL draft. Landry also played at LSU and is one of several standout pros from the Southeastern Conference power, a list topped by Odell Beckham Jr., Ja'Marr Chase and Justin Jefferson.\nLandry could be a potential upgrade from Zay Jones, who missed eight games last season while dealing with hamstring and knee injuries. Jones is scheduled to count $10.7 million against the team's salary cap in 2024, a significant payout for a guy expected to be a No. 4 receiver at best.\nReporting by The Associated Press.\n", "description": "Jarvis Landry, 31, will take part in Jacksonville's rookie minicamp in May, a chance to prove he's fully healthy following a nagging ankle injury in 2022.", "hero_img": "https://statics.foxsports.com/www.foxsports.com/content/uploads/2024/04/landry-wide-042924.jpg", "thumbnail": "https://a57.foxsports.com/statics.foxsports.com/www.foxsports.com/content/uploads/2024/04/128/72/landry-wide-042924.jpg", "category": "NFL", "date": "Mon, 29 Apr 2024 12:33:03 -0400", "comments": []}, {"title": "Travis Kelce reportedly becomes NFL’s highest-paid TE in new Chiefs deal", "url": "https://www.foxsports.com/stories/nfl/travis-kelce-reportedly-becomes-nfls-highest-paid-te-in-new-chiefs-deal", "content": "There's no Tortured Tight Ends Department in Kansas City, as Travis Kelce is going to remain with the team that drafted him for much longer than a fortnight.\nFresh off his third Super Bowl title (and second in as many years) with the team, the nine-time Pro Bowler has agreed to a two-year extension with the Chiefs, NFL Media first reported. \nThe new contract reportedly makes Kelce the highest-paid tight end in the league.\nStar quarterback Patrick Mahomes reacted to the news on social media, saying his prophecy about Kelce staying with the Chiefs for the forseeable future came true.\nKelce struggled at times throughout the 2023 season, snapping a streak during which he had been named a first- or second-team All-Pro in seven straight seasons. Kelce ended the season, however, making 32 catches for 355 yards and three touchdowns over four postseason games, helping the Chiefs win another Lombardi Trophy. \nThis offseason, Kelce and his girlfriend, pop star Taylor Swift, have been seen hanging out together publicly several times, displaying their special alchemy most recently at Mahomes' charity gala in Las Vegas last weekend.\nAs Kelce signs on for two more NFL seasons, his brother, longtime Philadelphia Eagles offensive lineman Jason Kelce, retired from the league and will reportedly join ESPN as a \"Monday Night Football\" pregame analyst. \nThe Chiefs will open the 2024 NFL season on Sept. 5 at Arrowhead Stadium. At FanDuel Sportsbook, Kelce & Co. are the early favorites to win the AFC West (-230) and the AFC title (+370). They have the second-shortest odds to win Super Bowl LIX (+550).\nKansas City's Over/Under win total is set at 11.5.\n[Want great stories delivered right to your inbox? Create or log in to your FOX Sports account, follow leagues, teams and players to receive a personalized newsletter daily.]\n", "description": "There's no Tortured Tight Ends Department in Kansas City, as Travis Kelce has agreed to a new deal that makes him the NFL's highest-paid TE.", "hero_img": "https://statics.foxsports.com/www.foxsports.com/content/uploads/2024/04/KelceLombardi.jpg", "thumbnail": "https://a57.foxsports.com/statics.foxsports.com/www.foxsports.com/content/uploads/2024/04/128/72/KelceLombardi.jpg", "category": "NFL", "date": "Mon, 29 Apr 2024 15:53:17 -0400", "comments": []}, {"title": "Zeke is back in Dallas, but Cowboys' running back problem hasn't gone away", "url": "https://www.foxsports.com/stories/nfl/zeke-is-back-in-dallas-but-the-cowboys-running-back-problem-hasnt-gone-away", "content": "As the clock ticked away and the calendar turned and the Dallas Cowboys still didn't have a starting running back on their roster, Jerry Jones was always defiant. He insisted he had a plan.\nIt just wasn't a very good plan.\nHis strategy for reviving the Dallas running game neared completion on Monday when old friend Ezekiel Elliott agreed to terms on a one-year deal to officially re-sign with the Cowboys. And it's a great story, really, because Elliott is a fan favorite, was once a great player in Dallas, and he'll surely be welcomed by his once-and-former teammates in the locker room. He's also a remarkable athlete who has 11,553 total yards in his eight-year NFL career.\nBut he's also about to turn 29 years old and has shown quite a decline over the last two seasons, while playing a position that when the fall comes, it usually comes fast. And Jones chose him after waving off one of the best free-agent running back classes ever — a market that included Saquon Barkley, Derrick Henry, Josh Jacobs, Aaron Jones, D'Andre Swift, Joe Mixon and Austin Ekeler. There was even a strong Plan B list that included Zach Moss, Gus Edwards and Devin Singletary. And there was the NFL Draft.\nThe Cowboys could have even re-signed Tony Pollard, who got a three-year, $21.75 million contract from the Tennessee Titans. But if they were intent on replacing him after his disappointing 1,005-yard season last year, there were far better options than signing a player who is much closer to being in the Cowboys Ring of Honor than he is to his prime.\nThere is, after all, a really good reason why running backs have been devalued all across the NFL over the last decade or so. They tend to age quickly because of the pounding they take. They get hurt a little more often. They tend to slow down just as players at other positions are speeding into their prime. It's why, for the most part, teams prefer to spend money on their offensive line and plug in someone with young, healthy legs to run the ball behind it.\nElliott has run the ball 2,065 times and caught 356 passes in his eight seasons, which means he's taken about 2,300 hits, not to mention all the collisions from when he was blocking. There is no doubt that pounding has taken its toll.\nIn fact, that's a big reason why the Cowboys cut him last May, rather than pay him the $10.4 million salary he was due, coming off a season in which he ran for just 876 yards (albeit with 12 touchdowns) as part of a backfield timeshare. The Cowboys decided Pollard, then still recovering from a broken leg and badly sprained ankle, was a better investment — in part because he's three years younger. \nSo Elliott signed with the New England Patriots, where his decline continued. He ran the ball 184 times, but only for 642 yards and 3.5 yards per carry — both career lows, eclipsing the lows he set the year before. It seemed pretty clear then to everyone that he was going to finish his career as a part-time running back, if he continued playing at all.\nBut Jones apparently saw gold in the way Elliott finished. \"I thought he played well the last part of the season at New England,\" he said. \"Very well.\" It takes some rose-colored glasses to see that, though. Elliott started the last five games for the Patriots, rushing 72 times for 213 yards (2.95 per carry). He also caught 27 passes for 159 yards.\nFinancially, at least, Elliott is low-risk. His one-year deal only includes a reported $2 million guaranteed. And if adding a low-risk complementary piece to the backfield was Jones' master plan it would've been fine. No doubt they could use the help, especially in their short-yardage running game.\nBut it sure doesn't look like Elliott is just a complementary piece in a backfield that is currently highlighted by Rico Dawdle (89 carries, 361 yards and two touchdowns last season), Deuce Vaughn (23-40-0), and journeyman Royce Freeman (77-319-2). Even if they go with a running back committee — as they are expected to do — Elliott will almost certainly take the lead.\nIt's as if they were waiting for Elliott all along to fill that role. They didn't even take a running back in the draft when everyone assumed they had to. The closest they came was when, after Round 1 was over, Jones told the world how much he loved Texas running back Jonathon Brooks, who might have been their second-round pick if the Carolina Panthers didn't beat them to it 10 picks earlier.\nJones dismissed any concern by saying \"I've seen teams win the Super Bowl with running backs that they traded for midseason.\" That, of course, is much more of a hope than a plan, too. It counts on a team with a strong, healthy running back, probably on an expiring contract, deciding they're out of playoff contention by October. It also counts on the Cowboys being the highest bidder — something they rarely seem to be.\nMaybe that miracle happens. But the real miracle they need now is a revival of Elliott, because for the moment he really is the Cowboys' only hope. They may need him to be close to the player he was in 2021, his last 1,000-yard season (1,002 yards, 10 touchdowns), when he averaged 4.2 yards per carry. Because the running game was a huge Achilles heel for them last season. They relied far too much on Dak Prescott's arm and CeeDee Lamb's playmaking ability. They couldn't run effectively or explosively. Their short-yardage and goal-line running game was weak.\nThey simply couldn't lean on their rushing attack in big spots where they needed it, which is why later in the season they sometimes didn't even try.\nMaybe Elliott is the cavalry. Jones certainly thinks so. He even said \"He's good enough to be a starter,\" which he now almost certainly is.\nBut the Cowboys can only hope that's the case. And hope is not a strategy, and the past is not the future. Elliott's homecoming might make for a warm and fuzzy moment and bring back some wonderful memories. But the \"all in\" Cowboys needed something more helpful than that.\nRalph Vacchiano is the NFC East reporter for FOX Sports, covering the Washington Commanders, Philadelphia Eagles and New York Giants. He spent the previous six years covering the Giants and Jets for SNY TV in New York, and before that, 16 years covering the Giants and the NFL for the New York Daily News. Follow him Twitter at @RalphVacchiano.\n", "description": "The Cowboys finally found an answer to their RB problem, though it's doubtful that the aging Ezekiel Elliott will be enough.", "hero_img": "https://statics.foxsports.com/www.foxsports.com/content/uploads/2024/04/zeke1.jpg", "thumbnail": "https://a57.foxsports.com/statics.foxsports.com/www.foxsports.com/content/uploads/2024/04/128/72/zeke1.jpg", "category": "NFL", "date": "Mon, 29 Apr 2024 12:02:02 -0400", "comments": []}, {"title": "Panthers push their rebuild by drafting new weapons for Bryce Young", "url": "https://www.foxsports.com/stories/nfl/panthers-push-their-rebuild-by-drafting-new-weapons-for-bryce-young", "content": "New Panthers general manager Dan Morgan is careful not to directly compare his current roster to the one that went 2-15 last year, but there's no disrespect in acknowledging how much Carolina has reshaped its lineup in the past two months.\nAfter this weekend's draft, even without the benefit of the No. 1 overall pick, the Panthers will have newcomers accounting for at least half their starting jobs — conservatively five on offense and six on defense, with a real chance for more. For Morgan and first-year coach Dave Canales, they've upgraded the cast around quarterback Bryce Young enough to at least evaluate him fairly in 2024.\n\"Specifically talking about the offense ... with a running back, a receiver and a tight end, skill-wise, just bringing a little juice there to really challenge that whole group and elevate that offense,\" Canales said Saturday. \"I'm really excited about what we did there. ... [Young] is very fired up about what we've put together.\"\nThe weekend started with Chicago using a pick acquired from Carolina to take USC quarterback Caleb Williams, taking the spotlight a year after the Panthers had that in drafting Young first. That trade and that pick were part of a difficult 2023 season that saw an 0-6 start, the firing of a head coach and general manager and the worst record in the league.\nEven without that top pick, Carolina got back into the first round, trading up a spot to No. 32 to get South Carolina receiver Xavier Legette, then traded up again to No. 46 to get Texas' Jonathon Brooks as the first running back taken. Brooks is recovering from a torn ACL but is expecting to be healthy for the start of training camp and will upgrade a Panthers run game that averaged fewer than 4 yards a carry for the first time since 2006.\n\"Versatility, first and foremost,\" Canales said of what he likes about Brooks. \"There's so much that he brings. Vision, patience, contact balance, acceleration. He's got it all. He's the best back in this class, and we were so fired up to be able to bring him in.\"\nAdd in Longhorns tight end Ja'Tavion Sanders with the first pick of the fourth round — more than 600 receiving yards in each of the last two seasons — and it's three new weapons to upgrade an offense that sorely lacked a big-play threat last season.\nIf the priority in free agency was improving the line protecting Young — investing $153 million in guards Robert Hunt and Damien Lewis — then the offensive focus in the draft shifted to the skill positions. Some had expected the Panthers to draft a center, but they're confident in Austin Corbett, who has 62 career starts at guard but is shifting inside and handling the transition well.\nCarolina used four of its last five draft picks on defense, and the prospect with the best shot at starting is Kentucky linebacker Trevin Wallace, a third-round pick who should challenge veteran Shaq Thompson as he returns from a season-ending ankle injury. Wallace, 21, had one of the fastest 40 times of any linebacker in the draft at 4.51 seconds with a 37-inch vertical as well.\n\"An athletic freak, a guy who can run sideline to sideline, strike ball carriers,\" Morgan said Friday after selecting Wallace. \"His ceiling is really high. I think he's a guy who's going to develop, keep developing and turn into a good linebacker for us.\"\n[RELATED: 2024 NFL Draft grades: Analyzing all 32 teams' classes; Who gets top marks?]\nMuch of the Panthers' retooling came in free agency, with potentially six new starters arriving there: edge rushers Jadeveon Clowney and D.J. Wonnum, defensive tackle A'Shawn Robinson, linebacker Josey Jowell, safety Jordan Fuller and corner Dane Jackson. Some had expected Carolina to address the pass rush after trading Pro Bowler Brian Burns to the Giants, but Clowney and Wonnum will take much of that responsibility.\nCanales, known for his relentless enthusiasm and positivity, was almost too excited about prospects entering the draft. When Legette made it known before the draft that Canales had told him the Panthers would take him if he was available at 33, Canales downplayed the praise by saying he'd said that to him \"and 50 other guys.\" Carolina liked Legette enough to trade up a single spot, correctly getting ahead of a run on receivers early in the second round, and Canales was again unabashed in his praise.\n\"We loved him. I'm not going to sit here and lie about that,\" Canales said. \"I meant what I said. There were a lot of guys we were excited about in that area at 33. ... To get the guy that we love, for us, this whole process has been let's get guys who are not just great football players, but guys that really are us, are Panthers.\"\nCarolina has a focus on the future, and in a draft with so few underclassmen, they took three — Wallace turned 21 in February, Sanders did in March and Brooks won't turn 21 until July. The Panthers also recouped the 2025 second-round pick they'd given up in the original trade for Young, trading down in the second round to add the future pick before trading back up for Brooks. Most of the offseason overhaul is complete, and now the team can look forward to forging a new identity in training camp and the season ahead.\n\"Me and Dave, we talk every day about the roster and which ways we can make it better,\" Morgan said. \"I think we're headed in a good direction.\"\nGreg Auman is FOX Sports' NFC South reporter, covering the Buccaneers, Falcons, Panthers and Saints. He is in his 10th season covering the Bucs and the NFL full-time, having spent time at the Tampa Bay Times and The Athletic. You can follow him on Twitter at @gregauman.\n[Want great stories delivered right to your inbox? Create or log in to your FOX Sports account, follow leagues, teams and players to receive a personalized newsletter daily.]\n", "description": "How do you improve the worst team in the NFL? Carolina continued its aggressive rebuild, starting with first-round pick Xavier Legette.", "hero_img": "https://statics.foxsports.com/www.foxsports.com/content/uploads/2024/04/legette-16x9-1.jpg", "thumbnail": "https://a57.foxsports.com/statics.foxsports.com/www.foxsports.com/content/uploads/2024/04/128/72/legette-16x9-1.jpg", "category": "NFL", "date": "Mon, 29 Apr 2024 11:52:22 -0400", "comments": []}, {"title": "Broncos believe Bo Nix's age makes him 'more game-ready' than other QB prospects", "url": "https://www.foxsports.com/stories/nfl/broncos-believe-bo-nixs-age-makes-him-more-game-ready-than-other-qb-prospects", "content": "The Denver Broncos' decision to take Bo Nix with the 12th overall pick in the 2024 NFL Draft surprised some, with many expressing concern about the quarterback's relative old age as a prospect.\nHowever, general manager George Paton insists that Nix's age (24) and experience give him an edge over other top quarterback prospects.\n\"You look at it, it's hard because this is new, but 24 years old is not that old for football,\" Paton told 9NEWS Denver. \"You evaluate it, but you're really evaluating the player, you're evaluating the person. Evaluate how they fit in with the organization, especially for a quarterback.\n\"To me, the age, they're going to be more, especially with a guy like Bo Nix, 61 starts, we feel like he'll be more game-ready than if we were going to draft a 21-year-old.\"\nAs Paton alluded to, Nix's 61 starts were the most ever for an FBS quarterback, starting three years at Auburn before transferring to Oregon in 2022.\nThat sort of experience might be needed for a Broncos squad that went 8-9 last season in Sean Payton's first year as head coach. With Denver looking to make the postseason in Year 2 of Payton's tenure, the only other quarterbacks the Broncos had on their roster entering the draft were Jarrett Stidham, Ben Dinucci and newly acquired Zach Wilson, after they released Russell Wilson at the onset of the offseason. \nPayton wasn't shy in stating his interest in drafting a quarterback with his first-round pick in the lead-up to the draft, even suggesting to reporters at one point that they could trade up to select one. They hosted Michael Penix Jr. on a visit in April and held a private workout with J.J. McCarthy after his Pro Day in March.\nBut Nix's private workout in front of Payton and other staffers at Oregon on March 19 sealed the deal on whom the Broncos wanted the most, according to Paton.\n\"I'd watched all the quarterbacks, seen them live (during the regular season on scouting trips),\" Paton said. \"And then the season's over, I get with Sean and we watched the quarterbacks (on tape). And Sean liked a lot of these quarterbacks.\n\"And when we got to Bo it was pretty instant. Sean was like, ‘man.' You know, Sean.\n\"He really liked him, and then we went to the private workout and spent three hours with Bo in the meeting setting, and he was outstanding. And we go out to the field, and he made 10, 15 throws and Sean came up to me and said, ‘This is the guy.'\n\"And I said, ‘Hey, we've got a whole process to go through. But he was really the target from then on.\"\nNix was widely viewed as the sixth-best quarterback in the 2024 draft class, with FOX Sports NFL Draft expert Rob Rang and lead college football analyst Joel Klatt ranking him in that spot. But Klatt also had the Broncos selecting Nix with the 12th pick in all of his mock drafts, believing he's the right fit for Payton's offense due to his accuracy and ability to get the ball out quickly.\nNix had also ascended at Oregon over the last couple of seasons. He was statistically one of the best quarterbacks in the nation in 2023, throwing for 4,508 yards, 45 touchdowns and three interceptions, plus six rushing scores, helping the Ducks go 11-2.\nTo help Nix transition into the NFL, the Broncos added his top pass-catcher from last season, Troy Franklin. The Broncos traded up to the No. 101 overall pick to snag the wide receiver, who had 81 receptions for 1,383 yards and 14 touchdowns last season. \nNow, Nix and Franklin hope to help turn around the Broncos, just as they helped Oregon over the last two seasons.\nExiting the draft, at FanDuel Sportsbook, Nix is at +2800 to win Offensive Rookie of the Year. The Over/Under for his regular-season passing yards is set at 2850.5. \nThe Broncos are at -950 to miss the playoffs and +590 to make it. Their Over/Under win total is set at 5.5, and they have the longest odds to win the AFC West at +2000.\nFollow along with FOX Sports for the latest news on the NFL and other sports.\n", "description": "Broncos GM George Paton thinks Bo Nix's relative old age for a prospect is a benefit, believing he's more likely to make an instant impact.", "hero_img": "https://statics.foxsports.com/www.foxsports.com/content/uploads/2024/04/Bo-Nix.jpg", "thumbnail": "https://a57.foxsports.com/statics.foxsports.com/www.foxsports.com/content/uploads/2024/04/128/72/Bo-Nix.jpg", "category": "NFL", "date": "Mon, 29 Apr 2024 11:33:53 -0400", "comments": []}, {"title": "Christian Barmore's mega contract is about Patriots winning back players", "url": "https://www.foxsports.com/stories/nfl/christian-barmores-mega-contract-is-about-patriots-winning-back-players", "content": "Trust us.\nThat seems to be the message to the players from the New England Patriots' new leadership group this offseason.\nThe Patriots have made a major effort to keep their budding stars happy despite a 4-13 season in 2023. They've gone the no-nonsense route of paying them big sums of money. Defensive tackle Christian Barmore is the latest example. On Monday, the Patriots signed Barmore, a 2021 second-round pick, to a massive four-year extension worth up to $92 million.\nThere's a shift happening. Bill Belichick rarely extended players to second contracts, which are generally the most lucrative deal of a player's career. But with Belichick now gone, New England has spent the offseason investing in its own standouts: Michael Onwenu, Kyle Dugger and now Barmore.\nPatriots first-year coach Jerod Mayo joked in January that the team was going to \"burn some cash.\" And, though he backtracked on those comments, he eventually kept his promise.\nThose three players signed deals worth $207 million in new money.\nFollowing Belichick's departure, Mayo and executive Eliot Wolf have been working to earn back the trust that Belichick lost. All this money is an effort to show the Patriots' locker room that, while players didn't always get paid in the previous regime, they will get paid in this one. If they play hard and play well, they won't be shown the door in free agency. They'll get their payday from the Patriots.\nFor a team that's no longer a winner, that kind of message can help boost morale.\nThere are surely other initiatives taking place beyond these financial ones. Mayo was once a player, and he is a master of building relationships. \nNew England has also gone out of its way to patch up relationships that Belichick damaged with the media. The team scheduled an off-the-record session for media members and the entire coaching staff. While the media and the team didn't have the happiest relationship in the previous regime, the session was geared at resetting the tense situation and building relationships. If things like that are happening with out-of-house reporters, you can bet they're happening within the coaching staff and the locker room.\nAnd things got bad in the locker room last year. Belichick's tough coaching style and atypical decision-making once made him a trendsetter. But as the team lost more and more, his evil-genius routine lost its appeal. Mayo and Wolf have not totally abandoned Belichick's ideology. But it's also clear they're not afraid to throw out the bathwater.\nWolf made it pretty clear from the get-go that he wanted to draft, develop and — most important — retain players. And there were plenty of well-drafted and well-developed players on this roster.\nNow this is all well and good. It sounds lovely. But there is a reason why Belichick has long avoided the second contract: the overspending. He was, for two decades, a master of replacing departing players with acquisitions who cost less.\nDid the Patriots overpay for these three players? \nThe Patriots made Dugger the sixth-highest-paid safety in the NFL, according to average annual value. New England made Onwenu the fifth-highest-paid right tackle, per AAV. And if his AAV lands at $23.5 million, as the initial contract numbers indicate, the Patriots tied Barmore for seventh in the league among interior defensive linemen.\nYes, these were overpays.\nOverspending is often how bad teams keep good players.\nDoes everyone want to play for the Chiefs right now? Yes. Just like they wanted to play for the Patriots during the peak of their dynasty. But the Chiefs — just like every other NFL team — are often looking for team-friendly deals. \nThe key to spending is ensuring there's a safe return on investment. New England is taking a big risk on this unit. Barmore might just be the biggest risk of all, with his deal eclipsing a financial commitment larger than any Patriots player not named Tom Brady. \nBarmore had a great 2023 season with 8.5 sacks and 64 tackles on 66% of snaps. He finished with 49 pressures and 40 stops, and he demonstrated the ability to play at multiple positions on the defensive line, per Pro Football Focus. While he predominantly played as a defensive tackle in his first two seasons, he played a much higher clip at both nose tackle and edge in 2023. \nBut that was just one year. The Patriots are paying him as if they expect him to produce like that every year. It remains to be seen whether he can maintain the quality of play from that impressive season.\nThis signing is as much about the 2024 draft class as it is about Barmore. Wolf is telling his current locker room: Trust us. And he's saying the same thing to the incoming players. Because the Patriots are looking to the rookies to serve as foundational players in this rebuild.\nCertainly, New England didn't get better on paper through free agency. The organization didn't make any major splash signings (though it tried with receiver Calvin Ridley, who ultimately signed with Tennessee). The offseason has been more about not losing key players than it has been about acquiring bona fide stars.\nThe Patriots used the draft to restock at positions where they've missed in recent years. Quarterback Drake Maye, the No. 3 overall pick, is set to replace Mac Jones. Receivers Ja'Lynn Polk, a second-rounder, and Javon Baker, a fourth-rounder, should take on more substantial roles than Tyquan Thornton and JuJu Smith-Schuster had. Tackle Caedan Wallace, a third-rounder, is a developmental tackle whom the Patriots hope will someday replace Trent Brown. Fourth-round guard Layden Robinson seems like insurance if former first-round pick Cole Strange continues to play poorly.\n[READ MORE: 2024 NFL Draft grades: Analyzing all 32 teams' classes; Who gets top marks?]\nThis draft felt like the foundation of a full reboot. These contract extensions are just the same. That's the plan, at least. It'll be up to Wolf and Mayo to make sure things go according to plan.\nPrior to joining FOX Sports as the AFC East reporter, Henry McKenna spent seven years covering the Patriots for USA TODAY Sports Media Group and Boston Globe Media. Follow him on Twitter at @henrycmckenna.\n", "description": "Christian Barmore's extension is as much about the 2024 draft class as it is about him. The new regime is telling the locker room: Trust us.", "hero_img": "https://statics.foxsports.com/www.foxsports.com/content/uploads/2024/04/barmore-16x9-1.jpg", "thumbnail": "https://a57.foxsports.com/statics.foxsports.com/www.foxsports.com/content/uploads/2024/04/128/72/barmore-16x9-1.jpg", "category": "NFL", "date": "Mon, 29 Apr 2024 17:08:40 -0400", "comments": []}, {"title": "Zak Zinter, Michael Hall go from 'enemies in college' to 'brothers now' with Browns", "url": "https://www.foxsports.com/stories/college-football/zak-zinter-michael-hall-go-from-enemies-in-college-to-brothers-now-with-browns", "content": "Michigan vs. Ohio State is, and always will be, one of the top rivalries in college sports. \nSo, what happens when a former Wolverine and a former Buckeye get selected to the same NFL team in the same draft?\nThat's the case for former Ohio State defensive tackle Michael Hall Jr. and former Michigan offensive guard Zak Zinter, who are now NFL teammates after both being selected by the Cleveland Browns in this past week's NFL Draft.\nHall, who was selected in the second round with the No. 54 overall pick, played three seasons with the Buckeyes and was a third-team All-Big Ten selection in both 2022 and 2023. Zinter was picked in the third round, No. 85 overall, following a standout four-year career in Ann Arbor where he was a three-year starter, two-time All-Big Ten selection (2022, 2023) and a unanimous All-American (2023).\nBut there is another layer to the connection between Hall and Zinter. During Michigan's 30-24 win over Ohio State in last year's rivalry game, Hall was the player who was blocked into Zinter's leg, which led to a gruesome injury, causing him to break his tibia and fibula. The injury ended Zinter's senior season and collegiate career at Michigan, but the former Wolverine made it clear there were no hard feelings between him and his new NFL teammate.\n\"Being my rival throughout my career and finally being teammates here, it's crazy,\" Zinter said in an interview with ESPN. \"I'm going to be seeing him day in and day out. But we're brothers now, and it's all about that.\"\nFOX Sports' Joel Klatt was on the call for the Michigan-Ohio State game and described the emotional scene at the Big House when Zinter went down and how the Wolverines' fan base united to beat their rivals.\nZinter is expected to make a full recovery from the injury and will join Hall at the Browns' rookie minicamp, which will take place May 10-12.\n\"I'm good for everything,\" Zinter said in an interview with Cleveland.com. \"I've just been building the strength back and getting moving again. But I'm feeling great. I'm ready to roll.\"\nBoth Zinter and Hall are expected to add depth on the interior of Cleveland's offensive and defensive lines, but neither are expected to start in their first season. \n\"I think Michael Hall and Zak Zinter are good players who bolster the offensive and defensive lines, but that doesn't move the needle much for 2024,\" FOX Sports NFL analyst David Helman said. \"This is a vet-heavy team that won't lean much on rookies, from the looks of it.\"\n[Want great stories delivered right to your inbox? Create or log in to your FOX Sports account, follow leagues, teams and players to receive a personalized newsletter daily.]\n", "description": "Michael Hall was blocked into Zak Zinter’s leg during last year's Ohio State-Michigan game, leading to a gruesome, season-ending injury for Zinter. Now, the two college rivals are teammates with the Cleveland Browns.", "hero_img": "https://statics.foxsports.com/www.foxsports.com/content/uploads/2024/04/2024-04-29_Zak-Zinter-and-Michael-Hall_16x9.jpg", "thumbnail": "https://a57.foxsports.com/statics.foxsports.com/www.foxsports.com/content/uploads/2024/04/128/72/2024-04-29_Zak-Zinter-and-Michael-Hall_16x9.jpg", "category": "NFL", "date": "Mon, 29 Apr 2024 16:36:16 -0400", "comments": []}, {"title": "Jaylen Waddle, Trevor Lawrence among NFL players with 5th-year options exercised", "url": "https://www.foxsports.com/stories/nfl/nfl-teams-exercise-5thyear-options-on-waddle-rousseau-darrisaw-and-other-2021-firstround-picks", "content": "Receiver Jaylen Waddle, linebacker Jaelan Phillips, defensive end Gregory Rousseau and left tackle Christian Darrisaw were among the 2021 first-round draft picks whose fifth-year contract options were formally exercised Monday.\nThe Miami Dolphins picked up options on Waddle and Phillips. Selected sixth and 18th, respectively, Waddle and Phillips have become standout pieces on Miami's roster.\nWaddle is the only player in franchise history with three consecutive 1,000-yard receiving seasons and the ninth in NFL history to surpass the 1,000-yard receiving mark in each of his first three seasons.\nPhillips set a Dolphins rookie record with 8 1/2 sacks in 2021 and has had at least six in each of his first three seasons.\nThe Minnesota Vikings picked up the option on Darrisaw, who has started 39 games since being selected 23rd overall.\nThe Buffalo Bills did the same on Rousseau, who has 129 tackles and 17 sacks in 46 games since being chosen at No. 30.\nThe Jacksonville Jaguars, meanwhile, exercised options on former Clemson teammates Trevor Lawrence and running back Travis Etienne. Lawrence was the overall top pick in the 2021 draft.\nTeams have until Thursday to decide whether to keep those first-round picks for a fifth season. The list of those whose options already have been picked up includes Cincinnati Bengals receiver Ja'Marr Chase, Carolina Panthers cornerback Jaycee Horn, Denver Broncos cornerback Patrick Surtain, Dallas Cowboys pass rusher Micah Parsons and New York Jets guard Alijah Vera-Tucker.\n[Want great stories delivered right to your inbox? Create or log in to your FOX Sports account, follow leagues, teams and players to receive a personalized newsletter daily.]\nReporting by The Associated Press.\n", "description": "Miami's Jaylen Waddle and Jaelan Phillips and Jacksonville's Trevor Lawrence and Travis Etienne are among the 2021 first-round picks whose fifth-year contract options have been exercised.", "hero_img": "https://statics.foxsports.com/www.foxsports.com/content/uploads/2024/04/TLawEtienne.jpg", "thumbnail": "https://a57.foxsports.com/statics.foxsports.com/www.foxsports.com/content/uploads/2024/04/128/72/TLawEtienne.jpg", "category": "NFL", "date": "Mon, 29 Apr 2024 17:57:50 -0400", "comments": []}, {"title": "Herd Hierarchy: Chiefs top Colin Cowherd's post-NFL Draft rankings; 49ers slide", "url": "https://www.foxsports.com/stories/nfl/herd-hierarchy-chiefs-top-colin-cowherds-post-nfl-draft-rankings-49ers-slide", "content": "The NFL Draft is over, and Colin Cowherd is back with another Herd Hierarchy, ranking his top 10 teams in the NFL.\nFew will be surprised that all three teams atop Cowherd's list are among the four squads that made their respective conference championship games last season, including the now two-time defending Super Bowl champion Kansas City Chiefs. \nBut Cowherd is not nearly as high on the team that took the Chiefs to overtime in that Super Bowl — the San Francisco 49ers.\nHere is a look at Cowherd's top 10 now that the dust has settled on the 2024 NFL Draft, with odds from FanDuel Sportsbook.\n10. Los Angeles ChargersSuper Bowl odds: +5000\nCowherd's thoughts: \"Justin Herbert and Jim Harbaugh are great, but they lost a lot of offense — Austin Ekeler, Keenan Allen, Mike Williams, Gerald Everett. They lost productive, veteran dudes. I like [Ladd McConkey], I like Joe Alt — both good picks. They got Hayden Hurst, they got J.K. Dobbins and Gus Edwards, but I don't think they're going to be quite as lethal offensively. But I love the coach, I love the quarterback, and I love their offensive tackles.\"\n9. Houston TexansSuper Bowl odds: +1600\nCowherd's thoughts: \"I may be wrong. They may be higher than this. I just love the way they're run. I liked their draft. I liked their free agent moves — Stefon Diggs, Danielle Hunter, Joe Mixon. The last two years in personnel, they've done as well as anybody in this league. … I like the way they're coached, their quarterback, their front office.\"\n8. Philadelphia Eagles Super Bowl odds: +1400\nCowherd's thoughts: \"Offensively, the team's stacked, with or without Jason Kelce. They have star receivers, a star tight end, and now Saquon Barkley as a star running back around Jalen Hurts. They have new coordinators, and I just want to watch that unfold. A couple of years ago, I loved their coordinators. Last year, I didn't like their coordinators. Let's see where they land this year.\"\n7. Buffalo BillsSuper Bowl odds: +1300\nCowherd's thoughts: \"I'm not having Josh Allen out of my top 10. I thought they had another excellent draft. Stefon Diggs was done there. Oh, they lost Gabe Davis — you never knew what you were getting with Gabe Davis. And they went out and drafted Keon Coleman. If we're going to give Kansas City credit for their star receiver in the draft, why can't I give Buffalo credit for theirs? I have the Bills still hovering around the Super Bowl bubble.\"\n6. San Francisco 49ersSuper Bowl odds: +550\nCowherd's thoughts: \"They get Talanoa Hufanga back at safety, and they did address some secondary stuff this offseason. They had nine Pro Bowlers that all return from last year, and they went and drafted two receivers, including Ricky Pearsall in the first round. They're probably gonna move off Deebo Samuel. But — and I've said this — I think they peaked last year. I thought that was the best of them.\"\n5. Green Bay PackersSuper Bowl odds: +1900\nCowherd's thoughts: \"I love the Packers. I don't think they quite have the roster of Detroit, but I love them. Josh Jacobs is maybe the best or second-best running back in the league. They allowed the third-fewest sacks in the league. This team drafts as well as anybody. … The Packers and Tampa Bay Buccaneers had the best first four picks of anybody in the draft.\"\n4. Los Angeles RamsSuper Bowl odds: +3200\nCowherd's thoughts: \"I thought they had an unbelievable first four picks. Four guys who will start — Blake Corum won't start, but he'll play a ton behind Kyren Williams. All my executive buddies in this league scouts thought the Rams crushed it, and they crushed last year's draft, too. They lost Aaron Donald, but they went and literally got the two players they targeted. Jared Verse is the guy. … I think if Matthew Stafford is healthy, this team is going to be excellent.\"\n3. Detroit LionsSuper Bowl odds: +1300\nCowherd's thoughts: \"I think they have a stacked roster. I think they're the Niners, but with younger players and a more talented quarterback. They were No. 3 in total offense, No. 2 in passing offense. They can play from behind. They can play with the lead. They got to the conference championship for the first time since 1991. … Their big issue last year, like Philadelphia, was that they were getting torched at cornerback. They addressed both cornerback spots.\"\n2. Baltimore RavensSuper Bowl odds: +950\nCowherd's thoughts: \"They were the best team for most of the regular season. Why wouldn't I like them? They went and got Derrick Henry. They had a disappointing postseason, but they rolled teams in the regular season last year. There's no reason not to like them. Lamar Jackson is in his prime and the coaching staff is great.\"\n1. Kansas City ChiefsSuper Bowl odds: +600\nCowherd's thoughts: \"They're at the top until somebody knocks them off. Travis Kelce and Chris Jones signed extensions. Xavier Worthy, I don't know how good he'll be — he worries me with his small size as a track guy — but if anybody's going to make it work, it'll be Kansas City. They added Hollywood Brown. If Rashee Rice returns, I think their receiving core will be much more worthy of acclaim than it was last year, and last year was the year to beat them.\"\nFollow along with FOX Sports for the latest news on the NFL and other sports.\n", "description": "Colin Cowherd is not as high on the defending NFC champions after the draft. Check out his latest NFL rankings as the offseason continues.", "hero_img": "https://statics.foxsports.com/www.foxsports.com/content/uploads/2024/04/2024-04-30_Herd-Hierarchy_16x9.jpg", "thumbnail": "https://a57.foxsports.com/statics.foxsports.com/www.foxsports.com/content/uploads/2024/04/128/72/2024-04-30_Herd-Hierarchy_16x9.jpg", "category": "NFL", "date": "Tue, 30 Apr 2024 19:10:13 -0400", "comments": []}, {"title": "Chargers OT Joe Alt wants to be 'dominant' with strike, loves Jim Harbaugh", "url": "https://www.foxsports.com/stories/nfl/chargers-ot-joe-alt-wants-to-be-dominant-with-strike-loves-jim-harbaugh", "content": "Joe Alt was the first offensive tackle off the board in the 2024 NFL Draft, as the Los Angeles Chargers took him at No. 5 out of Notre Dame. Alt is now tasked with helping keep star quarterback Justin Herbert upright, while representing the first draft pick of the Jim Harbaugh era.\nWhat are Alt's early impressions of his new head coach?\nOn Tuesday's edition of \"The Herd,\" Alt explained to Colin Cowherd what he loves about Harbaugh.\n\"I think Coach Harbaugh's a great coach,\" Alt said. \"The biggest thing for me is he wanted me. He wanted offensive linemen, and he has an appreciation for offensive linemen. It makes me, as a player, want to work that much harder for a coach like that and try to succeed. I've spoken with him since I've been chosen every day, and I'm really excited to get started there.\"\nHarbaugh was previously the head coach of the Michigan Wolverines, with whom he won last season's College Football Playoff National Championship. \nOn that note, three of the 13 Wolverines players who were selected in the 2024 draft were offensive linemen: Zak Zinter, Trevor Keegan and LaDarius Henderson. Michigan built a reputation over the past three seasons for being a team that imposed its will up front through the running game. Furthermore, the Chargers selected two Michigan players of their own, linebacker Junior Colson (No. 69) and wide receiver Cornelius Johnson (No. 253).\nAlt, who stands at 6-foot-8 and 322 pounds, was Notre Dame's primary left tackle across his three seasons in South Bend. He was a two-time All-American who will likely play right tackle for the Chargers, as former first-round draft pick and Pro Bowler Rashawn Slater is their starting left tackle.\nWhile expressing that he'll play whichever tackle spot the Chargers want, Alt detailed where he wants to improve in the NFL.\n\"The pass, I always want to improve my strike. I think being able to strike a defensive end and kind of take the fight to them throws them out of their rush pattern, their rush plan, so I think that's a huge thing being able to really be dominant with that,\" Alt said. \"And the run game, just always trying to be lower. I have, obviously, a large frame, but when I'm able to get underneath guys and use that frame and that leverage to explode through guys, it really is a helpful thing, so just always trying to play lower in everything I do in the run game.\"\nThe Chargers are coming off a 5-12 season.\n[Want great stories delivered right to your inbox? Create or log in to your FOX Sports account, follow leagues, teams and players to receive a personalized newsletter daily.]\n", "description": "Los Angeles Chargers offensive tackle Joe Alt discussed head coach Jim Harbaugh and where he wants to improve in the NFL.", "hero_img": "https://statics.foxsports.com/www.foxsports.com/content/uploads/2024/04/alt1.jpg", "thumbnail": "https://a57.foxsports.com/statics.foxsports.com/www.foxsports.com/content/uploads/2024/04/128/72/alt1.jpg", "category": "NFL", "date": "Tue, 30 Apr 2024 19:07:09 -0400", "comments": []}, {"title": "Bears WR D.J. Moore on working with Caleb Williams: 'The anticipation is there'", "url": "https://www.foxsports.com/stories/nfl/dj-moore-on-working-with-caleb-williams-anticipation-is-there", "content": "Caleb Williams has officially been a Chicago Bear for less than a week, but the No. 1 overall pick in the 2024 NFL Draft has already gotten some work in with his new pass-catchers.\nWilliams has an enviable group of targets, especially among quarterbacks who are selected No. 1 overall, as Bears general manager Ryan Poles over the past two offseasons acquired veteran wide receivers Keenan Allen and D.J. Moore as well as running back D'Andre Swift and tight end Gerald Everett.\nMoore arrived in Chicago last offseason when the Bears traded the No. 1 overall pick in the 2023 NFL Draft to the Carolina Panthers in a deal that also included the Panthers' top 2024 pick — which eventually turned into Williams after the Panthers finished a league-worst 2-15. He quickly formed chemistry with then-quarterback Justin Fields, helping the former Ohio State signal-caller to the best season of his career, but it still was not enough to prevent Fields from getting dealt to the Pittsburgh Steelers in March to clear the runway for Williams.\nStill, Moore was quick to praise Williams when asked about the former USC quarterback in a recent interview with The Daily Mirror U.S.\n\"The anticipation is there,\" Moore said. \"You can tell that he's expecting us to be open at a certain time, so that's going to be one of the things that's better. But just gotta be on the same page with him going forward and it's just going to take some time. Maybe it'll be fast, or maybe it'll take so time. I'm hoping it's fast.\"\nMoore will not just have to adjust to a new quarterback, but a new role. After being the Bears' clear No. 1 receiver last season, he now figures to see more time as a slot receiver and sharing targets with Allen, a six-time Pro Bowler with the  Chargers. Poles also drafted former standout Washington receiver Rome Odunze with the No. 9 overall pick, eight spots after taking Williams, in last week's draft, and the Bears also have another solid pass-catching option in incumbent tight end Cole Kmet, who was drafted before Poles' arrival.\nBut the trade-off might be worth it, as Moore has a chance to be part of one of the most exciting collections of talent ever assembled in a Chicago franchise that has historically struggled in that area, with its best years (including its 1985 Super Bowl win) coming with the Bears' defense as their calling card. In today's NFL, however, Poles and the Bears appear to be building an offense that can compete with their NFC North rivals Green Bay Packers, Detroit Lions and Minnesota Vikings, all of whom have made the playoffs over the past two seasons thanks to stellar quarterback play.\n[Want great stories delivered right to your inbox? Create or log in to your FOX Sports account, follow leagues, teams and players to receive a personalized newsletter daily.]\n", "description": "Bears WR D.J. Moore named what has impressed him about recent No. 1 pick and new Chicago QB Caleb Williams in their first workouts together.", "hero_img": "https://statics.foxsports.com/www.foxsports.com/content/uploads/2024/04/CalebBears.jpg", "thumbnail": "https://a57.foxsports.com/statics.foxsports.com/www.foxsports.com/content/uploads/2024/04/128/72/CalebBears.jpg", "category": "NFL", "date": "Tue, 30 Apr 2024 17:10:12 -0400", "comments": []}, {"title": "Rookie WR Brian Thomas Jr.’s speed a boost for Trevor Lawrence, Jaguars offense", "url": "https://www.foxsports.com/stories/nfl/rookie-wr-brian-thomas-jr-s-speed-a-boost-for-trevor-lawrence-jaguars-offense", "content": "After the first day of the NFL Draft, Jaguars general manager Trent Baalke kept it real. \nHe was asked if Brian Thomas Jr., Jacksonville's first-round pick, would've been identified as one of the team's top prospects if Calvin Ridley had been re-signed in free agency. \n\"Probably not,\" Baalke admitted. \"Not with that pick.\"  \nRidley's departure was a major loss for the franchise, one not completely made up for by the addition of Gabe Davis in free agency. Ridley last season was the Jags' leading pass-catcher with 1,016 receiving yards and their only top wideout to play 17 games. The No. 23 overall pick, Thomas is tasked with not only filling Ridley's void, but also helping to bring the best out of quarterback Trevor Lawrence, who had a disappointing 2023 season.  \nOne way Thomas figures to do that is with his speed. \nHe ran an official 4.33-second 40-yard dash at the NFL Scouting Combine, second-fastest among wide receivers. And his acceleration is even more eye-popping. His 1.78-second \"flying 20\" was the fastest among all players at the combine. He also had the second-highest athletic score among all players at his position at the event. \nThomas' ability to get behind defenses was evident at LSU, where he led the FBS with 17 receiving touchdowns in 2023. On throws of 20-plus yards last season, he had 15 receptions on 22 targets for 670 yards and 12 touchdowns, according to Pro Football Focus. \n\"Just my ability to use my speed, be able to get open, create space on defenders,\" Thomas said in describing his game. \"I would say that's just a big role in how I play.\"\nIn Ridley's departure, Jacksonville lost its most prolific speedster. His average maximum route speed was 22.11 miles per hour, more than two mph faster than any other skill player on the roster, according to Next Gen Stats. Ridley's average route speed of 14.2 mph was also the highest among the team's skill players who ran at least 50 routes last season. \nJacksonville is getting some of that speed back in Thomas. \n\"You're adding a skilled receiver,\" coach Doug Pederson said of the rookie. \"You're adding depth. You're adding a guy that has an element of speed that we haven't had probably since Calvin last year. … I think it can only be a great asset for us on offense to not only open up the field, but I think open up some other elements of the offense.\"\nThat can include the intermediate passing game. \nBetween Thomas and Davis, who was sixth in the NFL last season with 16.6 yards per reception, the Jags could have a deep passing game that opens up the middle of the field for tight end Evan Engram and receiver Christian Kirk, who's at his best operating out of the slot. \nThere could be opportunities there for Thomas, too. \n\"There's going to be some different coverages that he's going to see here at the NFL level. A lot of teams try to keep that at bay, they try not to get receivers behind you,\" Pederson explained. \"But it's our job as coaches to make sure that we create opportunities to do that and utilize that speed. \n\"What that does then, is open up the second-level area. That's where those 12-to-15-to-20-to-25-yard ranges are really important. That's where you can spend a lot of time and make a lot of catches in those areas with what we saw on tape, with Brian being able to separate at the top of the route and use that athleticism and use his strength and his size to create some openness there in that second level.\"\nAt LSU, Thomas was half of the FBS' most dynamic wide receiver tandem last season. He got behind some of the SEC's best defenses with ease.\nIt will be more difficult in the NFL, where the defensive backs are smarter, faster, stronger and more physical. The matchups are more even, sometimes tipped in the defense's favor. \nThat's the space in which the Jaguars need Thomas to thrive to fill Ridley's void.\n\"It's going to take some time, it's going to take some new learning with a new system,\" Pederson said. \"But I'm very confident. We've got rookie minicamp coming up and then the rest of the offseason program. We're going to do everything we can to get him caught up to speed as fast as we can and get him plugged in.\"\nLawrence's success — the team's success — may lean heavily on it.\nBen Arthur is the AFC South reporter for FOX Sports. He previously worked for The Tennessean/USA TODAY Network, where he was the Titans beat writer for a year and a half. He covered the Seattle Seahawks for SeattlePI.com for three seasons (2018-20) prior to moving to Tennessee. You can follow Ben on Twitter at @benyarthur.\n[Want great stories delivered right to your inbox? Create or log in to your FOX Sports account, follow leagues, teams and players to receive a personalized newsletter daily.]\n", "description": "The Jaguars watched Calvin Ridley depart in free agency. Here's a look at how first-round pick Brian Thomas Jr. can help replace him.", "hero_img": "https://statics.foxsports.com/www.foxsports.com/content/uploads/2024/04/091425d4-brian-thomas-16x9-1.jpg", "thumbnail": "https://a57.foxsports.com/statics.foxsports.com/www.foxsports.com/content/uploads/2024/04/128/72/091425d4-brian-thomas-16x9-1.jpg", "category": "NFL", "date": "Tue, 30 Apr 2024 17:00:50 -0400", "comments": []}, {"title": "Ezekiel Elliott says 'priority' was to return to Cowboys", "url": "https://www.foxsports.com/stories/nfl/ezekiel-elliott-says-priority-was-to-return-to-cowboys", "content": "Ezekiel Elliott never wanted to leave the Dallas Cowboys.\nThe three-time Pro Bowler is back in Dallas after spending last season with the New England Patriots, officially signing a deal to re-join the Cowboys on Tuesday. Now, Elliott is where he wants to be. \n\"This was my priority. Doing what I could do to get back here,\" Elliott told the Star-Telegram on Monday after he reportedly agreed to a deal to sign back with the Cowboys. \"I have a lot left to accomplish here. I'm excited to get back with the fellas and chase that ring.\"\nElliott was released by the Cowboys in 2023 in a cap-clearing move. Dallas nearly saved $11 million by releasing Elliott, who was coming off a season where he rushed for a career-low 876 yards on 3.8 yards per carry at 27. However, he also rushed for 12 touchdowns in 2022. \nRumors of a possible reunion between Elliott and the Cowboys lingered shortly after his release from New England in March 2023. Dak Prescott stated on multiple occasions that he'd like to see the team bring back Elliott, who he formed a close bond with as they were drafted together in 2016. Jerry Jones also remained open to the idea throughout the 2023 offseason.\nBut after months of waiting for the next opportunity, Elliott joined the Patriots in the middle of training camp on a one-year deal. While he set new career lows in rushing yards and yards per carry, Elliott was an effective backup to Rhamondre Stevenson. He rushed for 642 yards on 3.5 yards per carry, adding 51 receptions for 313 yards with five total touchdowns as he was a rare spark for a Patriots offense that was arguably the worst in football.\nShortly after New England's season ended, Elliott reemerged in Dallas, attending the Cowboys' playoff loss to the Green Bay Packers. With Tony Pollard leaving in free agency and the Cowboys not doing much to address the position earlier in the offseason, rumors of a reunion between Elliott and Dallas surfaced ahead of the 2024 NFL Draft.\nElliott told the Star-Telegram that he feels like \"I'm still a starter,\" sharing that he's in good health after a PCL injury affected his last season with the Cowboys.\n\"I think I'm good,\" Elliott said. \"My body felt really good last year. My body felt good all of last year. I got my physical. My PCL looks to be healed. So health-wise, I think that I'm definitely better than when I left.\"\nThe Cowboys' running backs room doesn't have many notable names and certainly doesn't have anyone who's ever produced at the level Elliott has had in his career. Elliott will be competing with Rico Dowdle, Royce Freeman, Deuce Vaughn, Malik Davis, Snoop Connor and undrafted rookie Nathaniel Peat for a role on the Cowboys in 2024.\nHowever, Elliott is also focused on winning. He helped usher in a new era of Cowboys football when they selected him with the fourth overall pick in 2016, partnering up with Prescott to help them go 14-2 and win the NFC East as rookies. Elliott emerging as one of the game's best running backs helped the Cowboys remain in playoff contention for much of his first seven years with the team, rushing for over 1,000 yards and 10 touchdowns four times.\nBut the Cowboys never got over the hump during Elliott's first tenure. They made it to the postseason four times with Elliott, never advancing past the NFC Divisional Round as they lost in that round three times.\nElliott is hoping his second tenure in Dallas ends differently. \n\"From 2016, we've been working on building this franchise to get a chance to win the Super Bowl,\" Elliott said. \"That is obviously the priority. That's the bar.\"\n", "description": "Ezekiel Elliott never wanted to leave the Cowboys, saying in an interview that he was \"doing what I could do to\" return to Dallas.", "hero_img": "https://statics.foxsports.com/www.foxsports.com/content/uploads/2024/04/Ezekiel-Elliott.jpg", "thumbnail": "https://a57.foxsports.com/statics.foxsports.com/www.foxsports.com/content/uploads/2024/04/128/72/Ezekiel-Elliott.jpg", "category": "NFL", "date": "Tue, 30 Apr 2024 15:21:58 -0400", "comments": []}, {"title": "Detroit Lions OT Penei Sewell: I want the Lombardi Trophy 'now'", "url": "https://www.foxsports.com/stories/nfl/detroit-lions-ot-penei-sewell-i-want-the-lombardi-trophy-now", "content": "Last season, Penei Sewell and the Detroit Lions fell just short of making the Super Bowl.\nNow, the star offensive tackle has one goal in mind.\n\"We need it all. I had a conversation with [Amon-Ra St. Brown] after we found out that we were getting the contracts and going to sign, that's our goal is to host that trophy at the end of the day and to just do that,\" Sewell said Monday, according to the Detroit Free Press. \"Just to win, bro. There's nothing else to it. All those individual accolades don't mean nothing. I want the big boy and I want it now.\"\nThe Lions are coming off a 12-5 season that saw them win the NFC North for the first time in franchise history and then win two home playoff games before losing to the San Francisco 49ers in the NFC Championship Game. \nDetroit blew a 17-point halftime lead to San Francisco in the aforementioned game. Lions quarterback Jared Goff recently expressed that the crushing loss gave them \"a ton of fire.\"\nSewell, a one-time All-Pro and two-time Pro Bowler, has missed just one game over his three-year NFL career, while recently signing a four-year, $112 million extension with the Lions. Meanwhile, Detroit also inked St. Brown to a four-year, $120 million extension.\nSewell was part of an electric Detroit offense that averaged 258.9 passing yards (second in the NFL), 135.9 rushing yards (fifth), 394.8 total yards (third) and 27.1 points (fifth) per game in the regular season.\nThe Lions made it a point to improve their defense this offseason after allowing 336.1 yards per game in 2023. The team added former Bengals DT DJ Reader and former Saints DE Marcus Davenport up front, while also trading for former Buccaneers CB Carlton Davis III. The Lions then traded up in last week's NFL Draft to select Alabama standout DB Terrion Arnold in the first round with the No. 24 overall pick, and then selected Missouri DB Ennis Rakestraw Jr. in the second round (No. 61 overall).\n[Want great stories delivered right to your inbox? Create or log in to your FOX Sports account, follow leagues, teams and players to receive a personalized newsletter daily.]\n", "description": "Fresh off signing a four-year extension, Lions star right tackle Penei Sewell expressed that his goal is to win the Lombardi Trophy.", "hero_img": "https://statics.foxsports.com/www.foxsports.com/content/uploads/2024/04/penei2.jpg", "thumbnail": "https://a57.foxsports.com/statics.foxsports.com/www.foxsports.com/content/uploads/2024/04/128/72/penei2.jpg", "category": "NFL", "date": "Tue, 30 Apr 2024 13:53:01 -0400", "comments": []}, {"title": "Monsters of the Route Tree? How the Chicago Bears now lead with offense", "url": "https://www.foxsports.com/stories/nfl/how-the-chicago-bears-now-lead-with-offense", "content": "The Chicago Bears are having an identity crisis of the best kind. A team known for its defensive prowess for the past few decades has now had a full-on rom-com makeover. It's now all about the offense, baby.\nWith the addition of Washington wide receiver Rome Odunze with the ninth overall pick in this year's NFL Draft, the Bears could conceivably have the NFL's best wideout room. \nAs part of an effort to create the best possible landing spot for newly minted Bears quarterback Caleb Williams, general manager Ryan Poles infused the offense with experience. He traded a fourth-round pick for Keenan Allen after acquiring D.J. Moore in the trade down from the top spot last year. For good measure, Poles then also grabbed Odunze with the team's second first-round pick in 2024, a player with whom Williams already seems to have a rapport. \nIn fact, all four of the aforementioned players had a throwing session the week before the draft, before Williams or Odunze were even Bears.\n\"I found out, was it two days ago? That that popped out,\" Poles said on draft night. \"I thought it was pretty cool. Still at that point I was nervous that wasn't going to be able to work out where we would have to do something to make that work out. So when I found that out, it was cool, and obviously now that group has worked together, which is good.\"\nIf you consider that Moore is still this team's top wide receiver, Allen is now their WR2, who should be used primarily in the slot, the speedy Odunze will now stretch the field, adding the complementary dimension to his veteran counterparts. \nOdunze was widely considered one of the three best receivers in this draft class. The other two, Marvin Harrison Jr. and Malik Nabers, were drafted to be their team's top option. Odunze is his team's third option and could instantly become the league's best at that spot. Take a second and try to think of anyone you'd take over him right now.\nBecause of that, I don't think there's a receiver trio out there that will end up contending with what Chicago will field this season. \nFor a team as generationally starved for offense as Chicago, that's a wild thought.\nMoore was the team's leading receiver last season, amassing 1,364 yards, good for the sixth most in the NFL. According to Next Gen Stats, Moore had the second-most receiving yards over expectation, with a 15.1-yard average. That's second to only CeeDee Lamb and means Moore is one of the best at creating with less. He also had the second-most receptions of 20 yards or more, second only to Tyreek Hill. Meanwhile, Allen was in Los Angeles, taking up 30.5 percent of his team's target share, good for the third-best in the league behind Hill and Davante Adams. That's pretty impressive for a guy that spent 56.7 percent of his time in the slot.\nNow, you're adding Odunze who recorded a 4.45 40-yard dash at the combine to pair with a diverse skillset. \n\"As a receiver he can line anywhere... inside, outside,\" Poles said after drafting Odunze. \"You love his ability to finish in contested situations. Plays strong. Plays big. Runs after catches very good. He's a punt returner as well. I mean, the kid has just put time in and gotten better and better every single year, and he's a winner. He can impact the game at any moment. If you are a quarterback and in doubt and you want to go give a guy an opportunity to go finish, he's your guy. He's done that consistently.\"\nThe Philadelphia Eagles have A.J. Brown and DeVonta Smith. The Miami Dolphins have Tyreek Hill and Jaylen Waddle. The Cincinnati Bengals? Ja'Marr Chase and Tee Higgins. Those are all tandems. The only wide receiver trio of consequence is in Seattle with D.K. Metcalf, Tyler Lockett and Jaxon Smith-Njigba. But even then, would you take them over what the Bears have? There's a case to be made that Chicago still wins out offensively — especially if Williams is the Prince Who Was Promised.\nIt's a new era in the Windy City. With that new era, comes a new identity — one Chicago has never seen before. \nEven with a defensive head coach in Matt Eberflus. Even with a top-five defense. This is now an offensive team and the first of its kind in the blue and orange. That in and of itself should be enough to tell Bears fans, this time it really could be different.\nCarmen Vitali covers the NFC North for FOX Sports. Carmen had previous stops with The Draft Network and the Tampa Bay Buccaneers. She spent six seasons with the Bucs, including 2020, which added the title of Super Bowl Champion (and boat-parade participant) to her résumé. You can follow Carmen on Twitter at @CarmieV. \n", "description": "Known as the Monsters of the Midway for their defense for decades, the Bears are turning over a new leaf with one of the best WR trios in the NFL.", "hero_img": "https://statics.foxsports.com/www.foxsports.com/content/uploads/2024/04/rome2.jpg", "thumbnail": "https://a57.foxsports.com/statics.foxsports.com/www.foxsports.com/content/uploads/2024/04/128/72/rome2.jpg", "category": "NFL", "date": "Tue, 30 Apr 2024 12:34:03 -0400", "comments": []}, {"title": "Jaguars cut WR Zay Jones after drafting LSU standout Brian Thomas Jr.", "url": "https://www.foxsports.com/stories/nfl/jaguars-cut-wr-zay-jones-after-drafting-lsu-standout-brian-thomas-jr", "content": "The Jacksonville Jaguars released veteran receiver Zay Jones on Tuesday, dumping him five days after drafting LSU's Brian Thomas Jr. with the 23rd overall pick and a day after agreeing to bring five-time Pro Bowler Jarvis Landry in for rookie minicamp.\nJones was scheduled to count nearly $10.8 million against the salary cap in 2024, a significant payout for someone expected to be the team's fourth receiver at best. Jacksonville will eat $6.6 million in dead money to save $4.2 million this season.\nJones, who has 3,028 career receiving yards and 18 touchdowns in seven years with Buffalo, Oakland/Las Vegas and Jacksonville, missed eight games last season with knee and hamstring injuries. He was also arrested on a domestic violence charge that was ultimately dropped.\nJones was entering the final year of a three-year, $24 million contract that included $14 million guaranteed.\nThe Jaguars could use the cap savings to sign Landry, who is looking to get back into the league after sitting out 2023.\nLandry has played nine NFL seasons, including four in Miami and four in Cleveland. He signed a one-year, $3 million deal with his hometown New Orleans Saints in 2022 but finished with 25 receptions for 272 yards and a touchdown — all career lows. He missed eight games and landed on injured reserve that December.\nHe insists he's fully healthy now and ready to prove he belongs on an NFL roster. Jacksonville seems to be a good landing spot.\nThe Jaguars have been working to upgrade Trevor Lawrence's receiving corps, which came up short when Christian Kirk was injured down the stretch last season. General manager Trent Baalke added Buffalo's Gabe Davis in free agency, drafted Thomas and now will get an up-close look at Landry.\nThe Jaguars also cut kicker Joey Slye, moving on three days after drafting Arkansas' Cam Little in the sixth round, and agreed to terms with 13 undrafted free agents. The undrafted rookie class includes five receivers: Joshua Cephus from UT-San Antonio, Albany's Brevin Easton, Mount Union's Wayne Ruby, Memphis' Joseph Scates and Western Carolina's David White Jr.\nReporting by The Associated Press.\n[Want great stories delivered right to your inbox? Create or log in to your FOX Sports account, follow leagues, teams and players to receive a personalized newsletter daily.]\n", "description": "The Jaguars released wide receiver Zay Jones, five days after drafting LSU's Brian Thomas Jr. and a day after agreeing to bring Jarvis Landry in for rookie minicamp.", "hero_img": "https://statics.foxsports.com/www.foxsports.com/content/uploads/2024/04/zay2.jpg", "thumbnail": "https://a57.foxsports.com/statics.foxsports.com/www.foxsports.com/content/uploads/2024/04/128/72/zay2.jpg", "category": "NFL", "date": "Tue, 30 Apr 2024 12:21:19 -0400", "comments": []}, {"title": "2024 NFL Power Rankings: A post-draft look at where every team stands", "url": "https://www.foxsports.com/stories/nfl/2024-nfl-power-rankings-a-post-draft-look-at-where-every-team-stands", "content": "Now it's all starting to take shape.\nThe 2024 NFL Draft has come and gone, which means the majority of personnel moves have been made for the year. Of course, we'll see some veteran additions in the lead-up to Week 1, but we now have a clear picture of what every team in the league has to offer.\nWhat does that mean? That it's time for a new set of power rankings, obviously. With the rookies all settling into their new cities, this is how the big picture looks across the league. Each entry includes an indication of how the team has fared since our most recent rankings, which came right after the Super Bowl.\nNFL Power Rankings \n1. Kansas City Chiefs (no change)\nPretty easy call to keep the reigning champs right where they left off. The Chiefs pulled off a repeat with the least-explosive offense of the Patrick Mahomes Era, but they've fixed that issue. We'll see how Rashee Rice's legal situation pans out, but the additions of Hollywood Brown and Xavier Worthy should help bring the fireworks back to Kansas City. It hurts to lose L'Jarius Sneed, but retaining Chris Jones helps offset that loss. The Chiefs have a real-deal shot at an unprecedented three-peat.\n2. Philadelphia Eagles (+5)\nClearly, last season's collapse left a sour taste in Howie Roseman's mouth. The Eagles general manager has pulled every lever this offseason. The Birds added Saquon Barkley to an already-amazing offense, and they replenished the defensive depth chart with signings like Bryce Huff and C.J. Gardner-Johnson, not to mention big-time draft picks Quinyon Mitchell and Cooper DeJean. No excuses in Philly if Jalen Hurts & Co. can't improve on last year's lousy finish.\n[READ MORE: 2024 NFL Draft grades: Analyzing all 32 teams' classes; Who gets top marks?]\n3. San Francisco 49ers (-1)\nNiners fans might bristle at getting passed up by the Eagles, but there are (small) causes for concern in the Bay. For starters, there's going to be speculation about Brandon Aiyuk and Deebo Samuel's futures for the rest of the offseason. On top of that, the defense is without two underrated pieces: Arik Armstead was released at the start of the league year, and Dre Greenlaw is still recovering from his Achilles tear in the Super Bowl. The 49ers are clearly still contenders, but these are issues worth worrying about.\n4. Detroit Lions (-1)\nThe Lions return almost the exact same offense that lit up the league last season, complete with major extensions for Amon-Ra St. Brown and Penei Sewell. The defense looks vastly upgraded, with D.J. Reader manning the middle of the defensive line and three new corners in the secondary. On paper, the Lions look better than the team that fell oh-so short of the Super Bowl, and they should be eager to prove it.\n5. Houston Texans (+6)\nI was worried about how well the Texans would replace all their free agent losses, but I guess I shouldn't have been. Houston stockpiled its defense with free-agent signings, and on offense the trades for Stefon Diggs and Joe Mixon should help C.J. Stroud take things up a notch. It's going to be fun to see if the Texans can truly ascend into the league's elite.\n6. Green Bay Packers (-2)\nSo much of the Packers' success will hinge on Jordan Love and all of his young pass-catchers continuing to ascend. But adding Josh Jacobs and Xavier McKinney to a team that finished 2023 on a red-hot run looks awfully appealing. It would also be great if new defensive coordinator Jeff Hafley can coax more production out of that defense.\n7. Baltimore Ravens (-2)\nThe Ravens' biggest win of the offseason was locking down Justin Madubuike on a major contract extension. Adding a true, difference-making running back in Derrick Henry doesn't hurt, either. I still worry that this is a team that lost a lot — from the roster and the coaching staff — and might struggle to replace it.\n8. Cincinnati Bengals (+5)\nThe Bengals will be better in 2024 for no other reason than having a healthy Joe Burrow. If their $55 million quarterback is fully recovered from his wrist injury, Cincinnati is a contender. But in addition, I love the way they addressed the offensive line, added talent to the receiver corps and improved at safety. Don't forget about the Bengals.\n9. Buffalo Bills (-3)\nIn Josh we trust. Hard to come to any other conclusion after Buffalo's offseason. The Bills will be a threat as long as Josh Allen is on his game, but it's going to be tougher without Stefon Diggs or the long list of veteran defenders they had to release. On the bright side, this was a roster in need of a reset. It'll be fun to watch Allen lead a newer, younger version of this team into the next stage of his career.\n10. Cleveland Browns (-1)\nTheoretically, the Browns have a loaded roster and are getting their starting QB back from injury. Now, Deshaun Watson just needs to actually play like the guy they traded the farm to get. If he does, Cleveland is a contender. If he doesn't, yikes.\n11. Los Angeles Rams (-1)\nI love so much about what the Rams have done this year. Re-signing Kevin Dotson and bringing in Jonah Jackson has their offensive line looking formidable. Kamren Curl and Tre'Davious White are nice, affordable signings on defense. They added some exciting draft picks. But you're just not going to climb in the power rankings when a legend like Aaron Donald retires. Even if the young talent on defense looks promising, there's no replacing a force like Donald.\n12. Dallas Cowboys (-4) \nLet's be clear: The Cowboys should still be a good team, with a strong chance of making the playoffs. It's just hard to see the improvement from 2023. Dak Prescott, CeeDee Lamb and Micah Parsons can still take you a long way, but the Cowboys lost seven key members of last year's team and haven't done much to replace them. Are Eric Kendricks, Ezekiel Elliott and a handful of rookies enough to get over the hump? \n13. New York Jets (+6)\nCounting on the health of a 40-year-old quarterback recovering from an Achilles tear is a scary place to be. That said, I think the Jets have done all the right things to get ready for Aaron Rodgers' second attempt in New York. Beefing up the offensive tackle spot with Tyron Smith and Morgan Moses was an amazing decision, and I'm so proud of general manager Joe Douglas for insuring those guys with No. 11 overall pick Olu Fashanu. Douglas even signed a competent backup quarterback in Tyrod Taylor. That's how you protect an aging QB. We know the defense will be top-notch. Now, if Rodgers can just deliver the rest.\n14. Tampa Bay Buccaneers (+2)\nAgainst all odds, the Bucs brought back almost all the key pieces of a team that made a playoff run last year. I never would've guessed Baker Mayfield, Mike Evans, Antoine Winfield Jr. and Lavonte David would all re-sign in Tampa, but here we are. On top of that, I really dig this draft class, highlighted by an immediate starter in center Graham Barton, who could help the run game in a big way.\n15. Chicago Bears (+4)\nNo pressure, Caleb. The defense was great down the home stretch of 2023, and now the offense has the No. 1 overall pick at quarterback, a loaded receiver corps, a 1,000-yard rusher and a capable offensive line. I don't expect Caleb Williams and the new-look Bears to do anything crazy like win the division, but I do expect them to be a fun, competitive squad. That'd be a hell of a first step for Chicago.\n16. Miami Dolphins (-4)\nI worry about the Dolphins. The skill positions are as good as it gets, but I'm not sold that they improved the offensive line, which was their downfall last year. On defense, they lost Christian Wilkins, and both Bradley Chubb and Jaelan Phillips are coming off major injuries. Past versions of this team haven't been able to hold up over the grind of an 18-week season, and I have my doubts about this one.\n17. Atlanta Falcons (+7)\nThe Falcons nearly won the NFC South with middling quarterback play last year, so the addition of Kirk Cousins gives them a legit shot to make some noise. I'm going to be confused about the Michael Penix Jr. pick for the rest of my life, but that doesn't change the fact that Atlanta could win 9-plus games in 2024.\n18. Jacksonville Jaguars (-1) \nAdding Brian Thomas Jr. offsets the loss of Calvin Ridley. The rookie — together with Gabe Davis, Christian Kirk, Evan Engram and Travis Etienne — gives Trevor Lawrence a solid group of weapons. I'm still concerned about the Jags' offensive line. And even with Josh Allen signed for the long-term, I'm not convinced this defense got much better.\n19. Pittsburgh Steelers (-2)\nThe best thing going in Pittsburgh right now is what's been done along the offensive line. If the Steelers' young draft picks play up to their potential, it's going to make life much easier on their QB1. We can count on the defense to be stout. How much better does Russell Wilson (or Justin Fields) make you feel about the Steelers' ability to score points? I'll say I'm cautiously optimistic.\n20. Seattle Seahawks (-6)\nI really love Seattle's first two draft picks. Byron Murphy II and Christian Haynes could potentially make the Seahawks much better on the lines. I still wonder what Mike Macdonald's long-term vision is, because this feels like a team that could transition in 2025.\n21. Indianapolis Colts (-6) \nSorry for stating the obvious, but everything in Indy hinges on Anthony Richardson. The Colts brought back their key free agents and had a nice enough draft, but I don't think they're a better team than last year's unless Richardson can continue his upward trajectory — while staying healthy this time.\n[RELATED: Inside Colts QB Anthony Richardson’s rehab, preparations for Year 2]\n22. Arizona Cardinals (no change)\nRome wasn't built in a day. Marvin Harrison Jr. should immediately make Arizona's passing attack much more viable, and I like the addition of Jonah Williams to stabilize the offensive line. But this is still a team counting on a lot of young draft picks. Better, but not ready yet.\n23. Minnesota Vikings (+2)\nThe Vikings could be a much better team than this ranking suggests, but it all comes down to quarterback play. Is J.J. McCarthy ready to start right away? And if he is, how good is he? How will Sam Darnold perform if he's tapped to be the starter? It's a really nice roster overall, but the QB spot is just too big of a question mark.\n24. Tennessee Titans (+4)\nAt the very least, we'll soon know how good Will Levis is. The Titans spent $307 million in free agency, and they also used their No. 7 overall draft pick on a franchise left tackle. With an improved offensive line, plus Calvin Ridley and Tony Pollard to give the ball to, the main goal for this year should be finding out if Levis is a guy they can build around.\n25. New Orleans Saints (+1)\nI really think the Saints could be a solid team with better offensive line play. Is it realistic to think they'll get that in 2024? Hard to say. First-round pick Taliese Fuaga looks like a badass, but what does the future hold for Ryan Ramczyk? Tough to feel good about Derek Carr's prospects without knowing more about the guys up front.\n26. Los Angeles Chargers (-3)\nJustin Herbert with Rashawn Slater and Joe Alt protecting him is a solid place to start, and I trust Jim Harbaugh to get this moving in the right direction. I still ultimately think the Chargers are in the early stages of a multi-year rebuild. This offseason has been a strong start, but I think this team is another offseason away from making real noise.\n27. Washington Commanders (+1)\nThe Commanders spent a ton of money in free agency and had a boatload of draft capital to spend. That's the benefit of being so terrible that it requires a full reboot. I can't say expectations are high for the team, but it's going to be fun to watch Jayden Daniels begin his NFL career with a decent supporting cast around him.\n28. Las Vegas Raiders (-6)\nThere's too much talent in Las Vegas for a ranking this low. The Raiders have a feisty defense, now headlined by Christian Wilkins along with Maxx Crosby. Davante Adams is still a top-tier receiver. But how high can the ceiling really be without a better option at quarterback? Gardner Minshew was good enough to nearly win the AFC South, but something tells me that's not going to happen in Patrick Mahomes' division.\n29. New England Patriots (+2)\nYou've got to love the vibes coming out of the draft. The Pats restocked their offense in one weekend, and now we wait to see how well it translates. The early guess is that it's not going to look as easy as it does on paper. Is Drake Maye even going to start right away over Jacoby Brissett? How quickly can these rookie receivers and linemen hit the ground running? The safe bet is there are bound to be growing pains for all these young players.\n30. New York Giants (no change)\nMy theory is the Giants are laying the groundwork for 2025. Malik Nabers is going to give their offense some much-needed juice, and they made some smart offensive line signings. But no matter how this might look with Daniel Jones or Drew Lock, I feel comfortable betting that it'll all set the stage for a new QB next year.\n31. Denver Broncos (-2)\nWill it be Bo Nix, Jarrett Stidham or Zach Wilson starting at quarterback? Doesn't that question tell you a lot about what to expect from the Broncos? This feels like a season to take some lumps, develop their new quarterback and get the disastrous Russell Wilson contract off their books.\n32. Carolina Panthers (no change)\nBryce Young will definitely have help. I think people forgot about the addition of Diontae Johnson, and now adding Xavier Legette and Jonathon Brooks will give Young some real-deal difference makers on offense. That said, this is still a team that's missing a lot of pieces — and, until proven otherwise, we're not sure how good Young actually is.\nDavid Helman covers the Dallas Cowboys for FOX Sports and hosts the NFL on FOX podcast. He previously spent nine seasons covering the Cowboys for the team's official website. In 2018, he won a regional Emmy for his role in producing \"Dak Prescott: A Family Reunion\" about the quarterback's time at Mississippi State. Follow him on Twitter at @davidhelman_.\n[Want great stories delivered right to your inbox? Create or log in to your FOX Sports account, follow leagues, teams and players to receive a personalized newsletter daily.]\n", "description": "The 2024 NFL Draft is in the books. Which teams have made the most of their offseason and which have taken a step back? We rank all 32.", "hero_img": "https://statics.foxsports.com/www.foxsports.com/content/uploads/2024/04/2024-04-29_Post-Draft-Power-Rankings_16x9.jpg", "thumbnail": "https://a57.foxsports.com/statics.foxsports.com/www.foxsports.com/content/uploads/2024/04/128/72/2024-04-29_Post-Draft-Power-Rankings_16x9.jpg", "category": "NFL", "date": "Tue, 30 Apr 2024 10:46:21 -0400", "comments": []}, {"title": "Chiefs TE Travis Kelce on extension: 'I'm not a guy that holds out'", "url": "https://www.foxsports.com/stories/nfl/chiefs-te-travis-kelce-on-extension-im-not-a-guy-that-holds-out", "content": "Star tight end Travis Kelce and the Kansas City Chiefs recently agreed to a two-year contract extension worth up to $34.3 million. Kelce, who turns 35 in October, now has the highest-paying contract for a tight end in NFL history in both total value and average annual salary.\nKelce has nothing but gratitude concerning his new deal, which he expressed in the latest edition of \"New Heights,\" the podcast he hosts with his brother, recently retired Philadelphia Eagles offensive lineman Jason Kelce. He also revealed that he would not have held out for the historic contract.\n\"I can't thank Kansas City enough, my agents for knocking on the door to see if anything's available, knowing that I'm not a guy that sits out. I'm not a guy that holds out. I'm a guy that loves coming into the building, and the Chiefs know that,\" Travis Kelce said about signing his new deal. \"For them to want to be able to get this done for me, knowing how much blood, sweat and tears I put into this thing for them, I'm extremely gratefully and extremely thankful for everybody involved. I love Kansas City for it.\"\nKelce also mentioned how he was happy to be able to potentially improve the average annual salary for tight ends, which he described as an obligation he and his fellow stars at the position share.\nThe longtime Chiefs star had 93 receptions for 984 yards and five touchdowns last season, a down year for him that snapped a streak of seven consecuitive All-Pro seasons. But he then totaled 32 receptions for 355 yards and three touchdowns over just four games in the playoffs en route to Kansas City winning its second consecutive Super Bowl and third in five years. Kelce also achieved a new level of fame thanks to his high-profile romantic relationship with pop music megastar Taylor Swift, which went public shortly after the Chiefs' season began in September 2023. \nKelce, a nine-time Pro Bowler and four-time All-Pro, has posted 1,000-plus receiving yards in seven of his 11 seasons in the NFL.\nKansas City also re-signed defensive tackle and two-time All-Pro Chris Jones to a five-year deal that includes $95 million guaranteed, as well as defensive end Mike Danna earlier this offseason. That said, they did trade cornerback L'Jarius Sneed to the Tennessee Titans, with the young defensive back signing a four-year, $76.4 million deal with the AFC rivals.\n[Want great stories delivered right to your inbox? Create or log in to your FOX Sports account, follow leagues, teams and players to receive a personalized newsletter daily.]\n", "description": "After signing a two-year extension, Chiefs star tight end Travis Kelce expressed that he was never going to hold out for a deal.", "hero_img": "https://statics.foxsports.com/www.foxsports.com/content/uploads/2024/05/kelce1.jpg", "thumbnail": "https://a57.foxsports.com/statics.foxsports.com/www.foxsports.com/content/uploads/2024/05/128/72/kelce1.jpg", "category": "NFL", "date": "Wed, 01 May 2024 18:55:24 -0400", "comments": []}, {"title": "How the Colts have set up QB Anthony Richardson for a big bounce-back year", "url": "https://www.foxsports.com/stories/nfl/how-the-colts-have-set-up-qb-anthony-richardson-for-a-big-bounce-back-year", "content": "There will have to be patience in Anthony Richardson's return in 2024. \nEven with rave reviews of his shoulder rehab and workouts in the lead-up to the start of the Colts' offseason program last month, last year's No. 4 pick will be monitored in OTAs in the upcoming weeks. Maybe that continues into training camp this summer, too. And there may be rookie mistakes on the field. After all, Richardson played just 173 snaps — including just one full game — before suffering a season-ending AC joint sprain in Week 5 last season. There are many learning experiences that he didn't have that he will have to go through in 2024. \nAll those factors hang over Richardson, whose health and play will define the Colts' success this season. Their lack of significant moves in free agency represent a belief in his ability to elevate the team into contention. \nWhat if that ability truly exceeds expectations?\nOn paper, Indianapolis has set the foundation for a potentially big bounce back for Richardson in Year 2. \nGeneral manager Chris Ballard has emphasized the need to protect Richardson and get him more weapons in the offseason. The Colts backed that up in the draft, using four of their top five picks on an offense that was a top-10 scoring unit last season: offensive linemen Matt Goncalves (third round) and Tanor Bortolini (fourth round) and wide receivers Adonai Mitchell (second round) and Anthony Gould (fifth round).\nIndianapolis already has an established starting offensive line in Bernhard Raimann, Quenton Nelson, Ryan Kelly, Will Fries and Braden Smith. As mid-round picks, Goncalves and Bortolini add valuable depth. \nThe Colts see positional flexibility in both players. They believe Gonclaves — who they traded up for in the third round — can play tackle, guard and maybe even center. They believe Bortolini is an inside swing player.  \n\"You can never have enough good linemen,\" Ballard said. \nMitchell, a first-round talent the Colts got at No. 52 overall, proved to be a dynamic outside receiver at the college level who showed up in the biggest moments. He had five touchdowns in as many College Football Playoff games in his time at Georgia and Texas. \n\"I think he's got a rare ability to separate at the top of routes,\" coach Shane Steichen said. \"He's got an arsenal of releases versus press man. You can see it show up on tape. … The guy is a competitor. To get him where we got him, I couldn't be more fired up about it.\"\nThe rookie will join an already promising wide receiver room led by standout Michael Pittman Jr. (signed a three-year, $68 million extension in March), third-year deep threat Alec Pierce and slot receiver Josh Downs, who's expected to have a big Year 2 after catching 68 passes for 771 yards and two touchdowns as a rookie.  \nTight end Jelani Woods is also expected to make his return in 2024. An athletic, 6-foot-7 target, the 2022 third-round pick missed all of last season with a hamstring issue. His 312-yard rookie season in 15 games with three different quarterbacks (Matt Ryan, Nick Foles, Sam Ehlinger) is a snapshot of what could be possible with Richardson. \nThen there's the fact that Richardson and star running back Jonathan Taylor played just two snaps together in 2023. There's a whole part of Steichen's playbook that the NFL world hasn't seen yet, filled with run-pass option looks designed to thrust opposing defenses into conflict. \nAfter seeing the start of his 2023 campaign slowed by a stint on the Physically Unable to Perform list (ankle) and a thumb issue late in the year, Taylor found his groove at season's end. He had a 30-carry, 188-yard effort in the Week 18 thriller against the Texans. \nThat's the version the Pro-Bowl back the Colts are pairing with Richardson, who flashed dynamic dual-threat ability in his abbreviated rookie season.   \n\"It's actually a good problem to have because we've got a lot of dudes,\" Steichen said. \"Obviously, there's one football that goes around, but we've got a lot of talent. We've got to utilize that talent. That's our job: to put those guys in position to go do it. But we're fired up about what we have on offense. We've got to put the work in, you know what I mean? We get these guys in the building this offseason and going into training camp, put them in a position to succeed.\"\nOn paper, the Colts have done that for Richardson.\nBen Arthur is the AFC South reporter for FOX Sports. He previously worked for The Tennessean/USA TODAY Network, where he was the Titans beat writer for a year and a half. He covered the Seattle Seahawks for SeattlePI.com for three seasons (2018-20) prior to moving to Tennessee. You can follow Ben on Twitter at @benyarthur.\n[Want great stories delivered right to your inbox? Create or log in to your FOX Sports account, follow leagues, teams and players to receive a personalized newsletter daily.]\n", "description": "The Colts emphasized the need to protect Anthony Richardson and get him more weapons. Here’s how they’ve delivered on that offseason plan.", "hero_img": "https://statics.foxsports.com/www.foxsports.com/content/uploads/2024/05/e68b9e49-richardson-16x9-1.jpg", "thumbnail": "https://a57.foxsports.com/statics.foxsports.com/www.foxsports.com/content/uploads/2024/05/128/72/e68b9e49-richardson-16x9-1.jpg", "category": "NFL", "date": "Wed, 01 May 2024 17:11:32 -0400", "comments": []}, {"title": "Bears' Caleb Williams has been practicing Shane Waldron's offense for weeks, per QB coach", "url": "https://www.foxsports.com/stories/nfl/bears-caleb-williams-has-been-practicing-shane-waldrons-offense-for-weeks-per-qb-coach", "content": "It's all about Caleb Williams now for the Chicago Bears, and it appears that notion has been a two-way street.\nWilliams' quarterbacks coach Will Hewlett — who has also worked with Indianapolis Colts quarterback Anthony Richardson — explained how the former USC superstar has been grasping Bears offensive coordinator Shane Waldron's offense over the past six weeks in a Tuesday appearance on 670 The Score's \"The Parkins & Spiegel Show.\"\n\"I have pieces. I don't have the plays. I could have the plays and would that really help because there's so many other layers that go into having a successful football play work? But we have the basic route concepts in terms of depths and timing, and then how that matches together,\" Hewlett said about Williams' knowledge of the Bears offense. \n\"The NFL is somewhat of a copycat league within the systems that are run, so there's stuff that we were already working on that it was just given a different name, instead of a pivot route, it's a thunder route, or whatever the case may be … I have Shane Waldron terminology.\"\nHewlett also expressed that Williams, whom Chicago selected with the No. 1 pick in the 2024 NFL Draft last week, is \"hungry for structure.\"\nWilliams was the 2022 Heisman Trophy winner in what was his first season at USC and is coming off a spectacular collegiate career. In said season, Williams totaled 4,537 passing yards, 42 passing touchdowns, five interceptions and a 168.5 passer rating, while completing 66.6% of his passes. He also ran for 382 yards and 10 touchdowns. \nLast season (2023), Williams totaled 3,633 passing yards, 30 passing touchdowns, five interceptions and a 170.1 passer rating, while completing 68.6% of his passes. He also ran for 11 touchdowns.\nWaldron was the offensive coordinator for the Seattle Seahawks under head coach Pete Carroll from 2021-23. The former was previously an offensive assistant in some capacity with the Los Angeles Rams under head coach Sean McVay from 2017-20.\nThe Bears have substantially improved their offense this offseason. In free agency, they signed running back D'Andre Swift and tight end Gerald Everett, while acquiring wide receiver and six-time Pro Bowler Keenan Allen from the Los Angeles Chargers. Chicago then selected Washington wide receiver Rome Odunze with the No. 9 pick in the draft. \nThe Bears are coming off a 7-10 season.\n[Want great stories delivered right to your inbox? Create or log in to your FOX Sports account, follow leagues, teams and players to receive a personalized newsletter daily.]\n", "description": "Caleb Williams' QB coach, Will Hewlett, said that the No. 1 draft pick has developed an understanding for Chicago Bears OC Shane Waldron's offense over the past several weeks.", "hero_img": "https://statics.foxsports.com/www.foxsports.com/content/uploads/2024/05/bears1.jpg", "thumbnail": "https://a57.foxsports.com/statics.foxsports.com/www.foxsports.com/content/uploads/2024/05/128/72/bears1.jpg", "category": "NFL", "date": "Wed, 01 May 2024 16:37:08 -0400", "comments": []}, {"title": "J.J. McCarthy finds his ideal home and Joel Klatt's top takeaways from NFL Draft", "url": "https://www.foxsports.com/stories/nfl/j-j-mccarthy-finds-his-ideal-home-and-joel-klatts-other-takeaways-from-nfl-draft", "content": "Another NFL Draft is in the books.\nWe saw a record six quarterbacks selected in the first 12 picks of the 2024 NFL Draft, something I sensed could happen in the days leading up to the event. Of course, one of the quarterback picks left many of us in shock.\nSome of you might have heard my analysis on NFL Network over the first two days of the draft. If you want more on what that experience was like in Detroit, check out the opening of the most recent episode of my podcast, \"The Joel Klatt Show.\"\nNow that the dust has settled, let's take a look at some of the quarterbacks picked in the first round, along with some insight. \nJ.J. McCarthy heads to the Minnesota Vikings\nWhen I covered Michigan's spring game for FOX a couple of weeks ago, I ran into McCarthy, as members of the 2023 team were there for their ring ceremony. I got a chance to talk with him for a little bit about the draft process before asking him where he wanted to end up. He told me that he wanted to end up in Minnesota, saying he would \"love\" to play for the Vikings. \nLo and behold, McCarthy's wish came true. The Vikings didn't need to trade up into the top five to get him, only moving up one spot from No. 11 to select the Michigan quarterback with the 10th pick. \nThat came after the Vikings, along with the New York Giants, made a push to land the No. 3 pick to likely select Drake Maye, as we learned during the night on the NFL Network desk. After that happened, a good, ol' fashioned staredown between the Vikings and Giants took place, with Minnesota successfully calling New York's bluff that it wouldn't draft McCarthy with the sixth pick.\nThe Vikings' successful bluff-calling was great news for McCarthy. He'll be in the best situation out of all the rookie quarterbacks to go and succeed right away. \nOf course, the debate becomes whether McCarthy should and could start right away. I believe that he can and will start for Kevin O'Connell. McCarthy is hyper-competitive and really skilled. The Vikings are going to see a guy who can win them football games right away, partly because of what he does on the field, but also because he's such a strong leader. He went 27-1 as Michigan's starting quarterback, making plays in key moments where prior Michigan teams failed. \nSure, McCarthy had a deep team around him. But he took them above the X's and O's, doing so on crucial plays. His third-down tape was as good as any of the other quarterbacks. In fact, when you pieced it together and looked at how all the quarterbacks threw the ball 10-20 yards down the field, McCarthy was the best intermediate passer. A lot of these guys made their bones throwing the ball at the line of scrimmage, with Michael Penix Jr.'s downfield passing (20-plus yards) really being the only one that surpassed McCarthy.\nSo, McCarthy's skill set is better than many realize. He's got the best weapons around him - and by a long shot. Justin Jefferson, Jordan Addison and T.J. Hockenson are all superb. They added Aaron Jones in free agency. I know Hockenson is coming off an ACL and MCL tear that could sideline him for the start of the season, but that's still a strong situation where a quarterback can have a lot of success.\nDefensively, the Vikings made a step forward under defensive coordinator Brian Flores. They were toward the middle-of-the-pack, but they might get better after drafting Dallas Turner. I love that they were able to trade back up and land the Alabama edge rusher. \nMcCarthy is in a situation to really succeed early on, kind of similar to C.J. Stroud. In fact, players on the same team won the Offensive and Defensive Rookie of the Year in the last two years. The Texans were one of them with Stroud and Will Anderson, who they traded up to No. 3 to draft. \nThere's a chance we see that in Minnesota, too. If McCarthy plays early enough to put up the requisite numbers, we could see the Vikings sweep the Rookie of the Year awards. That's how good of a situation McCarthy is in.\nThe Atlanta Falcons surprise all of us and draft Michael Penix Jr.\nMichael Penix Jr. is absolutely a top-10 pick. Nothing about his game suggests that you shouldn't draft him. He's an awesome quarterback, and I've been a huge fan of his since he was at Indiana. As I've said a bunch of times, he's the best passer with leverage in this draft.\nThis isn't a case of a player being overdrafted. Rather, it's a case of a team not having a plan. The Falcons went 7-10 and I don't think they have a roster as stacked as they think they have. They've gone six straight seasons without making the playoffs, which was why they put their chips in the middle of the table for Kirk Cousins, giving him $100 million guaranteed. \nThen, they fall in love with Penix like some bozo who got engaged but fell in love with some woman they saw at the beach in spring break. They didn't give Cousins a heads-up, either. \nWhat are we doing here, Falcons?\nWe were all shocked by this on the broadcast. I understand having a succession plan, but you risk submarining the locker room before the season even begins. The first time Cousins has a bad game in a big spot, which he's prone to do in his career, he's going to be looking over his shoulder, as he won't be on solid footing starting Day 1. You can claim that this is injury insurance for Cousins after he tore his Achilles, but you shouldn't have signed him to that deal if you feel you need that insurance.\nAtlanta needed a better plan than this. It's taking a top-10 pick and putting it on the sideline, failing to reap the rewards of having a quarterback on a rookie contract. The explanations never really made sense, either. All of the things you said about loving Penix sound great, but now you're a spec home builder. You're not going to enjoy the fruits of your labor. This doesn't make your team better right now. \nNow, I hope this works out for everyone involved. My heart also hurts for Penix, who is being shoved to the sideline and put into a spot that's tough to succeed. Hopefully, in 10 years, he's the Falcons' starting quarterback with a Super Bowl in hand. But I have my doubts.\nCaleb Williams already impresses after being drafted No. 1 by Chicago Bears\nI was impressed by Williams' response to being asked on NFL Network why he's confident it'll work out in Chicago. He didn't give the usual answers we hear, telling Kayle Hartung things will work out \"because I care.\"\nThat's a unique answer, and I really enjoyed it. WIlliams cares about winning, being great, the coaches, and even the janitors in the building. You can think what you want about Williams, but his teammates really like him. He tried to get other teammates paid through name, image and likeness. His team was underachieving, though it wasn't his fault. He tried to put a cape on too much in 2023 because of that, but he was unbelievable in 2022.\nSo, Williams saying it's going to work out in Chicago because he cares is an unbelievable answer. You can hate Williams all you want, I think he's going to succeed in Chicago. The Bears are in a better spot than anyone else but the Vikings for a rookie quarterback to succeed.\nThe Bears also added Rome Odunze with the ninth pick, adding him to an offense with DJ Moore, Keenan Allen and D'Andre Swift. Williams and Odunze formed a good relationship before the draft. This team is a far cry from where they were when they drafted Justin Fields in 2021. \nI was a big fan of the Bears' draft and I think they can be this year's Houston Texans.\nBo Nix is a good fit for the Denver Broncos\nWe were the first to predict Nix to the Broncos. I've said it several times: Nix is the perfect fit for Denver because of his style of play and the offense Sean Payton runs. \nNix might have been overdrafted at 12, even if I predicted it months in advance. He was probably more of a late first-round pick than a top-half selection in the opening round. But all the quarterbacks came off the board and the Broncos didn't have a second-round pick. A trade down would've been too risky.\nIt's also too natural of a fit. Nix's accuracy and intelligence fit Payton's scat-protection offense, which wasn't a fit for Russell Wilson. I think Nix can have some success early, especially after adding Oregon receiver Troy Franklin, who I thought was worthy of a first-round pick. \nJoel Klatt is FOX Sports' lead college football game analyst and the host of the podcast \"The Joel Klatt Show.\" Follow him on X/Twitter at @joelklatt and subscribe to the \"Joel Klatt Show\" on YouTube.\n", "description": "J.J. McCarthy told FOX Sports' Joel Klatt that he wanted to be in Minnesota before being drafted by the Vikings. Does the former Michigan QB have what it takes to start right away?", "hero_img": "https://statics.foxsports.com/www.foxsports.com/content/uploads/2024/04/2024-04-29_Is-JJ-McCarthy-good-enough-to-play-early-for-the-Vikings_16x9.jpg", "thumbnail": "https://a57.foxsports.com/statics.foxsports.com/www.foxsports.com/content/uploads/2024/04/128/72/2024-04-29_Is-JJ-McCarthy-good-enough-to-play-early-for-the-Vikings_16x9.jpg", "category": "NFL", "date": "Wed, 01 May 2024 14:46:30 -0400", "comments": []}, {"title": "Amid Michael Penix Jr. buzz, Falcons focus on present with Kirk Cousins", "url": "https://www.foxsports.com/stories/nfl/amid-michael-penix-jr-buzz-falcons-focus-on-present-with-kirk-cousins", "content": "No NFL team had more controversy swirl around a draft pick than the Falcons in taking quarterback Michael Penix Jr. at No. 8 a month after signing Kirk Cousins, but Atlanta is trying to move forward with business as usual as the surprise wears off. Players said Tuesday that they trust in general manager Terry Fontenot's judgment.\n\"Terry brought me here, and I truly believe that everything he does is to help this team,\" Pro Bowl safety Jessie Bates said. \"There's going to be a lot of questions about why we made that pick, but as a leader, I have to be a guy that [says] this is the vision, this is what we're going with. I can do all I can to make sure I do my part, and same for all the other guys.\"\nIt's unusual, if not completely unprecedented, for a team to make a $180 million commitment to a veteran quarterback — including $100 million guaranteed — and then also use a top-10 draft pick at the same position. Fontenot and new head coach Raheem Morris have made it clear that Cousins is their quarterback now, and they're excited about Penix being their quarterback of the future at some point.\nCousins, 36, hasn't spoken publicly yet, but Bates acknowledged the sudden attention surrounding the team from the moment the pick came in for Penix on Thursday night.\n\"My phone was buzzing like I got drafted again,\" he said. \"You know, it wasn't very surprising to me. I knew what type of player [Penix] is. Being from Indiana, I had an idea of who he was. I think he had a couple of almost upsets against Ohio State. I just watch football, and I can tell he has a knack.\n\"I think he'll bring a lot to this locker room. He may not be playing the first couple of years, but having that competitive nature in the locker room, whether it's Kirk Cousins, a practice squad player, whether it's me or a Pro Bowl player, whatever it is, we're going to compete and make each other better.\"\nFontenot and Morris explained that their optimism in the team's success under Cousins would mean Atlanta would pick much later in the first round in the coming years, and as such, they wouldn't be in position to draft a quarterback as talented as Penix. It also speaks to their confidence in the existing roster that they could use a resource as valuable as a high first-round pick on the team's future.\nCousins barely had a head start on Penix in terms of getting to know the locker room and establishing himself as a leader, but the 12-year-veteran has done that well in the first few weeks of offseason workouts.\n\"It's been phenomenal. It feels like he's been here for years, in terms of interactions with guys,\" Pro Bowl guard Chris Lindstrom said Tuesday. \"You hear stories about how great a professional he is, and that reputation carries across the league, but when you get here and watch how the guy works, it's remarkable. The way he interacts with us has been great. You can't ask for anything more. You see the way he approaches every single day, the intensity behind every single rep, the purpose behind it, it's really cool.\"\nRight now, Cousins and Penix are on the same roster, but not exactly co-existing. Penix visited Atlanta last week for an introduction with the media, but he isn't expected back until next weekend, when the team's rookie minicamp will take place. From there, rookies and veterans will work together in OTAs (organized team activities) building up to mandatory minicamp June 10-12, and then they're off until the start of training camp in late July.\nCousins is recovering from November surgery for a torn Achilles tendon that ended his season early, so for a time, Penix will be able to do more in practice. Bates said Cousins' veteran leadership can already be seen as he leads the offense through walkthrough install sessions on the field, where coaches are limited in what they can do this time of the offseason.\n\"His presence, that's the biggest thing,\" Bates said. \"Everybody's been asking me: 'How's Kirk Cousins? How's Kirk Cousins?' I was like, ‘Hey, just his presence alone, just being there, I think is next level.’ The coaches can't be out on the field too much, but when you have a guy like 'Coach' Kirk Cousins, he can go out there and run a whole script, whether that's with the 1s, then the 2s. That presence is something that's priceless. \n\"You can't just have Penix come in here and he can run all the jogthroughs and walkthroughs. Kirk's done that for 10-plus years and he's comfortable doing that. He knows what that looks like. It'll be good not just for Kirk and our offense but for the whole entire team to see how he operates in the building. That's going to breed a lot of wins and a lot of success in this building.\"\nThe Falcons will have to split their reps between the two quarterbacks, no doubt giving a larger share to Cousins as the starter even as they try to prepare Penix to be ready as well. Lindstrom said building a rapport and familiarity with Cousins is crucial right now, even just linemen learning his voice and cadence and how he operates as a quarterback and what he expects in terms of protection. Lindstrom came into the league with Matt Ryan as his quarterback, so he's seen this before, but after two seasons with much less experienced quarterbacks, he likes what he sees.\n\"The experience he has, the looks that he's seen, he's played in a lot of big games,\" he said. \"He understand the different challenges that he may face. ... He kind of knows the way he wants things, too, which is great, so we're all on board.\"\nGreg Auman is FOX Sports' NFC South reporter, covering the Buccaneers, Falcons, Panthers and Saints. He is in his 10th season covering the Bucs and the NFL full-time, having spent time at the Tampa Bay Times and The Athletic. You can follow him on Twitter at @gregauman.\n[Want great stories delivered right to your inbox? Create or log in to your FOX Sports account, follow leagues, teams and players to receive a personalized newsletter daily.]\n", "description": "Atlanta players are being careful to express their excitement for their rookie QB while also building chemistry with the current starter.", "hero_img": "https://statics.foxsports.com/www.foxsports.com/content/uploads/2024/05/penix-cousins-16x9-1.jpg", "thumbnail": "https://a57.foxsports.com/statics.foxsports.com/www.foxsports.com/content/uploads/2024/05/128/72/penix-cousins-16x9-1.jpg", "category": "NFL", "date": "Wed, 01 May 2024 13:56:25 -0400", "comments": []}, {"title": "How Falcons' past moves at QB affected decision to draft Michael Penix Jr.", "url": "https://www.foxsports.com/stories/nfl/how-falcons-past-moves-at-qb-affected-decision-to-draft-michael-penix-jr", "content": "The Atlanta Falcons' decision to select Michael Penix Jr. with the No. 8 pick in the 2024 NFL Draft was one of the more shocking decisions in recent draft history.\nBut the Falcons are emphasizing that it was about stability at quarterback. Falcons assistant general manager Kyle Smith admitted that developments in the last few seasons caused them to double-dip at quarterback this offseason, as they signed Kirk Cousins to a four-year, $180 million deal with $100 million guaranteed in March.\n\"It was an unsettling feeling, sitting there in '21,\" Smith told reporters, recalling what it was like when he and general manager Terry Fontenot joined the organization that year. \"I'll never forget sitting there with Terry and being like, 'OK, well, what's our future? What's our plan for the future? How are we going to solidify down the road?'\n\"It's not just about this year or next year. It's about five years minimum.\"\nThe Falcons didn't invest major capital into the quarterback position over the last two seasons. They kept Matt Ryan and his $26.9 million salary at the time as their starting quarterback in 2021. However, after an attempt to trade for Deshaun Watson, the Falcons cut ties with Ryan, trading him to the Indianapolis Colts.\nAtlanta double-dipped at quarterback to a far lesser degree in 2022 than it did this offseason. It gave Marcus Mariota a two-year, $18.75 million deal that year before drafting Desmond Ridder in the third round of the 2022 NFL Draft. \nMariota was the team's starting quarterback in 2022, but he was benched late in the year after throwing for 2,219 yards, 15 touchdowns and nine interceptions as the Falcons went 5-8 in the 13 games he started. Ridder became the team's starting quarterback but was benched on multiple occasions due to poor play. He threw 2,836 yards, 12 touchdowns and 12 interceptions in 13 games, causing Atlanta to go 7-10 for the third straight season.\nThe losing records caused the Falcons to hold a top-10 pick for the fourth time in Fontenot and Smith's tenure with the team. They selected skill position players instead of a quarterback with their first three top-10 selections. Falcons brass felt this year was different, with owner Arthur Blank endorsing the idea of drafting a quarterback with the No. 8 pick, Yahoo! Sports reported.\n\"This is the first year that we were sitting there and staring down the barrel at a player that we think can be that guy,\" Smith said. \nWhile Smith and the Falcons feel strongly about Penix, the decision still left many scratching their heads. They had given Cousins a massive deal just over a month prior to the draft. \nThere is a caveat with Cousins' deal, however. The Falcons can get Cousins without a charge following the 2025 season, seemingly opening a path for Penix to take over in 2026 if the veteran struggles, if not sooner. Cousins is also turning 36 in August and coming off an Achilles tear.\nWhile Cousins and his team were blindsided by the team's decision to draft Penix, Smith continued to insist that it was just about adding talent to the quarterback room. \n\"What we did to get Kirk Cousins should tell everybody that we believe in Kirk Cousins,\" Smith said. \"He's our guy. We set ourselves up.\n\"Then, in the draft, Michael Penix was there. It's a quarterback — a young quarterback — that we believe in. We pulled that trigger.\n\"I mean, that's as clear as I can say it.\"\nRegardless of how outsiders feel about the situation, Atlanta seems to have the best feeling about its quarterback room it's had in years.\n\"For the next five years, we feel great about the position,\" Smith said. \"Minimum.\"\n \n", "description": "Falcons assistant general manager Kyle Smith admitted that the team wanted long-term stability at quarterback, something it hasn't had in recent years.", "hero_img": "https://statics.foxsports.com/www.foxsports.com/content/uploads/2024/04/penix-16x9-1.jpg", "thumbnail": "https://a57.foxsports.com/statics.foxsports.com/www.foxsports.com/content/uploads/2024/04/128/72/penix-16x9-1.jpg", "category": "NFL", "date": "Wed, 01 May 2024 13:56:19 -0400", "comments": []}, {"title": "Buccaneers D-line coach: We want Vita Vea to become 'dominant'", "url": "https://www.foxsports.com/stories/nfl/buccaneers-d-line-coach-we-want-vita-vea-to-become-dominant", "content": "Tampa Bay Buccaneers defensive lineman Vita Vea has been among the better nose tackles in the NFL across his six seasons in the sport. Now, Vea is being challenged to become a world-class force.\nBuccaneers defensive line coach Kacy Rodgers detailed where he wants to see Vea improve next season, while also implying that the defensive tackle has shed some weight this offseason.\n\"When you're looking at plays he was leaving out there, Vita's a really strong man. When he uses his hands properly and proper technique, he's going to be hard to stop,\" Rodgers told PewterReport about Vea on Tuesday. \"That's the thing. He plays hard. He does everything we ask of him. [It's] just when you go back, and you look at some plays, 'you know you should've made that play. You know that guy should not be blocking you.' \n\"That's kind of what we need [for] him to take the next step because he does everything else we ask. Now, it's just kind of being the dominant guy, not the good guy.\"\nLast season, Vea totaled 5.5 sacks, 43 combined tackles and two forced fumbles. He was part of a Tampa Bay defense that surrendered 248.9 passing yards (29th in the NFL), 95.3 rushing yards (fifth), 313.0 total yards (23rd) and 19.1 points (tied for sixth) per game in the 2023 regular season.\nVea was a Pro Bowler in 2021. The Buccaneers selected him with the No. 12 pick in the 2018 NFL Draft out of Washington.\nRodgers has been on Tampa Bay's coaching staff since 2019, also serving as its run game coordinator and co-defensive coordinator. He was also current Buccaneers head coach Todd Bowles' defensive coordinator when Bowles was the head coach of the New York Jets from 2015-18. The two also coached together with the Dallas Cowboys and Miami Dolphins from 2005-11.\nThe Buccaneers are coming off their third consecutive NFC South division title and trounced the Philadelphia Eagles in the NFC wild-card round, 32-9, before losing to the Detroit Lions in the divisional round.\n[Want great stories delivered right to your inbox? Create or log in to your FOX Sports account, follow leagues, teams and players to receive a personalized newsletter daily.]\n", "description": "Tampa Bay Buccaneers defensive line coach Kacy Rodgers expressed that he wants nose tackle Vita Vea to become \"dominant.\"", "hero_img": "https://statics.foxsports.com/www.foxsports.com/content/uploads/2024/05/vea2.jpg", "thumbnail": "https://a57.foxsports.com/statics.foxsports.com/www.foxsports.com/content/uploads/2024/05/128/72/vea2.jpg", "category": "NFL", "date": "Wed, 01 May 2024 12:59:26 -0400", "comments": []}, {"title": "Can new Bills WR Keon Coleman help fill the void of Stefon Diggs?", "url": "https://www.foxsports.com/stories/nfl/can-new-bills-wr-keon-coleman-help-fill-the-void-of-stefon-diggs", "content": "Keon Coleman had his Buffalo Bills hat ready while he watched from home as the second round of the NFL Draft began on Friday. Coleman must have had a pretty good sense that he was going to the Bills. Josh Allen chatted with general manager Brandon Beane over FaceTime on Friday morning before Round 2, and so the quarterback was up to speed. Beane would listen to trade offers for the No. 33 overall pick, but he had the Florida State receiver circled. \nBeane, Allen and Coleman pretty much knew. And then the Bills went on the clock and made the pick official. Coleman put on his Bills hat for the TV broadcast. \nHis new quarterback was one of the first people to reach out following the selection.\n\"[Allen] was like, 'You're the guy I wanted. I watched a lot of receivers and I wanted to play with you,'\" Coleman said this weekend during an introductory press conference. \"I've been saying the same thing [about Allen].\"\nColeman added: \"He's a great quarterback. He's one of the best in the league right now. I would love to be catching passes from him.\"\nBeane said that \"it was no secret\" the Bills needed a perimeter receiver in the draft. Buffalo had traded receiver Stefon Diggs and watched Gabe Davis depart in free agency. Those two players accounted for 241 targets last season.\nThe Bills planned to get a wideout in the first or second round, per Beane. They traded back twice on Day 1 of the draft, eventually landing at the top pick in Round 2. That's where they selected Coleman, whom Allen had been eyeing for quite some time.\n\"Josh is crazy about the draft process,\" Beane said on \"Sirius XM NFL\" after the draft. \"He loves it. If I get a call from Josh in the offseason, it's usually him seeing someone in a highlight, running into somebody, throwing with somebody. … Just asking me what I think about this guy. [Allen] called me at the Senior Bowl to ask me about what I think about a few guys there. So he loves it.\"\nAllen admitted ahead of the draft that he isn't exactly a talented or trained scout. He doesn't want to be a GM. But he loves watching the prospects ahead of the draft and thoroughly enjoys running mock drafts, like the ones so many NFL fans use on PFF and other websites.\n\"I look at all the highlight tapes on YouTube, so everyone's a baller on those highlights,\" Allen said in May. \"But going down and actually watching all their targets and seeing their mannerisms. And obviously, I'm not there in the personnel meetings, but I get a lot of intel from the guys up in the bullpen.\"\nIt's not like Allen has a lot of say in which players the Bills draft. Both he and Beane made that pretty clear. But Allen's passion for the draft did lead Beane to give the quarterback a window into how the team prepares. Rather than letting Allen settle for the highlights, Beane put him in a room with coaches to break down the film of several receiver prospects to help the QB see the process.\n\"We did give him some guys. We said, ‘Sit with the coaches. Y'all watch them together and talk about how you'd use them. I'd like to hear what you see,'\" Beane said.\nColeman is a 6-foot-4, 215-pound prospect who started his college career at Michigan State for two seasons and finished at FSU in 2023. With the Seminoles, he had 50 targets for 658 yards and 11 touchdowns. The production wasn't off the charts, but Coleman's tape against LSU — an FSU win in which Coleman had nine catches for 122 yards and three touchdowns — was something special. \nThe only other major question with Coleman was his speed: He ran a 4.61-second 40-yard dash, ranking in the bottom quarter of receivers at the combine. But maybe the Bills will figure out how to work around that by using his power and leaping ability. \nBoth Allen and Beane liked \"the size, the basketball ability,\" the GM said. The play that showed that as well as any was Coleman's leaping, one-handed catch over the middle against Syracuse.\nColeman's size and catch radius should help Allen in the red zone. And the receiver's tools should help Allen when he's improvising. The quarterback has made a habit of escaping the pocket and making explosive plays beyond the called play. Coleman demonstrated the ability to do exactly that in 2023.\n\"I think it's a key part. I played with numerous quarterbacks that keep plays alive,\" Coleman said. \"You ain't always open every time it's a dropback. Sometimes the D-end will get back there. To be able to have that ability to stay quarterback-friendly, stay on the same side of the field, get across the field, be in his vision and be a big target and use my size to shed off my defender and give him a reliable throw and make sure you make the catches … I take pride in that. Scramble drill is an actual play.\"\nColeman will join free-agent receiver acquisitions Curtis Samuel and Mack Hollins. Khalil Shakir, the team's slot receiver, is the most successful returner at the position. The beauty of Coleman's playing style is that he's unlike his peers in the receiver room. In terms of play style, Hollins has the most overlap and will serve as insurance in case Coleman struggles to acclimate instantly. But Hollins hasn't been a full-time starter during his career — he's more of a special teams player. \nColeman has a clear path to the field, which hasn't always been the case for the top selection in a Bills draft class. Dalton Kincaid and Gregory Rousseau, former first-round picks, didn't start in Week 1 during their rookie seasons. That said, Coleman's path to the field doesn't necessarily mean he'll make an impact. Former first-rounder Kaiir Elam looked like a clearcut starting corner on paper, but he still hasn't cracked into the rotation as a starter. \nColeman has to play well. It's that simple. And if the pressure of replacing Diggs wasn't enough for the rookie, he'll also have to deal with comparisons to Chiefs receiver Xavier Worthy and Panthers receiver Xavier Legette — the guys who were selected with the picks the Bills traded back from.\nBut if you saw the viral clips of Coleman's press conference and introductory tour around Highmark Stadium, you'll see a guy who's at ease in Buffalo. And he already has the resounding support of his quarterback.\nPrior to joining FOX Sports as the AFC East reporter, Henry McKenna spent seven years covering the Patriots for USA TODAY Sports Media Group and Boston Globe Media. Follow him on Twitter at @henrycmckenna.\n[Want great stories delivered right to your inbox? Create or log in to your FOX Sports account, follow leagues, teams and players to receive a personalized newsletter daily.]\n", "description": "Keon Coleman isn't a speedster and didn't have eye-popping college stats, but here's why he's the guy Josh Allen wanted in the draft.", "hero_img": "https://statics.foxsports.com/www.foxsports.com/content/uploads/2024/05/coleman-16x9-1.jpg", "thumbnail": "https://a57.foxsports.com/statics.foxsports.com/www.foxsports.com/content/uploads/2024/05/128/72/coleman-16x9-1.jpg", "category": "NFL", "date": "Wed, 01 May 2024 11:43:54 -0400", "comments": []}, {"title": "Davante Adams has no regrets over Packers trade but admits Jordan Love is a 'baller'", "url": "https://www.foxsports.com/stories/nfl/davante-adams-has-no-regrets-over-packers-trade-but-admits-jordan-love-is-a-baller", "content": "Davante Adams isn't feeling remorse over asking to be traded to the Las Vegas Raiders in 2022, but Jordan Love's emergence with the Green Bay Packers has caught his attention.\nThe star wide receiver, who asked out of Green Bay in 2022 due to uncertainty over the franchise's long-term situation at quarterback, admitted that he wasn't sure how good Love would be during his time with the Packers.\n\"At the time when I was there, I hadn't seen enough [of Love], to say for sure 'this is what I should do [stay with the Packers],'\" Adams told his teammate Maxx Crosby on \"The Rush Podcast.\" \"In hindsight, like we talked about, the kid is a f---ing baller, man. I'm so happy for him.\"\nWhen Adams was traded to the Raiders, Love had spent his first two seasons in the league sitting behind Aaron Rodgers after the team selected him in the first round of the 2020 NFL Draft. Rodgers had also demanded a trade in the offseason prior, but he signed a three-year extension to remain with the team in 2022.\nHowever, Rodgers only lasted in Green Bay for one more season. He demanded a trade in 2023 before being moved to the New York Jets. That move finally allowed Love to become the Packers' starting quarterback. Following a shaky start to the season, Love settled in and threw for 4,159 years, 32 touchdowns and 11 interceptions with a 96.1 passer rating, adding 247 rushing yards and four rushing scores. \nLove also led the Packers to a late postseason push, helping the team to a 6-2 record in their final eight games to finish 9-8. He continued his strong play in the playoffs, throwing three touchdowns in an upset win over the Dallas Cowboys in the opening round. He got off to a strong start in the NFC divisional-round matchup against the San Francisco 49ers, helping the Packers hold the lead for the majority of the game. But he threw two interceptions in the second half, sealing Green Bay's fate. \nAdams, meanwhile, asked for a trade to the Raiders partly because of his friendship with Derek Carr. That only lasted one season as the Raiders opted to cut Carr in the 2023 offseason. Las Vegas notably struggled to replace him in 2023, signing Jimmy Garoppolo but benching him due to poor play in the middle of the season while fourth-round rookie Aidan O'Connell threw for 2,218 yards, 12 touchdowns and seven interceptions in 11 games. Garoppolo was released over the offseason, and the team signed journeyman Gardner Minshew. \nAs the receiver continued to insist that he doesn't have any regrets about wanting out of Green Bay, he admitted that he would've liked to play with Love.\n\"I haven’t had the chance to truly sit down and talk with him,\" Adams said. \"But I want to tell him at some point ‘I definitely don’t regret changing, but I’m super proud of what you’ve done. If there was a way I could pull you over here and drag you with me, that would have been cool too.’ Because, obviously, we saw what he did at the end of the year. I don’t regret what I did, but, at the same time, it’s definitely you look back on it like ‘damn, that boy kind of balling right now.’\" \nLove, 25, has already positioned himself well in arguments to be one of the league's top quarterbacks entering his second season as a starter. Adams also believes Love's already proven to be the next great quarterback in Packers history, continuing the uninterrupted lineage started by Brett Favre in the 1990s. \n\"I think he has shown that,\" Adams said. \"He is starting to come into his own. You can see the way he is talking in front of the media and everything. It's like a whole different person than what I saw when I was there. That comes with experience.\"\nIn terms of which team is expected to perform at a higher level next season — Adams' old squad or his current one — there really is no comparison when it comes to the odds. \nAt FanDuel Sportsbook, the Packers are at +1900 to win the Super Bowl, while the Raiders are a long shot at +8000.\nIn addition, Love is tied with the Chargers' Justin Herbert for the sixth-best odds to win MVP next season, at +1400.\nLove and Adams are tied at +6000 to win Offensive Player of the Year. \nLastly, Green Bay's Over/Under win total is set at 9.5, while Las Vegas' is at 6.5, and the Packers are at -168 to make the playoffs, while the Raiders are at -470 to miss the postseason.\nFollow along with FOX Sports for the latest news on the NFL and other sports.\n", "description": "Davante Adams shared on a recent podcast that \"it would have been cool\" to have the opportunity to play with Jordan Love.", "hero_img": "https://statics.foxsports.com/www.foxsports.com/content/uploads/2024/05/Jordan-Love-Davante-Adams.jpg", "thumbnail": "https://a57.foxsports.com/statics.foxsports.com/www.foxsports.com/content/uploads/2024/05/128/72/Jordan-Love-Davante-Adams.jpg", "category": "NFL", "date": "Wed, 01 May 2024 11:43:42 -0400", "comments": []}, {"title": "Can Jim Harbaugh turn the Chargers into winners? He’s done it everywhere else", "url": "https://www.foxsports.com/stories/nfl/can-jim-harbaugh-turn-the-chargers-into-winners-hes-done-it-everywhere-else", "content": "COSTA MESA, Calif. — Jim Harbaugh sleeping in a souped-up RV on Huntington Beach next to the Pacific Ocean came as no surprise to J.T. Rogan. \n\"That's par for the course,\" said Rogan, who played running back for Harbaugh at his first coaching stop at San Diego, then later joined his staffs at Stanford and Michigan. \"He's about efficiency. What more do you need, right? You've got your bed. You've got your bathroom. \n\"At Michigan, he just wore all the team-issued stuff — khakis and whatever top he wanted to put on with a Michigan logo. He doesn't want or need much. He doesn't have any hobbies or recreation of any sort. It just felt so on brand.\" \nHarbaugh appears to be thoroughly enjoying his first few months with the Los Angeles Chargers. It started with the $80 million head coach living in an RV before his family joined him from Michigan. It included a trip to Home Depot with strength coach Ben Herbert to purchase a Shop-Vac for the team's training facility. And, oh yes, Harbaugh has also been working closely with franchise quarterback Justin Herbert to help him grow as a player.\nHarbaugh spent two months at the waterfront RV park, camped not far from offensive coordinator Greg Roman, who Harbaugh said has a rig \"like the rock bands go around in.\" Harbaugh came up with the RV idea from his favorite TV show of the 1970s, \"The Rockford Files\" starring James Garner. The title character, private detective Jim Rockford, lived in a beat-up trailer on Malibu Beach. \n\"It's a good place to think,\" Harbaugh said about his time in the RV. \"A time for some solitude. Plus, I just go to bed early. Watch a Rockford CD and go to bed.\" \nWith Harbaugh having moved into a house with his family, the time for solitude might be over. But that won't stop him from relentlessly focusing on turning around a franchise that has won only one playoff game since moving to Los Angeles in 2017. That's why the Chargers hired him. He's a pro at reclamation projects, turning struggling programs into winners at every stop as a head coach, including San Diego, Stanford, the San Francisco 49ers and most recently Michigan, where he led the Wolverines to a 15-0 record and the national championship in his final season. \nHarbaugh has the tattoo to prove it, which he promised his players he would get if the team won the national title.\nHow has Harbaugh turned so many programs around?\n\"The hardest practices, the hardest working conditions, universally,\" said Rogan, who became San Diego's all-time leading rusher playing for Harbaugh. \"Everyone you talk to, they say it's going to be the most difficult experience. But the rewards are going to be immense.\" \nBig-time competitors welcome\nDuring his time with the Chargers from 1999 to 2001, Mike Riley coached Harbaugh and later coached against him when Riley was at Oregon State and Harbaugh was at Stanford. So Riley got an up-close view of Harbaugh's intensity as both a player and as a coach.\n\"I don't think anyone has ever done a better coaching job than Jim did at Stanford,\" Riley told FOX Sports. \"They were not a very good team. And he transformed them into a physical, precision-based outfit, and they ended up being so good. He just kept building that team until they were one of the best in the country. And I just thought that was one of the really great examples of transforming a program.\" \nIn 1999, the Chargers acquired the 36-year-old Harbaugh to be the backup quarterback to first-round pick Ryan Leaf. But when Leaf suffered a shoulder injury in training camp, Harbaugh became the starter. The Chargers started 4-7, but with Harbaugh under center and a strong defense anchored by Junior Seau and Rodney Harrison, they won four of their last five games and fell just short of the playoffs.\nThe turning point of the season may have been a halftime dust-up between Harbaugh and Chargers safety Mike Dumas during a road game against the Oakland Raiders. It was because of the team's underperforming offense.\n\"He wasn't ever going to back down from anything,\" Riley said of his QB. \"Something happened right before halftime and Mike said something. And Jim and Mike were jawing on their way off the field. And they waited until they got off the field and out of sight of the fans, and then they went at it. And then they got separated and we went out and played the second half.\" \nThat Harbaugh intensity has never wavered. Eric Bakhtiari, the older brother of longtime Green Bay Packers left tackle David Bakhtiari, played defensive end for Harbaugh at San Diego and with the 49ers. \n\"It was so special having him, the way he pushed us and celebrated us,\" Bakhtiari said. \"What we had there was so unique. \n\"Even when he was at San Francisco, he really elevated everyone in the right way, but he was a lot more open to player feedback than when he was in San Diego. He knew that he knew best when we were in San Diego. And he knew that it would be best to have more of collaborative approach with professionals.\" \nBakhtiari was part of the hiring committee when San Diego interviewed Harbaugh in 2004. He recalls a recently retired player who was an intensely committed coach willing to lead by example, showing players how to compete at an elite level.\n\"We expected to go to San Diego and live at the beach,\" Bakhtiari said. \"Some of the guys wanted to surf, play football and get a good education. So, Harbaugh's first day, he goes, ‘Look, if you came here to live at the beach, surf, be a student and play football on the side, this team is no longer for you.' \n\"And everyone was kind of like, ‘Wait, what?'\"\nHarbaugh would do push-ups while the players stretched at the start of practice, groaning and grunting in his khakis as he worked his way up to 100.\n\"So it was 25, then it was 36,\" Bakhtiari said. \"Then it was 52, then it was 73, and then it was 83. \"And he'd get up and announce, ‘Eighty-three, men, getting closer and better every day. This is what it's all about.'\" \nThe ultra-competitive head coach also wasn't shy about jumping back into action during practice. \n\"If the scout team wasn't giving the defense the look that we felt we needed, he would be like, 'Get out, I'm going in,'\" Bakhtiari said. \"He would flip his hat around backwards and go in at quarterback. He would go in there, drop back, and if I got pressure he would scramble out at full speed. I remember one time I was in hot pursuit and he stopped, turned on a dime, and he made me sprain my ankle. And he just looked back and laughed at me and threw the ball downfield.\n\"He would throw these rockets — perfect placement. And it would hit their hands and drop. And he'd be like, ‘Aaah, all good until the ball got there.'\"\nNobody has it better than Harbaugh\nYes, the Harbaughisms are a thing.\nHis most popular, of course, is: \"Who's got it better than us? Nobody.\"\nOthers gleaned from Harbaugh's father, Jack Harbaugh, who was a longtime high school and college football coach, include: \n\"Attack each day with an enthusiasm unknown to mankind.\"\n\"Better today than yesterday, better tomorrow than today.\" \n\"Attitude is gratitude.\" \nAnd we can already add a few new ones from this year's press conferences with the Chargers: \n\"Fat is the enemy of speed.\"\n\"Offensive linemen we look at as weapons.\"\n\"Don't let the Powder Blues fool you.\"\n\"Big-time competitor. Competitors welcomed.\"\nWhile perhaps the Ted Lasso, made-for-TV quips can come off to Gen Z players as a little corny, Rogan says they are effective ways for Harbaugh to communicate his message.\n\"It's the receipts, right?\" Rogan said. \"I think the tendency could be, yeah, it's played out or whatever. But is winning played out? No, OK so maybe that's the price you have to pay in order to get the wins? \n\"It's a recipe. Maybe not all the ingredients in a recipe taste great. I don't eat basil leaves or oregano raw, but they sure are nice complements to great Italian dishes.\"\nAccording to former Michigan linebacker Junior Colson, recently drafted by Harbaugh to play for the Chargers, it's all a recipe for success.\n\"He's the best coach out there,\" Colson said. \"He's the best coach to play for, that I believe in. He's a winner. That's something that you always want to follow. You want to follow a winner. You want to be with winners. I believe that I'm with a winner right now.\" \nRogan added a twist to Harbaugh's most famous motto:\n\"The great one is ‘Who's got it better than us? Nobody.'\" Rogan said. \"It's not well known, but one time he was like, ‘Future us has it better than us right now.' And you can't really make that a saying, but that's the 2.0 version. ‘Who's got it better than us? Nobody — except possibly the future us.'\"\nCan it really work in Los Angeles?\nNew Chargers GM Joe Hortiz met Jim Harbaugh before John Harbaugh. \nJim Harbaugh was traded to the Baltimore Ravens in 1998, which happened to be the beginning of Hortiz's 26-year run with the team. And Harbaugh invited Hortiz to play racquetball with him and backup quarterback Eric Zeier.\n\"I was 22 years old,\" Hortiz said. \"I'm a kid. It's the coolest thing in the world. I'm getting ready to go play with a starting NFL quarterback and his backup. I'm going to show them that I'm an athlete. I'm going to show them that I can hang.\" \nThe racquetball game, however, didn't exactly go according to plan for Hortiz. \n\"I swear to you, I'm so blessed to be here today that I got out of that room,\" he joked. \"I was getting thrown around. I'm getting ready to hit a ball off of the wall, Jim comes in and just chucks me into the middle of the court. I realized that I was there just to give them a break.\" \nHortiz saw firsthand the competitive zeal that has driven Harbaugh all his life, and that competitiveness is the reason why many NFL observers believe he will succeed with the Chargers. Hortiz sees that commonality between the two Harbaugh brothers. \n\"It's their passion for the game, their love of the game, their commitment to the organization and the team,\" Hortiz said. \"They're obviously committed to winning. They're highly competitive and great leaders. They're very, very similar in that regard. I loved working with John for 16 years, and I absolutely love working with Jim.\"\nWith his family still making the transition from Baltimore, Hortiz is sharing his home with assistant general manager Chad Alexander and director of player personnel Corey Krawiec. \n\"What you do is you never leave the conversation at the office,\" Hortiz told FOX Sports. \"With Chad and Corey, I may not see them all day because we're each doing our own thing. And then when we get together, it's like a staff meeting at night.\"\nBut when working with Jim Harbaugh, there's no such thing as too much preparation.\n\"His preparation was unparalleled,\" Riley said of Harbaugh the player. \"His physical preparation prior to the season and then during the season, his hard work at practices. And then his diligence in knowing what we're doing and studying for the game, knowing the game plan and just being prepared in every way, physically and mentally. And then he was such a competitor during the games. \n\"Because of everything he put into it, nobody wanted to win more than Jim did.\" \nAnd that obviously hasn't changed during his 22-year coaching career, which now lacks only one accomplishment. When the Chargers hired him, the 60-year-old Harbaugh explained that he left his alma mater for the chance to win a Super Bowl. \n\"There’s no Lombardi Trophy in college football,\" he said. \"And I got so many sands left in the hourglass. And I wanna take a crack at that.\"\nIf he pulls it off, it will be a first in the history of the Chargers franchise. But no one who has played for or worked with Harbaugh would bet against him.\n\"He says make your goals so audacious that people laugh at them. And it's worked for him at every level, including as a player,\" Rogan said. \"So at some point, is it radical or is your thinking just too small? \n\"That's what he introduces to his players. When he instills and invigorates that radical belief, and now he can say, ‘Yeah, I took a team from 6-10 to 13-3 and the NFC Championship. Yeah, we're doing that here.' He's got the receipts. \n\"And he's been doing that even before he had the receipts.\"\nEric D. Williams has reported on the NFL for more than a decade, covering the Los Angeles Rams for Sports Illustrated, the Los Angeles Chargers for ESPN and the Seattle Seahawks for the Tacoma News Tribune. Follow him on Twitter at @eric_d_williams.\n[Want great stories delivered right to your inbox? Create or log in to your FOX Sports account, follow leagues, teams and players to receive a personalized newsletter daily.]\n", "description": "On the surface, Jim Harbaugh is the quirky guy in khakis. But underneath, he’s relentless in his pursuits. And what he wants now is a Lombardi Trophy.", "hero_img": "https://statics.foxsports.com/www.foxsports.com/content/uploads/2024/04/2024-04-30_What-drives-Jim-Harbaugh_16x9.jpg", "thumbnail": "https://a57.foxsports.com/statics.foxsports.com/www.foxsports.com/content/uploads/2024/04/128/72/2024-04-30_What-drives-Jim-Harbaugh_16x9.jpg", "category": "NFL", "date": "Wed, 01 May 2024 10:11:39 -0400", "comments": []}]